{"title":"Nerd Calistênico","description":"","language":"pt-br","link":"https://nerdcalistenico.github.io/imhomovies","pubDate":"Fri, 24 Jan 2020 18:20:00 GMT","lastBuildDate":"Sat, 27 Feb 2021 18:26:54 GMT","webMaster":"IMHO Movies","items":[{"title":"Jumanji - Próxima fase","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/jumanji-the-next-level/","description":"Tentado em revisitar o mundo de Jumanji, Spencer (Alex Wolff) decide consertar o jogo de videogame que permite que os jogadores sejam transportados ao local. Logo o quarteto formado por Smolder Bravestone (Dwayne Johnson), Moose Finbar (Kevin Hart), Shelly Oberon (Jack Black) e Ruby Roundhouse (Karen Gillan) ressurge, agora comandado por outras pessoas: os avôs de Spencer e Fridge (Danny DeVito e Danny Glover) assumem as personas de Bravestone e Finbar, enquanto o próprio Fridge (Ser’Darius Blain) agora está sob a pele de Oberon.Dados técnicosTítulo original: Jumanji: The Next LevelData de lançamento: 16 de janeiro de 2020 (Brasil)Direção: Jake KasdanRoteiro: Jeff Pinkner e Scott RosenbergGênero: Aventura e ComédiaPaís: EUADuração: 123 minClassificação: 12 AnosOrçamento: $125 milhõesElenco Dwayne Johnson Dr. Smolder Bravestone Karen Gillan Ruby Roundhouse Kevin Hart Moose Finbar Jack Black Professor Sheldon Oberon Danny DeVito Eddie Gilpin Danny Glover Milo WalkerOpiniãoTemos o segundo filme do reboot de Jumanji. O primeiro filme Jumanji: Bem-vindo à Selva, teve estreia aqui no Brasil em 4 de janeiro de 2018.Para quem gosta do longa original que estreiou no Brasil, em 1996, pode não gostar muito do reboot que troca o jogo de tabuleiro pelo videogame. Eu sou uma dessas pessoas, mas acabo gostando dessa sequência, por ser um reboot e não um remake.Como já mencionei algumas vezes, parte da nostalgia se dá por conta da criatividade dos filmes da década de 80 e 90. Por mais que a computação gráfica tenha trago muitas possibilidades na parte visual, se perde um pouco da criatividade, aonde menos é mais.Por isso, o original e o reboot promovem experiências totalmente diferentes. Sendo assim, não vale comparações e é preciso entender que o filme atual, segue a tendência comteporânea de entretenimento.A química entre as 4 personas principais do longa, vem se mostrando boa desde o primeiro filme de 2018. Dwayne Johnson e Kevin Hart pode continuar na parceria que está dando certo e se continuar assim, teremos mais comédias boas pela frente.Uma coisa que me chamou a atenção no 2 filmes é que Dwayne Johnson, tem se dedicado as interpretações. Por mais que um filme nesse estilo, não tenha foco na interpretação, o ator mostrou que queria passar uma verdade com a interpretação do seu personagem.O longa que tem todos os ingredientes para ser apenas algo comercial, mas traz detalhes de interpretação e uma boa química para a comédia.O diferencial dese longa, é se mostrar mais engraçado do que o primeiro filme do reboot. Então, temos um bom entretenimento que garante algumas gargalhadas com duração de 2 horas de diversão.","pubDate":"Fri, 24 Jan 2020 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/jumanji-the-next-level/","category":"em cartaz"},{"title":"Coringa","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/coringa/","description":"O comediante falido Arthur Fleck encontra violentos bandidos pelas ruas de Gotham City. Desconsiderado pela sociedade, Fleck começa a ficar louco e se transforma no criminoso conhecido como Coringa.Dados técnicosTítulo original: JokerData de lançamento: 03 de outubro de 2019 (Brasil)Direção: Todd PhillipsRoteiro: Todd Phillips e Scott SilverGênero: DramaPaís: EUA e CanadáDuração: 122 minClassificação: 16 AnosOrçamento: $55–70 milhõesElenco Joaquin Phoenix Arthur Fleck / Coringa Zazie Beetz Sophie Dumond Robert De Niro Murray Franklin Brett Cullen Thomas Wayne Laura Dern Penny FleckOpiniãoEra para ter escrito esse artigo em 07/11 ou antes. Assisti o longa no dia da estreia, mas graças a correria, só agora escrevendo sobre ele.O filme surpreendeu bastante pela coragem, por trazer uma história muito complexa e que pode ser facilmente banalizada por opiniões rasas sobre os assuntos abordados. Com toda a certeza a interpretação de Joaquim Phoenix, foi a grande cerreja do bolo.A expectativa que foi criada para esse filme, foi muito grande. Por isso, bateu o receio de como seria a história.Acredito que a maior dúvida é se o Coringa é uma vítima da sociedade ou não. Não entrando muito em polêmicas, até mesmo por já estar escrevendo bem atrasado, vou dar a minha opinião.O sucesso do filme mostra que foi entendido que não se tem nada demais. Isso quer dizer que nós como seres humanos, vivendo em um mundo com N possibilidades e inúmeras bolhas sociais, estamos expostos a várias situações.Arthur, tem grandes traumas psicológicos na infância e a grande responsável é a sua mãe. Algo que é infeliz, mas é muito possível de acontecer. Décadas e décadas com esses problemas e fora as coisas que foram sendo acrescentadas ao longo dos anos. Não é uma defesa ao Coringa. Se a história fosse de alguém aqui na vida real, a pessoa merece passar o resto da vida, preso.Hoje em dia, ficou muito comum em se falar em “vítima da sociedade”. A história é bem dramática, mas como já mencionei, estamos expostos. Aí, vem as questões de conselho tutelar, direitos humanos e etc…Acredito que a grande sacada do filme, é mostrar que mesmo com processos ou campanhas para ajudar as pessoas, na prática é algo muito insensível. E também mostra o poder do egoísmo humano, onde coisas que algumas pessoas fazem e não perdem 1 segundo da sua vida para pensar nisso, pode acabar com a vida de outra pessoa.A mente humana é bem complexa, vimos uma série de acontecimentos que ocorreram com o protagonista, mas só a questão com a mãe, já poderia ser o suficiente. O ser humano nasce e é moldado, mas também tem características individuais.Se consultarmos especialistas em assassinos, suicidas e outros grupos, podemos ver alguns padrões. Também veremos inúmeros vivências, motivos ou não e mais outros detalhes. Veremos pessoas que mataram por 1 real, pessoas que mataram por vingança, acidente, impulso e mais. Pessoas que se suicidaram por traumas terríveis, outros por fim de namoro e mais.Tem pessoas que matam por causa do fim de um relacionamento, outras se matam e outras vivem normalmente.Então, o longa merece muitas estrelas e prêmios por abordar assuntos tão polêmicas e que as vezes esquecemos de analisar.E para mim, a grande mensagem é que mesmo que esteja um caos, faça o bem e não vale a pena pisar nas outras pessoas. Ódio gera ódio e muitas vezes você consegue ajudar muitas pessoas, só com empatia.","pubDate":"Thu, 14 Nov 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/coringa/","category":"em cartaz"},{"title":"Angry Birds 2","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/angry-birds-2/","description":"Os pássaros incapazes de voar e os porquinhos verdes engenhosos levam a sua rivalidade a outro nível. Quando surge uma nova ameaça, que coloca a Ilha dos Pássaros e a Ilha dos Porcos em perigo, Red, Chuck, Bomb e a Super Águia recrutam a irmã de Chuck, Silver, declaram tréguas e formam uma aliança com os seus inimigos porcos. Leonard, a sua assistente Courtney e o Garry juntam-se à equipe.Dados técnicosTítulo original: The Angry Birds Movie 2Data de lançamento: 03 de outubro de 2019 (Brasil)Direção: Thurop Van-OrmanRoteiro: Peter Ackerman, Eyal Podell e Jonathon E. StewartGênero: Animação e comédiaPaís: EUADuração: 97 minClassificação: 6 AnosOrçamento: $65 milhõesElenco Jason Sudeikis Red Bill Hader Leonard Danny McBride Bomb Peter Dinklage Super Águia Leslie Jones ZetaOpiniãoTivemos o primeiro filme da franquia em 2016, e agora temos a continuação da saga. Angry Birds dominou o mundo das crianças e adultos por muito tempo. Ainda hoje, é um produto que é bem consumido.Por mais que tem uma história que pode parecer limitada, pode ser expandida com tranquilidade. Isso pode ser visto no segundo filme da franquia.Onde se tinha a existência de apenas 2 ilhas, se descobre uma terceira, que tem ligação com um habitante da ilha dos pássaros.Angry Birds é agradável de se ver, pois seus personagens tem muitas caracterísicas distintas, que abrange diversos perfis interessantes.O roteiro é bem infantil, mas deve agradar as crianças. Para os adultos como eu, a parte gráfica e a trilha sonora, é que chamam mais a atenção.Mesmo quem não gosta de animação, deve reconhecer que a evolução da tecnologia nessa área, traz uma qualidade visual impressionante. Sou do tempo que a criatividade conta bastante. Então, mesmo os filmes trash dos anos 80 e 90, sempre deixarão saudades.Mesmo assim, vale apreciar os detalhes que são possíveis de se recriar com a computação gráfica.No longa, o ponto alto foi com a trilha sonora. Uma sequência de músicas bem conhecidas e antigas. Por isso, lembrei dos anos 80 e 90.Uma animação voltada para a criançada, mas se esforça para atingir todo o público.","pubDate":"Mon, 07 Oct 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/angry-birds-2/","category":"em cartaz"},{"title":"Rambo - Até o fim","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/rambo-ate-o-fim/","description":"O tempo passou para Rambo, que agora vive recluso em um rancho. Sua vida marcada por lutas violentas ficou para trás, mas deixou marcas inesquecíveis. No entanto, quando uma jovem de uma família amiga é sequestrada, Rambo precisa confrontar seu passado e resgatar suas habilidades de combate para enfrentar o mais perigoso cartel mexicano. A busca logo se transforma em uma caçada por justiça, na qual nenhum criminoso é perdoado.Dados técnicosTítulo original: Rambo - The Last BloodData de lançamento: 19 de setembro de 2019 (Brasil)Direção: Adrian GrunbergRoteiro: Sylvester Stallone e Matt CirulnickGênero: AçãoPaís: EUADuração: 100 minClassificação: 18 AnosOrçamento: $50 milhõesElenco Sylvester Stallone John Rambo Paz Vega Carmem Delgado Yvette Monreal Gabrielle Sergio Peris‑Mencheta Hugo Martinez Adriana Barraza Maria BeltranCronologiaA série de filmes baseada no romance First Blood, de 1972, escrito por David Morrell, se tornou-se célebre pelos filmes protagonizados por Sylvester Stallone.Rambo: Programado para Matar (Rambo: First Blood) - 1982Rambo II: A missão (Rambo: First Blood Part II) - 1985Rambo III - 1988Rambo IV - 2008Rambo: Até o fim (Rambo: The Last Blood) - 2019OpiniãoSempre gosto de citar que não faz sentido, pessoas compararem alguns gêneros de filmes. O sucesso de um longa está na questão de cumprir o papel ao qual se propôs.Um espectador que vai assistir ao quinto filme da franquia de Rambo, está mais que ciente do que esperar. Particularmente, não me recordo se vi o quarto filme da franquia e a boa notícia que isso não prejudicou.Com toda a certeza, a dinâmica do filme me agradou bastante. Depois de décadas e décadas de filmes de ação, é dificil trazer algo novo. Sendo assim, o longa se mostrou muito direto.Costumo assistir filmes de ação e aventura, porque alguns filmes que investem muito no drama batido como se fosse uma novela, despertam a minha impaciência. Alguns filmes do gênero de ação, também são compostos de dramas batidos.No longa, tem uma pitada de drama, mas gostei de como ele se desenvolveu. Não se precisa ficar enrolando em alguma subtrama, para você absorver a tensão ao se levar para a vida real. O filme trabalha muto bem isso, sem muitas pausas e mantendo um ritmo que nos faz ficar atentos em cada momento.Ao assistir, tive a impressão de um veterano com os seus demônios e uma pequena implicância com a ingenuidade da menina que vai para outro país e cai em uma cilada. Sendo que você nota que isso foi intencional, quando o próprio Rambo, menciona que a menina é a personificação da ingenuidade que ele talvez nunca teve.Fora a dinâmica que não deixa você pensar que não tem inovação de roteiro, não termina com o clichê de que tudo deu certo e termina bem.A visão realista agradou bastante, trazendo um cenário muito possivel de acontecer e se bobear pode ter uma pitada de fatos reais.Não pesquisei se foi realmente o último filme da franquia, mas considero que foi um fechamento mais que digno. Pegar algo de 1982, carregar até 37 anos depois e fechar com cenas surpreendentes, merece uma boa consideração.Sendo que não apelou para coisas ridículas e a cena do carro onde tem a questão de tortura com o dedo, fez jus a franquia e a personalidade de John Rambo.Por isso, considero que cumpriu muito bem o seu papel. Se comparar Rambo com A Cinco Passos de Você, O quarto de Jack ou sei lá. Você não sabe o que está fazendo e não faz a mínima ideia do que está falando.Tem pessoas que gostam só de ação, drama, romace ou de quase todos os gêneros ao mesmo tempo. Uma pessoa que só gosta de drama, não tem o que comentar sobre Rambo e nem precisa. O que importa é a sua sensação de satisfação ou não, quando sai do cinema.No mesmo dia, eu assisti ao filme Bacurau e não me importa se mandou bem em alguma área técnica. Só sei que sai frustrado e com várias perguntas que o filme criou sobre ele mesmo. Sendo diferente quando você sai refletindo sobre o filme e frustrado com coisas sem setido durante o longa. Por isso, nem vou escrever sobre esse longa nesse blog.Portanto, basta cumprir o que é proposto e não ter dependências. Em uma fraquia se tem dependências, pois precisa conhecer os filmes anteriores. Quando não é uma franquia e precisa ver algo fora do longa para entender o que viu ou está vendo, acho muito complicado e sem sentido.Fica a dica de um filme de ação que construiu décadas de entretenimentoe fecha com uma boa dinâmica.","pubDate":"Wed, 25 Sep 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/rambo-ate-o-fim/","category":"em cartaz"},{"title":"Vai que cola 2 - O começo","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/vai-que-cola-2-o-comeco/","description":"Uma feijoada no Morro do Cerol põe juntos pela primeira vez os personagens que conquistaram o público na TV e no cinema. Neste novo longa da franquia, que nasceu do sucesso da série no Multishow e ganhou as telas dos cinemas, está a turma do Méier para contar como tudo começou.Dados técnicosTítulo original: Vai que cola 2 - O começoData de lançamento: 12 de setembro de 2019 (Brasil)Direção: César RodriguesRoteiro: Renato Fagundes, João Paulo Horta e Leandro SoaresGênero: ComédiaPaís: BrasilDuração: 130 minClassificação: 12 AnosOrçamento: $- milhõesElenco Samantha Schmütz Jéssica Marcus Majella Ferdinando Emiliano D’Ávila Máicol Cacau Protásio Teresinha Catarina Abdalla Dona Jô Fiorella Mattheis Velna Silvio Guindane Lacráia Paulinho Serra Zélio Fábio Lago Tiziu Érico Brás AfrânioOpiniãoVai que cola está sendo transmitido no multishow desde 2013, e o primeiro filme foi lançado em 2015. Agora em 2019, temos o segundo filme que conta a história do período que antecede todo o enredo que acompanhamos na sitcom.Essa introdução serviu para mostrar que com essas informações, apostar no roteiro seria inocência demais. Afinal, após 6 anos e inumeros episódios da sitcom, falar sobre o começo é algo que já se encontra totalmente fora do contexto, para ser engraçado. O time (tempo) da comédia, foi perdido.Mesmo tendo uma história que pode não ser um atrativo para os espectadores, pelo motivo que citei acima, agrada de imediato pela qualidade de direção de fotografia. A combinação da fotografia, figurinho, cenário e qualidade de câmera, fazem o longa deixar a falta de surpresas no roteiro em segundo plano.Uma sitcom pode cair na grande armadilha de ficar cansativa, principalmente se os personagens não tem uma evolução em sua construção. Vai que cola se encaixa no perfil que cai nessa armadilha. Para quem nunca viu, pode achar muito interessante. Quem já acompanha há anos ou acompanhou por um tempo, terá poucos momentos para gerar uma gargalhada. Ao assistir o longa, só teve um momento em que foi muito engraçado e deixando claro que o intuito era só contar como foi o ínicio.A sensação qque deixa, é que tinha que ser feito esse filme para fechar as pontas soltas na sitcom. Infelizmente, não se concentrou em reanimar o público que não vê algo novo em um longo período.Como já citei, a qualidade visual, impressiona bastante. Se a série fosse para esse formato de qualidade visual, tirando a questão de público e cenário que gira, teríamos algum diferencial.Apoiaria em 100%, que o filme provocasse essa mudança no formato atual da sitcom. Indo para o estilo WIfe and kids (Eu, a patroa e as crianças), somando a qualidade visual e focando mais na evolução dos personagens.Com isso, trazendo a sitcom para um caminho que pode se tornar mais duradouro, em relação ao apego dos espectadores pelos personagens. Caso contrário, temos o retorno do Zorra Total.","pubDate":"Tue, 24 Sep 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/vai-que-cola-2-o-comeco/","category":"em cartaz"},{"title":"Garota Dourada","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/nostalgia/garota-dourada/","description":"Um surfista, recém separado, viaja com um amigo para uma ilha paradisíaca onde conhece uma garota de hábitos liberais que pode ser o amor de sua vida.Dados técnicosTítulo original: Garota DouradaData de lançamento: 1984 (Brasil)Direção: Antonio CalmonRoteiro: Antonio Calmon e Flávio R. TambelliniGênero: Aventura, Comédia e DramaPaís: BrasilDuração: 105 minClassificação: 18 AnosOrçamento: $- milhõesElenco André De Biase Ricardo Valente Bianca Byington Diana Sérgio Mallandro Zeca Andréa Beltrão Glória Claudia magno Patrícia Roberto Bataglin Betinho Marcos Palmeira —OpiniãoVejam só, o longa Menino do Rio, teve uma sequência. Ao assistir esse filme, o que parecia uma falha também no primeiro longa, se tornou uma coisa boa.Os 2 filmes juntos, tem elementos mais que suficientes para inúmeros caminhos possíveis. Ao assistir 25 anos após a produção, dá uma leve tristeza ao ver que não teve mais sequências e não foi explorado mais essa história. Aí, lembro de Armação Ilimitada e fico mais tranquilo que investiram mais um pouco, no estilo.Quando cito que uma falha se tornou algo bom, me refiro a montagem da estrutura para o filme, sem perda de tempo. Temos o personagem do Betinho, que seria o “vilão” da trama. O filme tem 105 minutos, mas se demorou 5 minutos entre o personagem brigar com o protagonista e ficar de bem com ele, foi muito. Nos 2 filmes, se teve muitas situações desse tipo. Por isso, que citei no último artigo, que seriam resumos de uma novela.Com isso, temos uma trama superficial, mas por outro lado, temos a apresentação de elementos que poderíam evoluir em algumas sequências. A sensação não é de um vazio de história, mas de que se tem muita coisa que merece ser melhor explorada. Sendo necessário até virar uma série.Nesse filme, me decepcionou bastante a voz do personagem Shangri-la. Colocaram um efeito eletrônico que devia ser novidade na época, mas só estragou. Era para ser uma coisa filosófica, mas destoa muito e só atrapalha.Na trama, o Menino do Rio teve uma filha com a Patrícia, que teve destaque no primeiro longa e só faz uma participação neste. O que é algo muito bacana, dar a visão de continuação e não simplesmente ter uma história totalmente isolada.Também não posso deixar de falar, que foi interessante ver o Sérgio Mallandro nos 2 filmes. O longa tem suas falhas de atuação e continuidade dos acontecimentos, mas se vê que todos estão no mesmo nível. Se tem intérpretes que hoje são consagrados e outros em que a carreira foram de ladeira abaixo. Sendo que ainda temos que lembrar, que se tem muita coisa envolvida. Vamos deixar o mito em que um intérprete bom, faz sucesso com 1 segundo de atuação.Não sei o porquê, mas a história desse filme, se passou mais rápido. Talvez seja uma coisa natural por ser uma sequência e já conhecer o contexto e personagens.No final da exibição dos 2 filmes, estou ciente que se tem muitas falhas ténicas, mas isso fica em segundo plano. Acredito que os atores que participaram tem orgulho de ter registrado essa época das suas vidas. Acredito que só tem vergonha do passado, quem não evoluiu. No quadro geral, no mínimo essa franquia traz um astral leve e tranquilo para quem assiste aos filmes.Faz um excelente trabalho nos dias de hoje, ao nos permitir ver registrado o começo de muitos atores, ouvir uma boa trilha sonora e valorizar as belezas naturais que temos no Brasil.Deixo registrado aqui, essa franquia que marcou época.","pubDate":"Wed, 11 Sep 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/nostalgia/garota-dourada/","category":"nostalgia"},{"title":"Menino do Rio","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/nostalgia/menino-do-rio/","description":"Ricardo, um surfista carioca, envolve-se com uma garota rica da alta sociedade que guarda um segredo sobre o seu passado. Para viverem o seu romance, eles terão de enfrentar o preconceito da família dela e o tumulto criado por seu ex-noivo.Dados técnicosTítulo original: Menino do RioData de lançamento: 14 de janeiro de 1982 (Brasil)Direção: Antonio CalmonRoteiro: Antonio CalmonGênero: Aventura, Comédia e DramaPaís: BrasilDuração: 96 minClassificação: 18 AnosOrçamento: $- milhõesElenco André De Biase Ricardo Valente Claudia magno Patrícia Sérgio Mallandro Zeca Ricardo Graça Mello Pepeu Nina de Pádua Ciça Cissa Guimarães Aninha Claudia Ohana Soninha Ricardo Zambelli Adolfinho Evandro Mesquita PaulinhoOpiniãoNavegando no serviço de streaming da Amazon, me deparei com o filme e quis saber mais sobre esse longa. Ver o começo de alguns atores, chamou a minha atenção. Você pode conferir o filme na Amazon Prime Video.Acredito que o grande erro da maioria das pessoas que julgam os filmes, principalmente brasileiros, está na questão de não saberem o que envolve a produção e os recursos disponíveis para o mesmo.A primeira coisa é entender que estamos na década de 80, onde os recursos eram mais escassos e a tecnologia nem chega perto da de hoje.O longa traz uma história que tem muitos ingredientes que compõe uma boa narrativa, mas não são tão bem explorados. É nítido que o atores não tem muita experiência e as falas se destacam, ao invés das emoções.É interessante descobrir a existência de um filme que não conhecia e ao mesmo triste saber que alguns atores já morreram e ainda jovens. Esse é o caso de Ricardo Zambelli e Claudia Magno.O enredo é ambientado na clássica narrativa do garoto pobre e a menina rica, que vem ganhando mais detalhes e recursos em filmes que foram feitos posteriormente.O filme fez grande sucesso na época e hoje, ainda se mostra algo bom de se ver. Ele tem muitas falhas técnicas, de continuidade e atuação, mas considero muito melhor que alguns filmes atuais. Não apelou e montou uma história interessante, que ainda nos dias de hoje, desperta interesse de espectadores.A questão da inexperiência da época, fica mais atrelada a atuação dos jovens atores e ao abordar a história como um todo. Me explicando melhor, seria pegar um novela e resumir em um filme. Você entende o contexto, mas tem tantas subtramas, que o longa acaba ficando superficial.O filme foca na estrutura do personagem principal, que ganha mais destaque e não poderia ser diferente. Também temos:o casal de amigos;outros surfistas;o pai do personagem principal que leva outro tipo de vida;menina rica;garoto que está solto no mundo e tem fim trágico;riquinho bad boy;e mais.Por isso, já citei que o filme tem muito elementos bons para se trabalhar e sem falar na trilha sonora. Ricardo Graça Mello, acrescenta muito no longa.O que mais gostei, foi ser teletransportado para um ambiente sem preocupações. Os longas da década de 70 e 80, tem muito essa ideia de liberdade, mesmo com conflitos.Como sabemos, a tecnologia nos trouxe muitas vantagens, mas também, desvantagens. Já que conseguimos olhar tudo, muitas pessaos se concentram em criticar as coisas e só. Com isso, esquecemos de aproveitar a atmosfera que o longa cria, ou apenas nos faz reviver.O personagem principal só se preocupa em viver a sua vida, encontrar alguém para dividir isso e só. Foi muito bom ter contato novamente com um filme em que temos uma leveza em sua narrativa. Sem intrigas, apelação ou outras coisas que acredito, que não ajudam muito no seu papel de entretenimento saudável.Tendo uma postura imparcial, acredito se não tivesse as apelações nos filmes brasileiros, acho que nem teríamos produções nacionais. Se hoje é difícil, imagina em 1980. O longa ganha o meu respeito, ao conseguir fazer algo interessante para a época e anos posteriores, sem apelar. Temos que lembrar que produções tem custo e é alto. Querer ver um Vingadores nas telonas e achar que foi só pegar uma câmera e meia dúzia de pessoas para fazer, é viver em um bolha surreal.Pesquisando sobre o longa, descobri que André De Biase, nasceu para ser surfista nas telas. Em 1979, fez o longa Nos Embalos de Ipanema, também com a direção de Antônio Calmon. De 1985 a 1988, fez o nostálgico seriado Armação ilimitada.Fiz questão de colocar como imagem principal desta opinião, uma imagem é que o Di Biase, aparece no longa com uma camisa com a escrita armação. Seria uma premoniçào de 3 anos antes, ou tem relação? hahaFica a dica desse filme brasileiro, que marcou uma época.","pubDate":"Tue, 10 Sep 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/nostalgia/menino-do-rio/","category":"nostalgia"},{"title":"O Rei Leão 2019","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/o-rei-leao-2019/","description":"A aventura do jovem leão Simba, o herdeiro de seu pai, Mufasa. O tio malvado de Simba, Scar, planeja roubar o trono de Mufasa atraindo pai e filho para uma emboscada. Simba consegue escapar e com a ajuda de seus amigos,Timão e Pumba, ele reaparece como adulto para recuperar sua terra.Dados técnicosTítulo original: The Lion KingData de lançamento: 18 de julho de 2019 (Brasil)Direção: Jon FavreauRoteiro: Jeff NathansonGênero: Aventura e AnimaçãoPaís: EUADuração: 118 minClassificação: 10 AnosOrçamento: $250 milhõesElenco Donald Glover Simba Beyoncé Nala Seth Rogen Pumba Billy Eichner Timão Chiwetel Ejiofor ScarOpiniãoSempre há uma preocupação quando mexem com algo da nossa infância e esse filme está mexendo com a infância de milhões de pessoas. Acredito que o sucesso do filme de 1994, teve sua consolidação e marcou uma geração com mérito quase exclusivo para a série de animação Timão &amp; Pumba - 1995 a 1999.É claro, que isso se trata apenas da minha opinião. Tiveram 3 filmes da franquia O Rei Leão, mais 3 filmes e a série do Timão &amp; Pumba. Portanto, sempre vem a dupla (suricato e javali) em primeiro lugar nas lembranças.O Rei Leão (The Lion King) - 1994O Rei Leão 2: O Reino de Simba (The Lion King II: Simba’s Pride) - 1998O Rei Leão 3: Hakuna Matata (The Lion King 1½) - 2004Timão &amp; Pumba (série de TV) - 8 de setembro de 1995 / 24 de setembro de 1999Volta ao Mundo com Timão e Pumba (Around the World with Timon &amp; Pumbaa) - 1996Em Férias Com Timão &amp; Pumba (On Holiday with Timon &amp; Pumbaa) - 1997Jantando Fora Com Timão &amp; Pumba (Dining Out with Timon &amp; Pumbaa) - 1997Timão &amp; Pumba, trazem todo o bom humor e nostalgia de vários anos presentes na TV. O roteiro do longa é sólido e motivador, mas a história de Simba, necessita da personalidade da dupla, por isso dou destaque à eles.Com certeza os personagens marcantes com o suporte da trilha sonora muito bem escolhida no filme de 1994, foram a essência do sucesso que o mesmo obteve.O ponto alto do longa, fica no trecho onde Simba, Timão e Pumba, passeam pela floresta e começam a cantar a música tema do filme. Muitos não sabem, mas essa música é de longa data e foi escrita por Solomon Linda.Solomon Popoli Linda foi um cantor e compositor sul-africano de etnia zulu e que escreveu em 1920, a canção Mbube (leão na língua zulu), e gravou originalmente em 1939. Décadas depois, a mesma se transformou no sucesso mundial como The Lion Sleeps Tonight, tema do filme. A musica teve várias versões desde 1939, e em 1961, tivemos a versão The Lion Sleeps Tonight, gravada pela banda norte-americana de doo-wop (R&amp;B), The Tokens.O Remake também marca a história pelo realismo e inovação na tecnologia das imagens criadas digitalmente (CGI). O diretor Jon Favreu, implanta o mesmo processo foto-realista usado no filme Mogli: O Menino Lobo (2016), mas com melhores resultados. Cada criatura se move com muito realismo na aparência e cada paisagem parece um cartão postal. O céu noturno africano é reproduzido de forma muito realista.Felizmente, o longa permanece fiel à paixão e emoção das músicas originais. Todas as músicas, tanto líricas quanto instrumentais, dão o tom ao longo do filme. A qualidade de imagem, são incríveis e o enredo continua inspirador.Uma infância continua intacta e ganha uma melhoria surpreendente da tecnologia, deixando mais realista as historias que nos deixam com nostalgia. Parabéns ao envolvidos.","pubDate":"Sun, 21 Jul 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/o-rei-leao-2019/","category":"em cartaz"},{"title":"Homem-Aranha - Longe de Casa","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/homem-aranha-longe-de-casa/","description":"Peter Parker está em uma viagem de duas semanas pela Europa, ao lado de seus amigos de colégio, quando é surpreendido pela visita de Nick Fury. Convocado para mais uma missão heroica, ele precisa enfrentar vários vilões que surgem em cidades-símbolo do continente, como Londres, Paris e Veneza, e também a aparição do enigmático Mysterio.Dados técnicosTítulo original: Spider-Man: Far From HomeData de lançamento: 4 de julho de 2019 (Brasil)Direção: Jon WattsRoteiro: Chris McKenna e Erik SommersGênero: Ação, Aventura e Ficção científicaPaís: EUADuração: 130 minClassificação: 10 AnosOrçamento: $160 milhõesElenco Tom Holland Peter Parker / Homem-Aranha Samuel L. Jackson Nick Fury Zendaya Michelle “MJ” Jones Jacob Batalon Ned Leeds Cobie Smulders Maria Hill Jon Favreau Happy Hogan Marisa Tomei May Parker Jake Gyllenhaal MysterioFases do Universo MarvelFase 1 (2008-2012)Homem de Ferro / Iron Man - 2008O Incrível Hulk / The Incredible Hulk - 2008Homem de Ferro 2 / Iron Man 2 - 2010Thor - 2011Capitão América: O Primeiro Vingador / Captain America: The First Avenger - 2011Os Vingadores / The Avengers - 2012Fase 2 (2013-2015)Homem de Ferro / Iron Man 3 - 2013Thor: O Mundo Sombrio / Thor: The Dark World - 2013Capitão América 2: O Soldado Invernal / Captain America: The Winter Soldier - 2014Guardiões da Galáxia / Guardians of the Galaxy - 2014Vingadores: Era de Ultron / Avengers: Age of Ultron - 2015Homem-Formiga / Ant-Man - 2015Fase 3 (2016-2019)Capitão América: Guerra Civil / Captain America: Civil War - 2016Doutor Estranho / Doctor Strange - 2016Guardiões da Galáxia Vol. 2 / Guardians of the Galaxy Vol. 2 - 2017Homem-Aranha: De Volta ao Lar / Spider-Man: Homecoming - 2017Thor: Ragnarok - 2017Pantera Negra / Black Panther - 2018Vingadores: Guerra Infinita / Avengers: Infinity War - 2018Homem-Formiga e a Vespa / Ant-Man and the Wasp - 2018Capitã Marvel / Captain Marvel - 2019Vingadores: Ultimato / Avengers: Endgame - 2019Homem-Aranha: Longe de Casa / Spider-Man: Far From Home - 2019Fase 4 (Início 2020)Viúva Negra / Black Widow - 2020Os Eternos / The Eternals - 2020Pantera Negra 2 / Black Panther 2 - 2021Doutor Estranho 2 / Doctor Strange 2 - 2021Guardiões da Galáxia 3 / Guardians of the Galaxy 3 - 2022OpiniãoChegamos ao último filme da fase 3, onde temos a continuação para saber como ficará o legado de Tony Stark (O Homem de ferro).Antes de assistir nos vem aquela preocupação de como será o Universo da Marvel, após o Os Vingadores: Ultimato. Estou feliz em dizer que continua bem. O longa traz um enredo digno do Homem de ferro e mantém um ritmo bom durante toda a apresentação.O espectador consegue ser convencido que o protagonista tem um aliado contra um grupo (Elementais) de vilões que não tem uma personalidade humana. Se o filme continuasse nessa linha, teria que se desdobrar, pois um bom vilão se faz necessário em um longa de super-herói.Temos a grande virada em que o aliado se mostra o vilão do momento. Conseguindo fazer um gancho com o Tony Stark e sua empresa de tecnologia. Sendo uma sacada muito boa para deixar essa passagem de bastão para o Homem-Aranha, muito coerente.Assim, temos o Peter Parker, interagindo com a tecnologia de ponta ao som de Led Zeppelin. O longa mostra uma história bem preenchida, mantendo o espectador alerta durante toda a sua duração.Tive uma visão engraçada, pois assisti 2 vezes(com intervalo de 1 dia) ao filme. A parte que acho engraçada é que na segunda vez, o filme me pareceu curto. Sendo assim, posso opinar que está muito bem distribuído o roteiro.O jogo de câmeras na luta final contra os drones, me deixou um pouco confuso, mas ao mesmo tempo achei impressionante a elaboração da produção e direção para esse momento.Ao final do longa, temos duas cenas pós-créditos. A primeira cena nos deixa muito empolgados com um terceiro filme do Homem-Aranha. Fechou com chave de ouro o longa. Já a segunda cena, ainda não cheguei a conclusão se foi boa, pois como só teremos os filmes da fase 4, a partir de 2020, fica a ansiedade para entender o que vai acontecer.Não posso esquecer de comentar sobre Gyllenhaal, que explicou bem o seu papel no Universo da Marvel. Digo isso, porque ele faz interpretações mais complexas e emocionantes. Estava curioso para saber como seria ele em um longa de super-herói, onde geralmente os personagens seguem mais a linha de fantasia. O seu papel se encaixou muito bem no perfil que ele tem mostrado nas suas interpretações nos filmes que já participou.Também tenho que dizer que senti que Zendaya, estava meio apagada nesse longa. Ela teve suas cenas, mas sinto que ela precisava ter mais participações na ação, como foi quando ela destruiu um drone.O longa agrada bastante pelo roteiro e pelas tiradas de comédia com Ned e Nick Fury.Temos o encerramento da fase 3 e grandes expectativas para a fase 4. Então, só vem.","pubDate":"Sun, 07 Jul 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/homem-aranha-longe-de-casa/","category":"em cartaz"},{"title":"Turma da Mônica - Laços","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/turma-da-monica-lacos/","description":"O Floquinho desapare. Para encontrar seu cachorro de estimação, Cebolinha conta com os amigos Cascão, Mônica e Magali e, claro, um plano infalível.Dados técnicosTítulo original: Turma da Mônica - LaçosData de lançamento: 27 de junho de 2019 (Brasil)Direção: Daniel RezendeRoteiro: Thiago DottoriGênero: AventuraPaís: BrasilDuração: 96 minClassificação: 10 AnosOrçamento: R$10 milhõesElenco Giulia Barreto Mônica Gabriel Moreira Cascão Laura Rauseo Magali Kevin Vechiatto Cebolinha Rodrigo Santoro LoucoOpiniãoTenho que assumir que sou da geração da Turma da mônica, mas nunca li um gibi. Com isso, infelizmente creio que não aproveitei o longa ao máximo.A primeira coisa que precisamos saber, é que esse filme foi inspirado no livro com o mesmo nome, que faz parte de uma trilogia.Sem dúvida nenhuma a escolha de Giulia Barreto, para interpretar a Mônica, foi um tiro certeiro. Gerando até um pouco de frustração por causa do Cebolinha ser o foco da história e não ela.Conseguiram fazer um bom trabalho de produção quanto aos cenários e caracterização. O desenrolar da história fica bem suave.Talvez alguma crítica que eu tenha, seja quanto a parte dramática em 2 momentos. O primeiro momento foi com o Cebolinha e no segundo incluia a Mônica. Foram momentos de emoção quando os personagens começavam a chorar. O tempo ficou um pouco longo, como se fosse um momento forçado para que fosse emocionante. Na parte com a mônica que tinha uma escolha de caminhos, foi algo que até gostei, mas ficou meio solto e meio explícito que a intenção era para fazer o público se emocionar.O comentário que não posso deixar de fazer, é a respeito de achar que o Maurício de Sousa, deve estar bem irritado com o DPA (Detetives do Prédio Azul). Porque é inivitável não comparar as roupas e que DPA foi lançado antes no cinema com 2 filmes. D.P.A - O Filme de 2017 e D. P. A. 2 - O Mistério Italiano de 2018. E esse longa da Turma da Mônica, começou a ser produzido em 2017.Apenas uma treta que estou tentando implantar, mas vem a mente quando enxergamos as roupas com as cores vermelho, amarelo e verde.Continuando, a história tem um roteiro bem inocente e exemplifica bem a essência do que se pode encontrar na história da turma, ao longo dos anos. Foi bem interessante ver um enredo simples, mas não imensamente bobo. Geralmente em séries e filmes para crianças, o desfecho é bem bobo, mas nesse longa se teve coerência nas soluções e planos infalíveis.A sensação ao término do filme, é que seria uma boa série. Agora, ao saber que se faz parte de uma trilogia, o filme fica mais interessante ainda.É claro que é voltado para o público infantil e para os adultos que passaram a infância com a Turma da Mônica, mas também agrada pessoas que acompanharam todos esses anos, mesmo de longe.O longa se mostra um grande incentivador para conhecermos os livros e esperar os próximos filmes.Antes de iniciar o filme, já podemos ver que o cinema no Brasil, é complicado. Precisaram de tanto patrocínio e empresas para que esse projeto fosse realidade, que fico com receio que não se tenha os próximos filmes.Espero que os 2 próximos filmes se tornem realidade, pois vale ter esses livros e a história da Turma da Mônica, registrada no cinema.Já estou interessado no box com a trilogia. Vamos conhecer mais os bons legados que temos no Brasil.","pubDate":"Fri, 05 Jul 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/turma-da-monica-lacos/","category":"em cartaz"},{"title":"O Olho e a Faca","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/o-olho-e-a-faca/","description":"Roberto trabalha em uma base de petróleo e passa meses afastado da esposa e dos filhos. Nos momentos de distância, inicia um relacionamento com outra mulher. Quando Roberto recebe uma promoção no emprego, ele é forçado a ficar ainda mais tempo longe.Dados técnicosTítulo original: O Olho e a FacaData de lançamento: 27 de junho de 2019 (Brasil)Direção: Paulo SacramentoRoteiro: Paulo Sacramento e Eduardo BenaimGênero: DramaPaís: BrasilDuração: 99 minClassificação: 12 AnosOrçamento: R$4,5 milhõesElenco Rodrigo Lombardi Roberto Roberto Birindelli Wagner Caco Ciocler Zé Carlos Maria Luísa Mendonça Cris Luís Melo DutraOpiniãoO longa começa mostrando uma plataforma de petróleo e os seus funcionários chegando. Assim, se inicia a ambientação do dia a dia no meio do oceano e longe de tudo.O personagem principal (Roberto) se mostra uma pessoa boa, que liga até para o conserto de uma mesa de totó, que serve para todos, mas o faz sozinho. Lombardi, já é conhecido do público pelos papéis de bonzinho nas telenovelas e isso se encaixa no perfil do personagem dele no filme.Após um foco na rotina de uma plataforma de petróleo e até sugerir conspirações no ambiente de trabalho, as coisas começam a desandar. O que parecia ser um suspense, acabou sendo um enredo mal construído.Simplesmente, o personagem se mostra uma pessoa que não tem uma boa relação com o pai, gosta de um filho e nem liga para o outro, tem uma amante e traí o melhor amigo no trabalho.E assim, vão se revelando as incoerências.Antes de tudo, vou falar sobre a amante, personagem de Débora Nascimento. A produção é de 2017, e com isso, levo a crer que ela nem era conhecida nessa época. Pois foi essa a impressão ao vê-la no filme. Apareceu em 2 cenas, sendo uma de sexo que serviu mais para mostar o que José Loreto (ex-marido na vida real), perdeu. Na segunda cena, aparece ao lado do protagonista no sofá. Resumindo, praticamente uma figurante.A questão que deixou mais dúvidas, foi a parte dele não ser ambicioso na questão profissional, sendo mostrando isso no começo do filme e ele mesmo conversando com o seu chefe. Mais tarde do nada, após ser promovido, seu melhor amigo e a pessoa que merecia o cargo novo que ele tinha, foi demitida.A partir desse momento, todo o lado obscuro da vida dele, foi se revelando. Fica visível que a mensagem do longa é em relação a uma pessoa que fica muito tempo longe da família e isso pode arruinar a vida de uma pessoa. O problema que o suspense que é criado, é em relação a vida na plataforma.Por muitos minutos do filme, o espectador é levado a crer que um último acidente na plataforma, teve uma conspiração por trás. Sendo que no desfecho, não passou de uma ilusão que nem foi congitada pelo personagem principal.Com isso, chegamos na frustração de se ter 90 minutos de espera, para 9 minutos de um discurso filosófico. Onde uma pessoa que se mostrou boa no início do filme, teve uma virada totalmente incoerente e no seu desfecho começa a ver que tudo se baseia em como você vê as coisas.Uma coisa que creio no cinema brasileiro, é o que o mesmo tem que sair um pouco do olhar pessoal. A maioria dos filmes nacionais, tem uma visão muito particular do diretor. Também sei que isso é importante e não estou falando que tem que se vender para dar certo.O fato é que precisamos de verbas para fazer mais filmes nacionais e os diretores tem que pensar mais na visão geral e não focar só em uma passagem filosófica. Se o longa tivesse um objetivo mais sólido, como uma conspiração na plataforma, a vida particular de Roberto teria o mesmo impacto que teve, mas também teríamos uma conclusão mais clara.Parece que é uma obrigação ter uma mensagem subliminar, nudez e mais coisas do tipo. Como se cada filme fosse uma obra prima com a verdade nua e crua. Sei bem que o orçamento nacional é bem limitado e é bem complicado ver produções só terem lançamento 2 anos depois. Se tem muita coisa por trás, mas essa não é uma opinião só voltada aos diretores.O longa se apresentou bem, mas pecou bastante na contrução e evolução.","pubDate":"Thu, 04 Jul 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/o-olho-e-a-faca/","category":"em cartaz"},{"title":"Tracers - Nos Limites","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/nem-sabia/tracers/","description":"Uma bela e misteriosa mulher ajuda um mensageiro, após quebrar sua bicicleta. Usando Parkour para realizar roubos, ela incentiva o mensageiro a praticar e escapar de uma dívida com a máfia chinesa.Dados técnicosTítulo original: TracersData de lançamento: 15 de janeiro de 2015 (Dinamarca)Direção: Daniel BenmayorRoteiro: Kevin Lund, Leslie Bohem, Matt Johnson e T.J. ScottGênero: AçãoPaís: EUADuração: 94 minClassificação: 10 AnosOrçamento: $11 milhõesElenco Taylor Lautner Cam Marie Avgeropoulos Nikki Adam Rayner Miller Rafi Gavron DylanOpiniãoTemos aqui um filme que me chamou a atenção por causa do Parkour e por não saber da sua existência. Vendo 4 anos após o lançamento, se mostrou um filme de ação que me lembra os típicos filmes de ação dos anos 2000.No início do longa, achei que seria no estilo do Perigo por Encomenda, de 2012.Ao começar as cenas com parkour, já me veio a mente B13 - 13º Distrito, de 2004 e 13º Distrito - Ultimato de 2009. Também não poderia deixar de citar a adaptação do B13, que foi o último filme de Paul Walker. O 13º Distrito, de 2014.Com o ritmo de pular de prédios e tendo na história a máfia chinesa, é apresentado a parte do protagonista onde o mesmo quer fazer parte de uma equipe de ladrões. Se Lautner, fosse um policial, seria muito clichê. Não foi nessa parte que vamos lembrar de Velozes e Furiosos, de 2001. E sim, na parte que o protagonista tem um carro em sua garagem que está sem peças e a lembrança dos pais. O carro volta a ser destaque no final do longa, onde ele está novinho e é o destaque do encerramento.Ao final do filme, fica evidente as lembranças dos longas que citei acima. Poderia também citar o Caçadores de Emoção: Além do Limite, de 2015.Então, acaba sendo um quebra-cabeça, com vários filmes. Ao pesquisar sobre o filme e ver que teve 4 pessoas assinando o roteiro, fiquei muito intrigado. Com isso, não quero dizer que o filme é ruim, só não traz nada novo.Acredito que não há um filme ruim, depende do momento. Ele nem chegou aos cinemas brasileiros e tem motivo pra isso (orçamento). Assistindo em casa, ele se parece um filme de ação que cumpre ao que se propõe. Lautner, traz uma presença, senão série um filme de categoria B.Sendo um filme de ação que busca um entretenimento sem importância de roteiro e tem o parkour como atrativo, agrada uma tarde em casa.","pubDate":"Wed, 03 Jul 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/nem-sabia/tracers/","category":"nem sabia"},{"title":"Shaft 2019","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/netflix/shaft-2019/","description":"Após a morte suspeita de um amigo, John Shaft Jr. (Jessie T. Usher) resolve pedir ajuda a seu pai, Shaft (Samuel L. Jackson), para resolver o caso. Ele aceita deixar a aposentadoria para iniciar a investigação, apesar dos problemas existentes com o próprio filho.Dados técnicosTítulo original: ShaftData de lançamento: 28 de junho de 2019 (Brasil)Direção: Tim StoryRoteiro: Alex Barnow e Kenya BarrisGênero: Ação e ComédiaPaís: EUADuração: 111 minClassificação: 16 AnosOrçamento: $30–35 milhõesElenco Richard Roundtree John Shaft Samuel L. Jackson John Shaft II Jessie Usher John ‘JJ’ Shaft III Regina Hall Maya Babanikos Alexandra Shipp Sasha AriasCronologiaShaft - 1971O Grande Golpe de Shaft (Shaft’s Big Score!) - 1972Shaft na África (Shaft in Africa) - 1973Shaft (série de TV) - 09 de outubro de 1973 / 19 fevereiro de 1974Shaft - 2000Shaft - 2019OpiniãoChegamos ao quinto filme da franquia e tenho que assumir que ainda não consegui assistir aos 3 primeiros filmes com Richard Roundtree. Já está como prioridade e falarei sobre eles na categoria Nostalgia. E mesmo sem ter visto, Roundtree, já garante que não será tempo perdido.O filme já começa fazendo uma transição com a explicação de como chegamos na terceira geração do Shaft. O que chama a atenção é o CGI usado para deixar o Samuel L. Jackson, mais novo. Se não foi usado esse recurso, foi algo que deixou bem visível essa tentativa.O filme prossegue em um processo de reconciliação entre pai e filho, dando uma pausa na ação e tentando investir só na comédia. Nesse tempo, o Shaft III começa a demonstrar um pouco que tem o sangue Shaft.Passando um pouco do meio do filme que a ação começa a movimentar o filme e a ação aparece.Acredito que todo o longa é uma preparação para os 20 minutos finais. Toda a ação pode ser resumida no trailer.A pegada foi uma adaptação para o que já estamos acostumados a ver nos filmes mais recentes de ação e comédia. O filho que tem uma personalidade diferente e depois se junta ao negócio da familia. O roteiro não mandou bem nesse clichê.Uma abordagem interessante seria ter ação desde o começo e a terceira geração já começar com tudo. A impressão que fica é que Roundtree e Jackson, estão velhos e só aceitaram participar do filme se ele fosse tranquilo em questão de ação. E acabou que o personagem de Usher, ficou preso na mesma onda.Um filme com Samuel L. Jackson, que é da minha geração, sempre merece ser visto. Fica um sentimento de ser interessante ver todas as gerações juntas, mas também aquela sensação que foi mais uma reunião, do que chegar com tudo.Um longa que mostra presença, mas fica devendo no roteiro e em causar empolgação para uma continuação. Por mais que aparentasse ser uma ponte para a terceira geração continuar a franquia futuramente.","pubDate":"Fri, 28 Jun 2019 09:00:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/netflix/shaft-2019/","category":"netflix"},{"title":"Alerta lobo","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/netflix/alerta-lobo/","description":"A história gira em torno de um marinheiro que é conhecido como ouvido de ouro, pois tem um raro dom de conseguir identificar qualquer tipo de som e, justamente por isso, ele carrega muita responsabilidade sobre suas funções. Após cometer um erro de identificação, o jovem acaba perdendo a confiança dos demais integrantes do submarino, em meio a um risco de uma guerra nuclear.Dados técnicosTítulo original: Le Chant du LoupData de lançamento: 20 de junho de 2019 (Brasil)Direção: Antonin BaudryRoteiro: Antonin BaudryGênero: Ação, Suspense e GuerraPaís: FrançaDuração: 115 minClassificação: 14 AnosOrçamento: $22,4 milhõesElenco François Civil Chanteraide Omar Sy D’Orsi Reda Kateb Grandchamp Mathieu Kassovitz Alfost Paula Beer DianeOpiniãoTenho que começar falando que existem inúmeros perfis de usuários que vão ao cinema ou assistem filmes na TV. Tem gente que vê tudo o que é possível antes de assistir um longa ou tem gente que nem gosta de ver o pôster para não ter spoiler.Esse filme francês não é feito pensando em entretenimento puro, ele requer que você tenha uma visão mais ampla. Se você só está na netflix e encontra o filme e começa à assistir, pode ser que tenha uma grande decepção.Fora, que ele tem uma realidade que é distante de 99,9% dos brasileiros. Pois ele tem uma visão de um país que tem uma tensão quando se trata de guerras.Acredito que o grande foco do filme é passar a sensação de se estar às cegas dentro de submarino. Onde, apenas os ouvidos e os protocolos são seus aliados. E por esse motivo ele não é um filme de puro entretenimento. Ele precisa de atenção e compreensão de vários ângulos.Se não tiver intimidade com protocolos e a obediência cega que existe no meio militar, já é uma grande desvantagem para assistir esse longa. Se a realidade da tensão de uma guerra nuclear, nem faz você pensar, então mais uma desvantagem.Tendo como personagem central o jovem ouvidos de ouro, assisti ao longo com o foco na tensão que existe em cima desse personagem. E usando o longa para reflexão de avaliação de protocoloas, instinto e lógica emocional.Com isso, ele se torna um bom filme de reflexão. Por ter uma realidade muito distante da grande maioria dos espectadores, pode ser um filme que não seja compreendido pela sua linha de detalhes.Sendo um longa que exige que se conheça um pouco sobre o cenário que é apresentado. E também vale lembrar da visão dentro de cada submarino que não é a mesma que a nossa, onde está sendo mostrado tudo o que acontece.O ponto mais questionável para mim, seria quando o capitão ouve a voz do seu antigo imediato e mesmo assim continua com o protocolo. E é o ponto chave para frustração ou reflexão do filme.O que você faria?","pubDate":"Mon, 24 Jun 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/netflix/alerta-lobo/","category":"netflix"},{"title":"MIB - Homens de Preto Internacional","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/mib-homens-de-preto-internacional/","description":"Os agentes H e M usam armas de alta tecnologia para combater alienígenas que podem assumir a forma de qualquer ser humano.Dados técnicosTítulo original: Men in Black - InternationalData de lançamento: 13 de junho de 2019 (Brasil)Direção: F. Gary GrayRoteiro: Art Marcum e Matt HollowayGênero: Ação e Ficção científicaPaís: EUADuração: 115 minClassificação: 12 AnosOrçamento: $94–110 milhõesElenco Tessa Thompson Agente M Chris Hemsworth Agente H Liam Neeson Veterano T Emma Thompson Agente O Rebecca Ferguson RizaOpiniãoChegamos ao quarto filme da franquia e o mesmo tem uma responsabilidade de continuar um bom ritmo após a trilogia com Tommy Lee Jones e Will Smith.Tivemos uma apresentação da agência e da imensidão do universo em MIB ‑ Homens de Preto (1997) e MIB ‑ Homens de Preto II (2002). No MIB - Homens de Preto III (2012), tivemos a explicação de como as vidas do Agente K e o Agente J, foram ligadas no passado.Agora no quarto longa tivemos a grande decepção em relação ao roteiro, mas a direção tem a sua parcela de culpa.A história evolui no humor e agora conta com a boa química de Thompson e Hemsworth. Voltando para o roteiro, o mesmo se encontra vazio. Com isso, o filme se encaixa perfeitamente na prateleira de longas de entretenimento, no qual você vê para passar o tempo. Por esse motivo, considero esse longa como uma preparação para um MIB 5.Já tivemos uma visão de que somos uma pequena parte do universo e agora o mundo não gira em torno de apenas 2 pessoas. Olho para MIB Internacional, como uma visão de abertura para infinitas possibilidades, pois poderá ter várias combinações de duplas e se bobear até a volta do Will Smith.Sou ingênuo ao ponto de acreditar que esse longa é apenas uma preparação para o próximo filme da franquia. Como foi Velozes e Furiosos II e Velozes e Furiosos - Desafio em Tóquio (III), para a franquia de Velozes e furiosos.É claro, para os fãs de MIB, esse longa não deveria existir. Por causa do roteiro e das partes soltas, como a aparição do Les Twins e a vilã Riza.Como sigo a filosofia de que vale ver os pontos positivos de cada experiência e tem muita coisa por traz de um longa, tento ver o que pode ser absorvido de cada experiência.A participação de Hemsworth, provocou um preconceito da minha parte, por já estar em grande evidência pela franquia de Os Vigadores e por Caça-Fantasmas (2016). No final, a química com Thompson e o único acerto do longa sendo no humor, acabou mudando a minha visão.Para os fãs de MIB, decepção. Para quem quer ver um filme de ação com tiradas de humor, que ao meu ver puro entretenimento, pode ser uma boa pedida.E para a minha esperança, não tendo os mesmos roteiristas e melhorando na direção, espero ver um MIB 5.","pubDate":"Wed, 19 Jun 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/mib-homens-de-preto-internacional/","category":"em cartaz"},{"title":"Meu eterno talvez","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/netflix/meu-eterno-talvez/","description":"A famosa chef Sasha e o músico Marcus se reencontram depois de 15 anos. A atração ainda existe, mas não vai ser fácil para eles se adaptarem à vida um do outro.Dados técnicosTítulo original: Always Be My MaybeData de lançamento: 31 de maio de 2019 (Brasil)Direção: Nahnatchka KhanRoteiro: Ali Wong, Randall Park e Michael GolamcoGênero: Comédia românticaPaís: EUADuração: 102 minClassificação: 16 AnosOrçamento: $19 milhõesElenco Ali Wong Sasha Tran Randall Park Marcus Kim Keanu Reeves Keanu Reeves Michelle Buteau Verônica Daniel Dae Kim Brandon ChoiOpiniãoTenho que assumir que tinha preconceito sobre esse filme. Achava que era mais uma comédia romântica, sem nenhuma novidade. Tenho o mesmo preconceito com os filmes de terror.Ao descobrir que Keanu Reeves, estava no longa da Netflix, foi despertado o meu interesse.No decorrer do filme, o mesmo foi se mostrando interessante. Não fica na mesma de se ter problemas, se juntam e são felizes para sempre. É claro que esse é o fim das comédias românticas, mas como já mencionei em opiniões anteriores, sempre gosto do pós fim.O filme começa com uma história inusitada, mas mostra os laços dos personagens principais. Aos poucos o enredo se torna interessante, tendo as suas pitadas de comédia que se encaixam muito bem.O que achei interessante, foi a participação despretensiosa de Keanu Reeves, e teve sentido para a história. Inclusive rende uma letra de música nas cenas de créditos. Então não foi apenas jogado. Após os acontecimentos com o casal e Reeves, começa o que eu gosto que é o pós fim.Pefiro mais 2 partipações de Reeves, desta forma em outros filmes, ao invés dos longas Knock Knock “Bata antes de entrar” e Réplicas “Cópias”. :)Ali e Randall, tem química tanto na comédia, como em romance. O enredo mistura comédia, romance e momentos de reflexão. Nos traz mais que uma história superficial de romance. E como acontece com o personagem Marcus, se busca rever as suas atitudes e receios. O mesmo acontece com a personagem Sasha.E o que também acrescentou interesse na história, foi estarem atualizados com o cenário atual de restaurantes. Fazendo a ligação de restaurantes com inovações para clientes ricos e a culinárina raiz asiática, com direito a homenagem a mãe do personagem Marcus.Acredito que o filme foi lançado no lugar certo, é um bom filme para se ver na Netflix. Domingão, estando de casal ou não, liga a TV e assiste um filme que não tem muita pretensão, mas tem uma boa história, bons personagens e tem 100 minutos que valem a pena.","pubDate":"Mon, 03 Jun 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/netflix/meu-eterno-talvez/","category":"netflix"},{"title":"Rocketman","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/rocketman/","description":"Extremamente talentoso mas muito tímido, o pianista prodígio Reginald Dwight muda seu nome para Elton John e torna-se uma estrela da música de renome internacional durante os anos 1970.Dados técnicosTítulo original: RocketmanData de lançamento: 30 de maio de 2019 (Brasil)Direção: Dexter FletcherRoteiro: Lee HallGênero: Biografia e Comédia musicalPaís: Reino UnidoDuração: 121 minClassificação: 16 AnosOrçamento: $40 milhõesElenco Taron Egerton Reginald Dwight / Elton John Jamie Bell Bernie Taupin Richard Madden John Reid Bryce Dallas Howard Sheila EileenOpiniãoNão sabia o que esperar desse longa, mas se motrou um bom filme biográfico.Se tem cenas sexuais entre homens, mas não chega a ser explícito. Nada que já não tenha visto na Netflix.O filme conta com 21 músicas que são sincronizadas com a história. Abaixo, por ordem de lançamento.Thank You for All Your Loving - 1968Border Song - 1970Rock &amp; Roll Madonna - 1970Your Song - 1970Take Me to the Pilot - 1970Amoreena - 1971Tiny Dancer - 1971Hercules - 1972Crocodile Rock - 1972Honky Cat - 1972Rocket Man - 1972Bennie and the Jets - 1973Goodbye Yellow Brick Road - 1973Saturday Night’s Alright (For Fighting) - 1973Don’t Let the Sun Go Down on Me - 1974The Bitch Is Back - 1974Pinball Wizard - 1975Sorry Seems to Be the Hardest Word - 1976Don’t Go Breaking My Heart - 1976I’m Still Standing - 1983I Want Love - 2001O grande diferencial do filme, é que se consegue manter a tensão da história, mesmo tendo musicais. Sendo que o sentimento central, é o sofrimento em que o personagem principal está constantemente envolvido.No decorrer do longa a história mantém a sua atenção, com eventos constantes de decepção de Elton, com quem está à sua volta. E você se pergunta como ele aguentou tanta coisa e nos leva para o ambiente sem tanto glamour da vida musical nos anos 70. Sendo assim, você começa a avaliar os artistas da mesma época.É bem interessante conhecer mais das músicas e a história de Elton John. Particularmente, não conhecia quase nada do mesmo, no meio musical e pessoal. Como filme biográfico e trazer sua história para que não o conhece, acredito que fizeram um bom trabalho. Era uma história que merecia ser contada.A lição que tiro do filme, é que se deve seguir firme nos seus objetivos. E por mais que seja dificil, não podemos deixar as coisas externas nos afetar tanto. Ele poderia ter morrido, como o longa mostra e nada do que veio depois teria acontecido. E arrisco à dizer que não teria esse filme ou tanta referência do mesmo no meio artístico.Então, tendo problemas, o negócio é se afastar do que não te acrescenta ou te afunda. Só assim, vai ficar masi perto do que quer.","pubDate":"Sun, 02 Jun 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/rocketman/","category":"em cartaz"},{"title":"Aladdin","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/aladdin/","description":"Aladdin liberta o gênio da lâmpada e tem seus desejos atendidos. Porém, ele logo descobre que Ja’Far tem outros planos para a lâmpada e para a princesa Jasmim.Dados técnicosTítulo original: AladdinData de lançamento: 23 de maio de 2019 (Brasil)Direção: Guy RitchieRoteiro: Guy Ritchie, John August e Vanessa TaylorGênero: Aventura e FantasiaPaís: EUADuração: 128 minClassificação: 10 AnosOrçamento: $183 milhõesElenco Will Smith Gênio Naomi Scott Princesa Jasmine Mena Massoud Aladdin Marwan Kenzari Ja’Far Nasim Pedrad DaliaOpiniãoJá começo dizendo que esse filme foi uma boa surpresa. Houve uma grande polêmica em relação a primeira imagem divulgada do Will Smith, como o gênio azul. As imagens geradas por computador (CGI) estavam muito estranhas e deixou todos apreensivos.Após assistir o filme, a sensação é de que uma infância não foi destruída.O longa tem muito figurinho, digna das Arábias. Se dúvida nenhuma é uma produção da Disney, que conta com muito musical. Por esse motivo eu comecei a entender porque Will Smith estava como gênio. E não só apenas por isso, mas também pelo seu carisma e pequenas tiradas de comédia.As primeiras cenas me lembraram muito do jogo para video-game onde Aladdin, tinha que pular de prédio, em prédio.Acredito que só senti falta de um Yago mais expressivo, para que a nostalgia de infância ficasse completa. É como estão fazendo com o filme do Sonic, no primeiro trailer, trazendo alguém até realista demais. Temos que lembrar que uma parte boa dos desenhos de infância, é a imaginação. Então, uma arara não precisa ser idêntica a uma real.Um ponto que chegou quase no limite, foi a quantidade de trechos musicais. Felizmente, equilibraram com os trechos em que o gênio chamava o holofote para si.Como um todo, teve uma assinatura clara da Disney. Will Smith, fez por merecer o papel de gênio. Os Intérpretes de Aladdin e Jasmine, mandaram muito bem, mas senti falta das atuações dos mesmos fora dos musicais. Não digo isso por uma questão de atuação, mas que sempre parecia que estavam preparados para começar um musical. Acredito que aconteceu o mesmo com o Will Smith, mas como já o vimos bastante na parte de interpretação, não senti essa falta.Um longa para toda a família e mantém a nossa infância. Mesmo parecendo que o filme tem começo, meio e fim, pode ser que tenha uma continuação. Sinceramente, não creio que faz sentido pela história, mas vai saber.","pubDate":"Tue, 28 May 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/aladdin/","category":"em cartaz"},{"title":"Hellboy 2019","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/hellboy-2019/","description":"Uma antiga feiticeira volta à vida decidida a vingar-se de uma traição do passado. Dividido entre o mundo sobrenatural e humano, o lendário meio-demônio Hellboy recebe a missão de conter essa ameaça e salvar o mundo.Dados técnicosTítulo original: HellboyData de lançamento: 16 de maio de 2019 (Brasil)Direção: Neil MarshallRoteiro: Andrew CosbyGênero: Ação e FantasiaPaís: EUADuração: 121 minClassificação: 16 AnosOrçamento: $50 milhõesElenco David Harbour Hellboy Milla Jovovich Nimue / Rainha Sangrenta Ian McShane Professor Trevor “Broom” Bruttenholm Sasha Lane Alice Monaghan Daniel Dae Kim Ben Daimio Penelope Mitchell Ganeida Brian Gleeson Merlin Thomas Haden Church Lagosta JohnsonOpiniãoEm 2004, tivemos o primeiro filme sobre Hellboy e o segundo filme em 2008 (Hellboy II: O Exército Dourado).Começo dizendo que não fui muito fã dos 2 primeiros filmes. Acredito que Ron Perlman, interpretou muito bem o Hellboy, mas as histórias não empolgaram. E também o diferencial dos 2 primeiros filmes foi a direção de Guillermo del Toro.Agora em 2019, temos o reboot e o David Harbour com a missão de trazer algo novo na pele do Hellboy.Assumo que fiquei bem iludido ao assistir o trailer e já imaginava que o filme iria vir com tudo, mas apenas foi uma ilusão.A nova modelagem física do protagonista ficou bem interessante e trazendo a ideia que o personagem teria mais flexibilidade e velocidade nas lutas.Durante o começo do filme já temos uma boa impressão que vem algo novo, com cenas mais sangrentas, mas com o tempo a história só fica pulando de inimigo em inimigo e fica visível que a mudança foi ser um filme mais trash.Assim, temos o olhar de Del Toro, trazendo mais beleza visual e uma atmosfera filosófica nos primeiros filmes. Particularmente, não sei se foi uma boa combinação para o personagem, pois falando sobre Hellboy, penso em algo mais sombrio como Anjos da noite. E agora com um olhar mais largado em 2019, que praticamente foco no que não teve nos primeiros filmes e exagerando no desejo que começar do zero.Costumo pensar que a história de Hellboy, é como a história de Os Defensores, tirando O demolidor. Que trazendo para a TV ou para o cinema, cada história isolada não teria sustenção para manter uma atenção dos espectadores. E como vimos com Os Defensores, na Netflix, nem mesmo juntando as histórias, foi algo empolgante.Hellboy, acaba sendo um companheiro para o Quarteto Fantástico na cinematrografia, que ainda não acertou a mão, pelo menos na minha opinião.E por coincidência, adivinha quem fará parte do Quartero fantástico, que irá aparecer no filme solo da Viúva Negra, em 2020? Ainda são boatos, porque o filme rola em segredo, mas David Harbour pode interpretar O Coisa.","pubDate":"Mon, 27 May 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/hellboy-2019/","category":"em cartaz"},{"title":"Superação - O Milagre da Fé","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/superacao-o-milagre-da-fe/","description":"O menino John Smith, de apenas 14 anos, sofre uma queda e se afoga por mais de 15 minutos em um lago congelado. Chegando ao hospital, John é considerado morto por mais de uma hora até que sua mãe, Joyce Smith, ao lado do pai e de um pastor, junta todas as suas forças e pede a Deus para que seu filho sobreviva.Dados técnicosTítulo original: BreakthroughData de lançamento: 11 de abril de 2019 (Brasil)Direção: Roxann DawsonRoteiro: Grant NieporteGênero: Drama e BiografiaPaís: EUADuração: 116 minClassificação: 10 AnosOrçamento: $14 milhõesElenco Chrissy Metz Joyce Smith Marcel Ruiz John Smith Josh Lucas Brian Smith Topher Grace Pastor Jason Noble Mike Colter Tommy Shine Dennis Haysbert Doutor GarrettOpiniãoO filme conta a história real de John Smith, onde o fato do seu afogamento e volta à vida, pode ser considerado tranquilamente um milagre.É muito complicado e tem que ser muito cuidadoso um longa que tem em sua história algo relacionado a religião e principalmente quando se trata de fé.Por coincidência, no mesmo mês e ano que aconteceu essa história real, houve um milagre médico com Justin Smith. Fora a data, eles terem o mesmo sobrenome é bem bizarro para mim.Mas o que quero dizer com isso? Agora se tem uma margem para mais ângulos de visão, de ateus, religiosos e o público em geral. No próprio filme, se é questionado porque houve esse milagre com John, e porque outras pessoas que tiveram a mesma dedicação e atenção com orações não tiveram o mesmo fim. Acaba que isso dá uma abertura para discussões infinitas, até mesmo dentro dos grupos religiosos.Tendo essas duas histórias, uma como milagre da fé e outra como milagre médico, a ideia da minha opinião é ser imparcial sobre o longa.Então, encarar que a história é para forçar a ideia que o milagre só é possível porque a mãe teve fé e é uma religiosa raiz, é um caminho muito errado a se seguir. Digo isso tanto em relação aos produtores e quem assiste ao filme.Ao assistir o filme, o mesmo me passou a ideia que iria tomar um caminho melhor. No decorrer do longa, ficou claro que a mãe deveria deixar na mão de Deus, e não foi só pela oração dela que o milagre aconteceu. Isso acontece na cena onde ela discute com o marido e diz: - “Ele está vivo graças à mim.”. E o marido a olha espantando com a sua arrogância. Após isso, ela começa a ver que estava sendo controladora e arrogante.Daí em diante, comecei a gostar mais do rumo que o longa estava tomando. Por ser um assunto muito delicado e como foi dito pelo próprio marido nessa cena que citei, ela estava certa e ao mesmo tempo errada. Trazendo isso para uma situação do nosso cotidiano, é fato que 50% das pessoas iriam ficar do lado dela e 50% iriam ficar contra ela, em relação as atitudes que ela estava tomando.Por isso que não é bom tomar partido de uma história, antes que ela termine. Em uma situação assim com uma pessoa com o perfil igual da protagonista, nem sempre vai terminar com ela olhando de dentro para fora e identificando onde está exagerando. E o diálogo com o marido e depois com o seu pastor, foi decisivo para a sequência da história.O ponto que pode ser muito questionado no filme, é que o único ateu que é mostrado, é quem ouve a voz de Deus e salva o garoto. Por um ponto de vista, se pode dizer que Deus usa qualquer um. Por outro lado, no filme foi bem clichê essa situação, meio que mostrando que quem não é religioso irá se converter. Acaba sendo uma visão unilateral, em que no final o certo é ser religioso e uma hora quem não é, irá mudar de ideia.Gostei do filme abordar a questão de que dentro do meio religioso algumas pessoas podem ser controladoras e arrrogantes, e o mesmo pode ocorrer fora. Com isso, acredito que o filme deve ser visto com a imparcialidade de que é uma história de vida que é um milagre, independente de sua crença.Se tinha muitos pontos a se explorar nesse filme, como relação a adoção e os pontos que citei acima. Para mim, o ponto principal foi a mensagem que sendo religioso, se deve encarar que é como Deus quer e ele não é um gênio da lâmpada. Vendo o trailer, parecia que ia tomar esse caminho, mas felizmente não tomou.Então é isso, aproveite a história. Para quem é religioso ou não, ela abre muitas brechas para discussões, mas lembre que não estamos no controle e vamos olhar primeiro para dentro e depois para fora.","pubDate":"Sun, 26 May 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/superacao-o-milagre-da-fe/","category":"em cartaz"},{"title":"John Wick 3 - Parabellum","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/john-wick-3-parabellum/","description":"O lendário John Wick luta para sair de Nova York quando um contrato de 14 milhões de dólares faz dele o alvo dos maiores assassinos do mundo.Dados técnicosTítulo original: John Wick: Chapter 3 - ParabellumData de lançamento: 16 de maio de 2019 (Brasil)Direção: Chad StahelskiRoteiro: Derek Kolstad, Shay Hatten, Chris Collins e Marc AbramsGênero: AçãoPaís: EUADuração: 131 minClassificação: 16 AnosOrçamento: $55 milhõesElenco Keanu Reeves John Wick Halle Berry Sofia Laurence Fishburne Bowery King Ian McShane Winston Anjelica Huston A diretora Asia Kate Dillon A juíza Mark Dacascos Zero Lance Reddick CharonOpiniãoChegamos no terceiro filme sobre John Wick, onde ele não tem um segundo de descanso por ter violado uma regra da Alta Cúpula.No primeiro (John Wick - De Volta Ao Jogo), fizeram a besteira de matar o seu cachorro e roubar o seu carro. No segundo (John Wick: Um Novo Dia Para Matar), ele recupera o carro e teve que voltar a matar por causa de uma promissória.O filme começa muito bem e quando digo isso, seria papo de 20 minutos de muitas mortes. Que te mantém atendo aos detalhes, graças ao grande empenho de Keanu Reeves, que deve ter treinado muito nas coregrafias de luta. Sendo visível o sincronismo e a alta performance com mortes de formas diferentes e que não fica sendo algo repetitivo e cansativo.O que não posso dizer no meio do filme, na sequência de mortes que John Wick tem ao lado de Sofia (Halle Berry) e seus cachorros. Foi muito interessante, mas se prolongou por muito tempo, fazendo se ter mais atenção no ritmo das performances. Com isso, ficou evidente que se tinha uma coreografia ali. O toque com os cachorros trouxe uma coisa nova, mas como já mencionei, ficou muito prolongado.E acredito que essa personagem Sofia, aparecer do nada e sumir da mesma forma, fez com que a sequência de mortes ficasse como uma parte flutuante no filme. A atuação de Hale Berry vem com um tom dramático, mas por estar solto na história, ficou vazia.Foi muito interessante ver o Mark Dacascos de volta as telonas. Quem lembra dele em Only the Strong “Esporte Sangrento” e a série The Crow “O Corvo” ? Gostei muito dessa participação.Teve muitas mortes nesse filme, coregrafia para dar e ver, ação pura. Com o final e com a confirmação do estúdio, já vamos nos preparando para o John Wick 4 que está previsto para 21 de maio de 2021.O ponto preocupante do filme esteja na quantidade de mortes, que chega a ponto que você fica analisando muito as coregrafias, mas é o ponto forte de John Wick.Talvez eu não tenha gostado muito da forma do término, na luta com 2 assassinos antes da luta principal com Mark Dacascos e na sua queda do prédio no fim do filme. Pois acabou levando para um caminho que não importe o que aconteça, ele não vai morrer.Sendo que pra mim, ele tem uma habilidade incrível como assasino e não sai ileso, como um “Duro de matar, moderno”. E não que ele seja um “Highlander - O Guerreiro Imortal”.Muitos tiros e muito entretenimento de ação. Que venha o 4.","pubDate":"Sat, 25 May 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/john-wick-3-parabellum/","category":"em cartaz"},{"title":"Pokémon - Detetive Pikachu","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/pokemon-detetive-pikachu/","description":"O jovem (Tim Goodman) une forças com o detetive Pikachu para desvendar o mistério por trás do desaparecimento de seu pai. Perseguindo pistas pelas ruas de Ryme City, a dupla dinâmica logo descobre uma trama desonesta que representa uma ameaça ao universo Pokémon.Dados técnicosTítulo original: Pokémon Detective PikachuData de lançamento: 09 de maio de 2019 (Brasil)Direção: Rob LettermanGênero: Ação e AventuraPaís: EUA e JapãoDuração: 104 minClassificação: 6 AnosOrçamento: $150 milhõesElenco Justice Smith Tim Goodman Ryan Reynolds Pikachu Kathryn Newton Lucy Stevens Bill Nighy Howard Clifford Ken Watanabe Tenente Hide YoshidaOpiniãoFinalmente se é possível ver uma Live-action com Pokémons no cinema. Nostalgia da infância em 2D, que agora tem uma visão mais realista com a ajuda da computação gráfica.O filme pode não chamar tanto atenção de ínício por se tratar de uma animação. Eu mesmo estava com preconceito em relação ao roteiro. Achando que seria qualquer coisa, só utilizando a fama do Pikachu.Após assistir, posso dizer que foi uma surpresa boa. Gostei muito das reviravoltas constantes durante o filme. É claro, não espere um roteiro sensacional, já que se trata de fantasia.Gostei muito do caminho que a história tomou. O filme tem muitos motivos para você ficar desconfiado antes de ver o mesmo:Pokémon?Pikachu falando?Que história pode ter uma coisa que só envolve batalhas Pokémon?Ao terminar de ver o filme, se tiver o mesmo pensamento que o meu, irá pensar: “Tiveram cuidado com os detalhes e pensaram bem na história.”Sem foco em batalhas pokémon, mas dá o gostinho. Apesar de ser impossível mostrar todos os pokémons em um filme só, consegue mostrar o necessário sem ficar poluída a construção da história.E com certeza foi muito bem elaborado o término. No decorrer você não fica frustrado com o que está vendo e consegue fechar com uma supresa que faz muito sentido. A sensação é de uma nostagia de infância que tem um ritmo tranquilo, com muitas reviravoltas que fazem sentido e um belo fechamento.O filme agrada por misturar nostagia, colecionáveis (pokémons), história tranquila, sem clichê e ter um cuidado com o que está sendo feito.Parabéns aos envolvidos !!!","pubDate":"Fri, 24 May 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/pokemon-detetive-pikachu/","category":"em cartaz"},{"title":"Os Vingadores - Ultimato","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/os-vingadores-ultimato/","description":"Após Thanos eliminar metade das criaturas vivas, os Vingadores têm de lidar com a perda de amigos e entes queridos. Com a ajuda de seus aliados remanescentes, os Vingadores precisam se reunir novamente para desfazer as ações do vilão. E com isso, restaurar a ordem do universo de uma vez por todas, não importando as consequências.Dados técnicosTítulo original: Avengers: EndgameData de lançamento: 25 de abril de 2019 (Brasil)Direção: Joe Russo e Anthony RussoRoteiro: Christopher Markus e Stephen McFeely - Obra original: Stan Lee e Jack KirbyGênero: Ação, Fantasia e AventuraPaís: EUADuração: 181 minClassificação: 12 AnosOrçamento: $356 milhõesElenco Robert Downey Jr. Tony Stark / Homem de Ferro Chris Hemsworth Thor Mark Ruffalo Bruce Banner / Hulk Chris Evans Steve Rogers / Capitão América Scarlett Johansson Natasha Romanoff / Viúva Negra Karen Gillan Nebula Benedict Cumberbatch Stephen Strange / Dr. Estranho Don Cheadle James Rhodes / Máquina de Combate Tom Holland Peter Parker / Homem-Aranha Chadwick Boseman T’Challa / Pantera Negra Elizabeth Olsen Wanda Maximoff / Feiticeira Escarlate Anthony Mackie Sam Wilson / Falcão Sebastian Stan Bucky / Soldado Invernal Danai Gurira Okoye Letitia Wright Shuri Dave Bautista Drax Zoe Saldana Gamora Josh Brolin Thanos Chris Pratt Peter Quill / Senhor das Estrelas Jeremy Renner Clint Barton / Gavião Arqueiro Paul Rudd Scott Lang / Homem-Formiga Evangeline Lilly Hope Van Dyne / Vespa Brie Larson Carol Danvers / Capitã Marvel Bradley Cooper RocketCronologiaAntes de qualquer coisa, para você que não está imerso no mundo da Marvel, abaixo a cronologia até esse filme para que você possa ver e preencher as lacunas.OpiniãoFinalmente chegou o momento para quem acompanhou todos os filmes da cronologia. Na primeira parte (Guerra infinita), meio que caiu a ficha do quão grandioso se tornou esse universo da Marvel. Acredito que até para quem apenas vai conferir no cinema, mas não é tão ligado aos quadrinhos e o universo da Marvel.Acaba sendo mais que apenas ir ao cinema para ver um filme de fantasia. Tem todo um trabalho que envolveu mais de uma década de muito trabalho e também posso mencioanr uma pitada de sorte. É muito dificil ter tantas pessoas e ideias envolvidas em um projeto e não ter contratempos. Podemos citar como exemplo, a liga da justiça do universo da DC (Qual será o futuro???).Então, é muito interessante ver que foi tudo muito levado à sério e teve muita colaboração, tantos dos executivos “sem noção”, atores, equipe e fãs.Robert Downey Junior, criou uma via de mão dupla. Além de interpretar muito bem o personagem durante todos esses anos, identificou que Tony Stark iria acrescentar muito no seu legado. É fato, que os Vingadores não seriam todo esse sucesso, sem Downey.Todos os interpretes mandaram super bem, mas não conseguirei falar de todos. Outro ator que tenho que mencionar, seria Chris Hemsworth, que dos vingadores originais já está com o seu futuro mais promissor para continuar no universo da Marvel (Teremos mais Thor nos cinemas). E falando sobre Thor, gostei muito do enredo do personagem. Teve uma boa continuação e foi lavada a alma em relação de não ter acertado o machado (Stormbreaker) na cabeça do Thanos, na Guerra Infinita.Considero a despedida do Capitão América, muito emocionante. Foi um desfecho muito bom, deixando bem resolvida a sua história nesse universo.Antes de assitir o filme, a dúvida que tinha era sobre o roteiro. Estava com o receio de ter uma decepção em relação a história de Thanos. Ele ficando lá, todo poderoso no seu trono e os vingadores vem com um plano qualquer e pronto.Felizmente o roteiro nào foi preguiçoso e podemos ver uma evolução constante sem passos muito previsíveis. Poder cortar a cabeça do Thanos sem esperar 3 horas foi uma grande sacana.Como nem tudo são flores, teve apenas uma coisa que não foi tão legal. A participação da Capitã Marvel. Calma, calma… vou explicar.A questão foi mais quanto a época de gravações. Sendo gravado para Os Vigadores, antes dela gravar o filme solo. Ao meu ver, algumas cenas ficaram meio soltas. Aperece, some. É claro, não afeta todo o contexto e se não fosse ela a batalha estava perdida. Mas se teve um ponto negativo no filme, foi a expectativa de entrosamento com a Capitã Marvel, até pelo fato de ter sido lançado quase juntos os filmes. IMHO, ela poderia ter aparecido mais cedo no universo.Sem dúvidas, um filme que está fazendo história. Acho um pouco errado, comparar com Titanic, Avatar e etc… Épocas diferentes, cenários diferentes e mais… Nem se tinha youtube na época de Titanic e cinema não tinha o mesmo marketing de hoje. Mas é fato que está na história. Cada um com a sua importância em sua época.Tenho que assumir que chorei em 2 momentos nesse filme. Então, muita aventura, fantasia, ação e emoção. Parabéns a Marvel e a todos os interpretes. O nível foi elevado !!","pubDate":"Fri, 10 May 2019 21:00:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/os-vingadores-ultimato/","category":"em cartaz"},{"title":"Os Vingadores - Guerra Infinita","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/os-vingadores-guerra-infinita/","description":"Thanos (Josh Brolin) enfim chega à Terra, disposto a reunir as Joias do Infinito. Para enfrentá-lo, os Vingadores precisam unir forças com os Guardiões da Galáxia, ao mesmo tempo em que lidam com desavenças entre alguns de seus integrantes.ElencoRobert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans, Scarlett Johansson, Benedict Cumberbatch, Don Cheadle, Tom Holland, Chadwick Boseman, Paul Bettany, Elizabeth Olsen, Anthony Mackie, Sebastian Stan, Danai Gurira, Letitia Wright, Dave Bautista, Zoe Saldana, Josh Brolin, Chris Pratt e mais.Dados técnicosTítulo original: Avengers: Infinity WarData de lançamento: 26 de abril de 2018 (Brasil)Direção: Joe Russo e Anthony RussoRoteiro: Christopher Markus e Stephen McFeely - Obra original: Jack KirbyGênero: Ação e AventuraPaís: EUADuração: 156 minClassificação: 12 AnosOrçamento: $300–400 milhõesPersonagens em destaque: Tony Stark / Homem de Ferro Robert Downey Jr., Thor Chris Hemsworth, Bruce Banner / Hulk Mark Ruffalo, Steve Rogers / Capitão América Chris Evans, Natasha Romanoff / Viúva Negra Scarlett Johansson, Stephen Strange / Dr. Estranho Benedict Cumberbatch, Peter Parker / Homem-Aranha Tom Holland, T’Challa / Pantera Negra Chadwick Boseman , Gamora Zoe Saldana, Visão Paul Bettany, Wanda Maximoff / Feiticeira Escarlate Elizabeth Olsen e Thanos Josh Brolin.CronologiaAntes de qualquer coisa, para você que não está imerso no mundo da Marvel, abaixo a cronologia até esse filme para que você possa ver e preencher as lacunas.RoteiroCumprindo a promessa de Nick Fury, feita a 10 anos atrás de uma maneira que era quase inimaginável na época. Os Vingadores não apenas juntou os heróis mais poderosos da Terra, como também reuniu os Guardiões da Galáxia, Doutor Estranho, Homem-Aranha, Pantera Negra e Thanos (que agora devem ser classificado entre os melhores vilões do universo Marvel ao lado de Loki e Killmonger). Esse fato, que ao mesmo tempo é divertido e emocionante, talvez seja algo que nem o próprio Fury poderia esperar.O grande vilão Thanos, comanda talvez o arco mais forte do filme. Se não pudermos ter empatia com seu raciocínio por querer eliminar metade dos habitantes do universo, as apostas mais altas já feitas pelos Vingadores, que são efetivamente estabelecidos ao longo do filme, podemos pelo menos entender sua perspectiva e acreditar em sua dor quando ele precisa fazer verdadeiros sacrifícios para alcançar seu objetivo final.Gamora e a Nebulosa, desempenham um papel maior neste filme do que se poderia esperar. Que a história de origem de Gamora e Thanos tenha um papel tão proeminente em um filme chamado Os Vingadores é uma surpresa. Podemoe ver o que Gamora suportou quando criança é um momento bastante notável.Também é incrível como as várias peças do Universo Marvel se encaixam perfeitamente, seja os Guardiões que se encontram no espaço, reunindo os Vingadores, o Homem de Ferro brigando com o Doutor Estranho ou Bruce Banner incrivelmente falando sobre tudo que ele perdeu na Terra, enquanto ele estava fora.Enquanto temos a reunião de todos os personagens apresentados até hoje, também é ousado o suficiente para introduzir novos rostos. Os Filhos de Thanos (seus quatro capangas, também conhecidos como a Ordem Negra nos quadrinhos).Usando a força de seu vilão poderoso e interessante para definir as apostas mais altas do que nunca, o filme reúne com sucesso os últimos 10 anos de filmes da Marvel em um coquetel de heróis. O fato de conseguir dar a quase todos os membros de seu elenco um momento para brilhar é o seu maior feito.InterpretaçãoGrandes estrelas como super heróis, elenco gigantesco, muita ação e muito CGI, fica difícil olhar para a atuação de cada pesonagem. Mas esse filme consegue dar importância para algumas atuações que acabando ficando em segundo plano. E tiveram muito destaque no enredo do filme.E o destaque fica por conta de Zoe Saldana e Elizabeth Olsen, que deram um show trazendo boas atuações nos momentos dramáticos. E também vale lembrar da maturidade do personagem de Chris Hemsworth, que vem aumentando com o decorrer dos anos.DireçãoDada a grande escala em que os Russos estão trabalhando, recorrer ao típico jogo de colecionar pedras preciosas parece ser decepcionantemente básico, mas há um problema maior com Thanos. Ele é duas vezes maior que um ser humano e os efeitos em Brolin frustram sua autoridade usual como ator. Sendo visto como um Ogro, trazido do World of Warcraft. Há um grande trabalho para se ter profundidade nas cenas da subtrama envolvendo sua filha adotiva Gamora.Os Russos ficam em um terreno mais firme, colocando seus mocinhos uns contra os outros, por uma questão de comédia ou atrito, do que empurrando qualquer um contra Thanos.De fato, com o tamanho do elenco é difícil manter o controle de todos, mas os diretores continuamente vão e voltam entre os enredos da trama e os conjuntos para que nunca fiquemos com ninguém por muito tempo, embora haja momentos em que você volte a uma cena apenas para perceber que você estava tão investido na anterior que está desapontado por seguir em frente. Parece um pouco com o canal surfando entre três ou quatro filmes da Marvel de uma vez, mas quando eles são tão bons quanto eles, quem pode reclamar? Seria bom ter passado mais tempo em determinados locais ou com determinados personagens, mas em um filme tão grande, é impressionante termos tempo suficiente com qualquer um.CuriosidadesOs irmãos Joe e Anthony Russo consultaram todos os diretores anteriores da Marvel Studios para que pudessem representar os personagens da forma mais fiel possível.O filme foi inteiramente gravado com câmeras IMAX, tornando-se um dos primeiros ficcionais a serem completamente exibidos neste formato.Joe Russo e Anthony Russo, de Capitão América 2: O Soldado Invernal e Capitão América: Guerra Civil (2016), assumiram a direção do longa-metragem após a saída de Joss Whedon (de Os Vingadores e Vingadores: Era de Ultron).Tom Holland não teve permissão para ler o roteiro de Vingadores 3 por não conseguir guardar segredos, já que o ator revelou informações de Homem-Aranha: De Volta ao Lar.O longa foi lançado em 2018, ano em que o Universo Cinematográfico Marvel completa 10 anos.A segurança para as gravações dentro da Catedral de Durham, na Inglaterra, foi tão rígida que nem mesmo os guardas da própria catedral tiveram acesso à área das filmagens.ConclusãoA coisa mais emocionante sobre o filme, no entanto, é que alguém finalmente colocou um evento em quadrinhos na tela. Embora muitas vezes ridicularizado como superficial e fácil, as melhores histórias de eventos funcionam porque você se preocupa com quem consegue sair delas e está preocupado com o que elas podem perder ao longo do caminho, mesmo sabendo que elas vencerão. Como um evento em quadrinhos, Os Vingadores: Guerra Infinita é épico pelo escopo e ambição. Isso vai deixá-lo simultaneamente sem fôlego e emocionalmente devastado, e quando você se recompor, você vai querer fazer tudo de novo.Grande produção que deve ser vista. Que venha a parte 2.","pubDate":"Thu, 10 May 2018 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/os-vingadores-guerra-infinita/","category":"em cartaz"},{"title":"Rampage - Destruição total","link":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/rampage-destruicao-total/","description":"Davis Okoye é um soldado que virou primatologista (Dwayne Johnson), que compartilha um vínculo inabalável com George, um gorila muito inteligente que está sob seus cuidados desde o nascimento. Quando um experimento genético desordenado que deu errado transforma este gorila gentil em uma criatura furiosa de tamanho enorme. Para piorar a situação, logo é descoberto que existem outros animais alterados de forma semelhante. Agora Okoye tenta conseguir um antídoto e impedir que seu amigo provoque uma catástrofe global.ElencoDwayne Johnson, Naomie Harris, Malin Åkerman, Jake Lacy, Joe Manganiello, Jeffrey Dean Morgan, P.J. Byrne, Marley Shelton, Jack Quaid, Matt Gerald, Demetrius Grosse, Will Yun Lee e mais.Dados técnicosTítulo original: RampageData de lançamento: 12 de abril de 2018 (Brasil)Direção: Brad PeytonRoteiro: Carlton Cuse, Ryan J. Condal e Adam SztykielGênero: Ação e AventuraPaís: EUADuração: 108 minClassificação: 14 AnosOrçamento: $120 milhõesPersonagens em destaque: Davis Okoye Dwayne Johnson, Dr. Kate Caldwell Naomie Harris e Claire Wyden Malin Åkerman.RoteiroComo você consegue ter Godzilla ou King Kong se você não tem os direitos de Godzilla ou King Kong? Você tem uma opção pouco conhecida dos anos 80, um jogo chamado Rampage.Baseado no jogo homônimo de arcade dos anos 80 que não oficialmente inspirou o Detona Ralph da Disney. O roteiro com um quebra-cabeças gigantesco supõe que o público quer ver o Davis Okoye impedir três enormes criaturas mutantes de destruírem metrópoles americanas.Invertendo o roteiro o original de Rampage, onde o mesmo o convida a ser uma das três monstruosidades destruidoras (um macaco gigante, um lagarto parecido com Godzilla ou um lobisomem coberto de mato). No jogo, você seria um dos monstros e o objetivo era destruir prédios altos antes que os militares o matassem.InterpretaçãoNão há como negar o carisma de Dwayne Johnson e sua marca de humor autodepreciativo. A desvantagem de seu bom desempenho, no entanto, pode ser que ele pareça ser muito capaz. Seja comunicação interespecífica, pilotagem de helicóptero ou manuseio de armas, Davis (Johnson) não deixa muito espaço para os outros brilharem.EdiçãoPara mim, o grande destaque no filme está na edição que foi feita por Jim May e Bob Ducsay. Esse é o sexto filme em que trabalham juntos.Você já viu o trabalho de Ducsay em Stars Wars: o último Jedi, Terremoto: A Falha de San Andreas e Godzilla (2014). E o trabalho de May em Goosebumps: Monstros e Arrepios, Cowboys &amp; Aliens e As Crônicas de Nárnia.DireçãoO diretor Brad Peyton oferece uma sucessão de cenas desconcertantes, mas a relação entre Johnson e seu amigo, George (Jason Liles), é a principal dinâmica narrativa. A estratégia de Peyton é combinar o caos em grande escala com personalidades humanas comparativamente grandes.EntretenimentoOs efeitos especiais e sequências de ação no filme são muito bons. A narrativa não se leva a sério, mas é divertida, embora também muito gráfica.Os atores fazem um bom trabalho: Johnson é um herói forte, carismático e destemido que faz o papel de Okoye com inteligência; Naomie Harris como Dra. Kate Caldwell, engenheira genética difamada que educa a primeira sobre o que está acontecendo com os animais e ajuda a salvar o dia, também é estelar e muito convincente.O filme consegue fazer bem o seu papel com um protagonista carismático, explosões, animais gigantes e muita ação.CuriosidadesBrad Peyton já havia dirigido Johnson em San Andreas (que também foi escrito pelo co-roteirista de Rampage, Carlton Cruse).ConclusãoEmbora melhor do que Doom, esta adaptação de Dwayne Johnson, baseada em videogames, recai sobre os clichês de filmes de monstros. Mas temos que ter a mente aberta em não esperar muita coisa de uma produção que se baseia no simples enredo de criaturas destruindo prédios.Então, tendo isso em mente, você irá ver que esse filme conseguiu ir muito longe mesmo que o roteiro tem algumas lacunas não preenchidas. É uma boa pedida de um entretenimento de ação.","pubDate":"Sat, 05 May 2018 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/imhomovies/opinioes/em-cartaz/rampage-destruicao-total/","category":"em cartaz"}]}