{"title":"Nerd Calistênico","description":"","language":"pt-br","link":"https://nerdcalistenico.github.io/perfil","pubDate":"Sat, 15 Aug 2020 19:20:00 GMT","lastBuildDate":"Sun, 23 Aug 2020 18:05:02 GMT","webMaster":"Perfil","items":[{"title":"Mighty Morphin Power Rangers","link":"https://nerdcalistenico.github.io/perfil/preferencias/tokusatsu/mighty-morphin-power-rangers/","description":"Título no Brasil: Power RangersPrimeiro episódio: 28 de agosto de 1993Episódio final: 16 de fevereiro de 1996Número de temporadas: 3Emissora original: Fox Broadcasting CompanyNúmero de episódios: 155Elenco: Amy Jo Johnson Kimberly Ann Hart Jason David Frank Tommy Oliver David Yost Billy Cranston Austin St. John Jason Lee Scott Thuy Trang Trini Kwan Walter Jones Zack Taylor Paul Schrier Farkus Bulkmeier Jason Narvy Eugene SkullovitchMighty Morphin Power Rangers traduzida no Brasil simplesmente como Power Rangers foi uma série de televisão infantil norte-americana de live action do gênero Super Sentai que estreou em 28 de agosto de 1993, no bloco semanal Fox Kids.A série é sobre um grupo de adolescentes que foram escolhidos para proteger o mundo de um grupo de invasores alienígenas e foram dados a capacidade de se “transformar” em super-poderosos guerreiros e usar robôs gigantes chamados “Zords”. Ela foi adaptada e utilizada a partir da série de televisão japonesa Zyuranger, que foi a 16ª série Super Sentai da Toei Company.Tanto a série quanto a linha de produtos tornaram-se um grande êxito da noite para o dia, tornando-se um hit da década de 1990 e parte da cultura pop em poucos meses.A série original durou por três anos, entre 1993 e 1995 gerando consequentemente o filme Mighty Morphin Power Rangers: The Movie.A segunda e terceira temporadas da série foram baseadas em imagens e elementos das séries Super Sentais Gosei Sentai Dairanger e Ninja Sentai Kakuranger respectivamente, embora os costumes de Zyuranger ainda fossem usados ​​para o elenco principal.Somente o robô e o traje do Kiba Ranger (usado pelo Ranger Branco) e mais o robô formado pelos cinco “zords” foram retidos de Dairanger para a segunda temporada, enquanto apenas o robô de Kakuranger formado pelos cinco “zords” (fora o Shogunzords) foi destaque na terceira temporada. No entanto, os trajes de Kakuranger foram posteriormente utilizados para os personagens-título da minissérie, Mighty Morphin Alien Rangers.A série foi produzida pela Power Rangers Productions, distribuída pela Saban Entertainment e, foi ao ar na Fox Kids. A mercadoria do show foi produzida e distribuída pela Bandai Entertainment, chegando a vender $6 bilhões.Em 1996, a série foi rebatizada como a franquia Power Rangers, renomeando a série todos os anos depois, e usando figurinos, adereços e imagens da subsequente série Super Sentai, bem como alterando a linha de elenco e história. Enquanto uma linha de história global continuaria até Power Rangers: Lost Galaxy, as séries subseqüentes após Power Rangers não são continuações ou spin-offs no sentido tradicional.Em 2010 foi transmitida a reestréia de Mighty Morphin Power Rangers, com um novo logotipo, quadrinhos gráficos e imagem digitalizada com efeitos especiais alternativos extras, foi transmitida pela ABC Kids. A Bandai produziu novos brinquedos para coincidir com a série.O estúdio Lionsgate definiu uma data para um reboot em versão cinematográfica que chegou aos cinemas desde 23 de março de 2017 nos Brasil e no dia 24 nos EUA.HistóriaEm uma missão ao planeta Marte dois astronautas encontram uma estranha cápsula encostada no solo do planeta. Eles abrem e libertam a feiticeira espacial do mal Rita Repulsa.Ela não perde tempo e logo ataca o planeta Terra. Para proteger o planeta, o ser intergalático Zordon e seu assistente robô Alpha 5 recrutam os adolescentes Jason, Zack, Billy, Trini e Kimberly e dão os morfadores e as moedas do poder para se tornarem Power Rangers, um grupo de super heróis com arsenal de alta tecnologia e que possuem veículos gigantes de combates chamados zords. Após certa relutância, o grupo aceita a missão de lutar contra Rita e sua horda maligna.Para derrotar os Power Rangers de uma vez por todas, Rita cria o Ranger verde, enfeitiçando o adolescente Tommy e lhe concede um morfador e uma moeda do poder para eliminar seus inimigos.Mas Jason, o Ranger vermelho e líder da equipe consegue vencer Tommy em uma luta e quebra o feitiço, convencendo Tommy a se juntar a equipe. Depois de certo tempo, Tommy começou a perder os poderes, e após entregar sua moeda do poder a Jason, Rita lançou um mega ataque a Terra com o zord de guerra de seu general Goldar, mas acabou sendo derrotada mais uma vez. Logo, Zordon achou um meio de restaurar os poderes de Tommy, e o Ranger verde retorna para ajudar a equipe.https://pt.wikipedia.org/wiki/Mighty_Morphin_Power_Rangers Fonte: Wikipédia","pubDate":"Sat, 15 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/tokusatsu/mighty-morphin-power-rangers/","category":"tokusatsu,nostalgia"},{"title":"Chespirito","link":"https://nerdcalistenico.github.io/perfil/preferencias/programas-infantis/chespirito/","description":"Título no Brasil: Clube do ChavesPrimeiro episódio: 15 de outubro de 1970 (1ª fase) - 4 de fevereiro de 1980 (2ª fase)Episódio final: 20 de fevereiro de 1973 (1ª fase) - 25 de setembro de 1995 (2ª fase)Número de temporadas: 16Emissora original: El Canal de las EstrellasNúmero de episódios: 692Elenco: Roberto Gómez Bolaños Chómpiras Rubén Aguirre Doctor María Antonieta de las Nieves La Chilindrina Angelines Fernández Doña Cleotilde Ramón Valdés Don Ramón Carlos Villagrán Quico Édgar Vivar Señor Barriga Florinda Meza Doña Florinda Horacio Gómez Bolaños Godínez Raúl (Chato) Padilla Señor JaimitoChespirito (também conhecido no Brasil como Clube do Chaves) foi um programa de televisão humorístico mexicano criado, roteirizado, dirigido e estrelado por Roberto Gómez Bolaños, mais conhecido pela alcunha que carregava o programa.Estreou originalmente, uma vez por semana, no horário nobre da Televisa. Este programa, porém, não apresenta todo o elenco da série Chaves: há dois atores ausentes no seriado: Ramón Valdés (intérprete do Seu Madruga) e Carlos Villagrán (intérprete do Quico). Embora, em 1981, Ramón Valdés volte a interpretar Seu Madruga no programa, no quadro Chaves, e Tripa Seca no quadro Chapolin Colorado (além de várias participações nos demais quadros), abandonou o elenco CH definitivamente no final do ano.O programa Chespirito teve também um primeiro período, de 15 de outubro de 1970 a 20 de fevereiro de 1973 (originalmente chamado Los supergenios de la mesa cuadrada), antes de Chaves e Chapolin tornarem-se programas independentes, sendo que neste período, Ramón Valdés e Carlos Villagrán faziam parte do Elenco CH.Grande parte dos episódios do primeiro período são perdidos, pois não são mais distribuídos pela televisa, entre eles estão a primeira aparição do chaves, do doutor Chapatin, primeiras versões perdidas de episódios clássicos. Alguns esquetes de 1970/1971 (com Chapolin, Chespirito, Chaparrón e doutor Chapatin) podem ser encontradas na internet retirados de acervos pessoais de fãs.Quarenta e quatro esquetes de 1972 foram compilados em episódios de Chaves e Chapolin já como programas próprios quando Chespirito não pode gravar e são distribuídos normalmente pela Televisa. Voltou a ser apresentado pelo SBT no dia 23/05/20 das 6 as 8 horas da manhã antecedendo ao Sábado Animadohttps://pt.wikipedia.org/wiki/Chespirito_(programa_de_televis%C3%A3o) Fonte: Wikipédia","pubDate":"Fri, 14 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/programas-infantis/chespirito/","category":"programas infantis,nostalgia"},{"title":"Uchuu Keiji Gavan","link":"https://nerdcalistenico.github.io/perfil/preferencias/tokusatsu/uchuu-keiji-gavan/","description":"Título no Brasil: Space CopPrimeiro episódio: 5 de março de 1982Episódio final: 25 de fevereiro de 1983Número de temporadas: 1Emissora original: TV Asahi, All-Nippon News NetworkNúmero de episódios: 44Elenco: Kenji Ohba Retsu Ichijôji Toshiaki Nishizawa Commander Qom Wakiko Kano Mimi Kyoko Nashiro Marin Masayuki Suzuki Kojiro OyamaUchuu Keiji Gavan (宇宙刑事ギャバン &#39;Uchū Keiji Gyaban&#39;, traduzido como Detetive Espacial Gavan, e lançada no Brasil sob o título de Space Cop) é a primeira série de televisão do gênero tokusatsu da franquia Metal Hero. Foi produzida pela Toei Company, e exibida originalmente entre 5 de março de 1982 e 25 de fevereiro de 1983 pela TV Asahi.A série é a primeira da trilogia dos Policiais do Espaço, continuada pelas duas séries seguintes, Sharivan e Shaider.No Brasil, foi transmitida pela Rede Globo a partir de 4 de março de 1991 na Sessão Aventura, quando foram exibidos apenas os 20 primeiros episódios. Posteriormente, foi remanejado para o extinto Xou da Xuxa, quando os 44 episódios foram milagrosamente exibidos. Também foi TV Gazeta subsequentemente no mesmo ano, no programa Gazetinha.HistóriaA Organização Criminosa Makuu percorre o espaço conquistando planetas, matando seus habitantes e escravizando seus povos.A União da Polícia Galáctica envia o oficial Takeshi Ichijouji (Retsu Ichijouji no original) para a Terra para que detenha a invasão de Makuu.O pai de Retsu também foi Policial do Espaço e foi capturado pela Makuu anos atrás. Ao chegar à Terra, Retsu usa a Combat Suit prateada e todas as suas armas de alta tecnologia contra a Makuu, dizimando seus monstros um a um, ao mesmo tempo em que procura pelo pai desaparecido.https://pt.wikipedia.org/wiki/Uchuu_Keiji_Gyaban Fonte: Wikipédia","pubDate":"Fri, 14 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/tokusatsu/uchuu-keiji-gavan/","category":"tokusatsu,nostalgia"},{"title":"Hikari Sentai Maskman","link":"https://nerdcalistenico.github.io/perfil/preferencias/tokusatsu/hikari-sentai-maskman/","description":"Título no Brasil: Defensores da Luz MaskmanPrimeiro episódio: 28 de fevereiro de 1987Episódio final: 20 de fevereiro de 1988Número de temporadas: 1Emissora original: TV Asahi, All-Nippon News NetworkNúmero de episódios: 51Elenco: Kanako Maeda Momoko Issei Hirota Akira Yuki Nagata Haruka Koichi Kusakari Kenta Ryousuke Kaizu TakeruHikari Sentai Maskman (光戦隊マスクマン) traduzido como Esquadrão da Luz Maskman) é uma série televisiva japonesa do gênero tokusatsu, pertencente à franquia dos Super Sentai. Foi exibida originalmente entre 28 de fevereiro de 1987 e 20 de fevereiro 1988, totalizando 51 episódios. Foi exibida no Brasil na extinta Rede Manchete.HistóriaSugata, um estudioso dos poderes da mente, descobre a existência do Império Subterrâneo Tube, uma força maligna que quer dominar a Terra. Diante de tal ameaça, Sugata reúne cinco jovens Maskman, cada um especializado em um estilo de artes marciais além de um gesto motor com as mãos.A série se baseava na seguinte frase: Uma misteriosa e inexplicável força se esconde por trás do nosso corpo, e quanto mais treinarmos, essa força infinita se manifestará.https://supersentai.fandom.com/pt/wiki/Hikari_Sentai_Maskman Fonte: Wikipédia","pubDate":"Thu, 13 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/tokusatsu/hikari-sentai-maskman/","category":"tokusatsu,nostalgia"},{"title":"Os Trapalhões","link":"https://nerdcalistenico.github.io/perfil/preferencias/programas-infantis/os-trapalhoes/","description":"Título no Brasil: Os TrapalhõesPrimeiro episódio: 1974Episódio final: 27 de agosto de 1995Número de temporadas: –Emissora original: Rede Tupi (1974–1976), Rede Globo (1977–1995)Número de episódios: –Elenco: Renato Aragão Didi Antônio Carlos Bernardes Gomes Mussum Manfried Sant'Anna Dedé Santana (Dedé) Mauro Faccio Gonçalves ZacariasOs Trapalhões foi um programa de televisão humorístico brasileiro, criado por Wilton Franco e estrelado pelo grupo cômico de mesmo nome, composto por Didi, Dedé, Mussum e Zacarias; cada um desenvolveu uma persona cênica distinta. O grupo já obtinha sucesso na televisão e no cinema desde meados da década de 1960.O programa estreou no ano de 1974 na Rede Tupi. Em 13 de março de 1977 estrearam na Rede Globo, antes do Fantástico. Exibido aos domingos, o programa apresentava uma sucessão de esquetes entremeados sem aparente conexão, exceto a presença dos próprios. Um dos maiores fenômenos de popularidade e audiência no Brasil em toda a história, o programa entrou para o Livro Guinness de Recordes Mundiais como o programa humorístico de maior duração da televisão, com trinta anos de exibição.O primeiro filme deles, Na Onda do Iê-Iê-Iê (1966), contava apenas com a dupla Didi e Dedé. Com o quarteto clássico, foram produzidos vinte e um filmes, começando com Os Trapalhões na Guerra dos Planetas (1978) até Uma Escola Atrapalhada (1990). Mais de cento e vinte milhões de pessoas já assistiram aos filmes de Os Trapalhões, sendo que sete destes filmes estão na lista das dez maiores bilheterias do cinema brasileiro.Em 2017, a Globo, em uma parceria com o Canal Viva produz um revival do programa, agora com seis trapalhões. Além de Didi e Dedé, o programa apresenta os sobrinhos dos trapalhões originais: Didico, Dedeco, Mussa e Zaca. Sem repetir o sucesso a versão original, foi descontinuado no mesmo ano devido à crítica e recepção negativa. Em dezembro do mesmo ano, o canal anunciou reprises das temporadas antigas do programa em janeiro de 2018.https://pt.wikipedia.org/wiki/Os_Trapalh%C3%B5es Fonte: Wikipédia","pubDate":"Wed, 12 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/programas-infantis/os-trapalhoes/","category":"programas infantis,nostalgia"},{"title":"Kidou Keiji Jiban","link":"https://nerdcalistenico.github.io/perfil/preferencias/tokusatsu/kidou-keiji-jiban/","description":"Título no Brasil: Policial de Aço JibanPrimeiro episódio: 29 de janeiro de 1989Episódio final: 28 de janeiro de 1990Número de temporadas: 1Emissora original: TV Asahi, All-Nippon News NetworkNúmero de episódios: 52Elenco: Shouhei Kusaka Naoto Tamura/Jiban Konomi Mashita Ami Kawai Shōzō Iizuka Akemi Kogawa Kidou Keiji Jiban (機動刑事ジバン &#39;Kidō Keiji Jiban&#39;, no Brasil: Policial de Aço Jiban) é uma série de televisão do gênero tokusatsu, da franquia Metal Hero, produzida pela Toei Company entre 1989 e 1990. Tem sua premissa semelhante ao filme norte-americano dos anos 80 Robocop e ao tokusatsu Robot Detective (ロボット刑事 ‘Robotto Keiji’).Trazida ao Brasil pela extinta distribuidora Top Tape, foi exibida a partir de 1990 pela Rede Manchete. Foi lançado em DVD pela Focus Filmes em 2011 e em julho de 2019 foi disponibilizado no serviço Prime Video pela distribuidora Sato CompanyHistóriaO policial Naoto Tamura sacrificou sua vida para derrotar um dos monstros da organização Biolon, mas renasceu como o Policial de Aço Jiban, passando a combater o grupo maligno, liderado pelo Doutor Jean Marrie.https://pt.wikipedia.org/wiki/Jiban Fonte: Wikipédia","pubDate":"Wed, 12 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/tokusatsu/kidou-keiji-jiban/","category":"tokusatsu,nostalgia"},{"title":"Dominik Sky","link":"https://nerdcalistenico.github.io/perfil/preferencias/calistenia/dominik-sky/","description":"Instagram: @dominik_skyYoutube: DominikSkytrainingWebsite: dominiksky.net","pubDate":"Wed, 12 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/calistenia/dominik-sky/","category":"calistenia"},{"title":"Super Oito","link":"https://nerdcalistenico.github.io/perfil/preferencias/canais/super-oito/","description":"","pubDate":"Tue, 11 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/canais/super-oito/","category":"canais"},{"title":"Punky Brewster","link":"https://nerdcalistenico.github.io/perfil/preferencias/programas-infantis/punky-brewster/","description":"Título no Brasil: Punky, a levada da brecaPrimeiro episódio: 16 de setembro de 1984Episódio final: 27 de maio de 1988Número de temporadas: 4Emissora original: NBCNúmero de episódios: 88Elenco: Soleil Moon Frye Penelope (Punky) Baker George Gaynes Henry Warnimont (Arthur Bicudo) Cherie Johnson Cherie Johnson (Cátia Alves) Susie Garrett Betty Johnson (Luíza Alves) Ami Foster Margaux Kramer (Margot Kramer) Casey Ellison Allen Anderson (Júnior Anderson)Punky Brewster (Punky, A Levada da Breca, no Brasil) é uma série televisiva americana que foi transmitida originalmente durante os anos de 1984 a 1988, em 88 episódios divididos em 04 temporadas Nos Estados Unidos, a série foi exibida na NBC entre 16 de setembro de 1984 a 7 de setembro de 1986, tendo sido exibida novamente por syndication entre 26 de setembro de 1987 a 27 de maio de 1988.A série gerou também um desenho animado, e na época do seu lançamento a personagem ganhou vários produtos que foram lançados no mercado.No Brasil, a série foi transmitida pelo SBT com o nome de Punky, A Levada da Breca, repetindo o mesmo sucesso dos Estados Unidos. Em 2008, a série foi comprada pela Rede Bandeirantes de televisão. A dublagem original, realizada nos estúdios da Elenco, pertence exclusivamente ao SBT, e por essa razão a série foi totalmente redublada pela Dublavídeo. A primeira reexibição da série pela emissora ocorreu em 25 de dezembro de 2008, com um especial de natal.[1]Em 10 de agosto de 2015, a série volta a grade de programação do SBT às 13:30, com a sua dublagem clássica. No dia 31 de agosto de 2015, voltou a ser cancelada, sendo Substituído pela série Dupla do Barulho.HistóriaPenélope ‘Punky’ Brewster é uma garota engraçada e bem humorada, abandonada (supostamente) por seus pais. O pai de Punky deixou a família quando ela tinha dois anos, e anos mais tarde, foi abandonada por sua mãe, que a levou até um supermercado (shopping center na dublagem brasileira) em Chicago e desapareceu. Punky então fica sozinha, apenas com a companhia do seu cão Pinky (Brandon, no original). Logo depois, ela descobre um apartamento vago em um prédio local e passa a viver lá.O prédio era gerenciado pelo fotógrafo Arthur Bicudo (Henry Warnimont), um senhor viúvo. Punky rapidamente se torna amiga de Cátia Alves (Cherie Johnson), uma garota que vive no andar acima do apartamento de Arthur, e sua avó Luíza Alves (Betty Johnson). Quando Arthur descobre Punky no apartamento vazio adjacente ao seu, ele ouve a história da garota e se emociona, se tornando como um pai para a garota, a adotando mais tarde.Devido a dificuldade de comportamento da garota, a série é repleta de trapalhadas e situações inusitadas, contando com a presença de mais algumas personagens amigas de Punky, como Júnior Anderson (Allen Anderson), e a esnobe Margot (Margaux Kramer).Há vários episódios memoráveis durante a série, como um no qual Cátia acaba presa em um refrigerador velho durante um jogo de esconde-esconde, consequentemente sofrendo de falta de oxigênio, e Punky e Margot salvam sua vida aplicando técnicas de reanimação cardiorrespiratória aprendidas na escola. Há também um dos mais sérios episódios da série, no qual trata de abuso sexual de menores.https://pt.wikipedia.org/wiki/Punky_Brewster Fonte: Wikipédia","pubDate":"Tue, 11 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/programas-infantis/punky-brewster/","category":"programas infantis,nostalgia"},{"title":"Kyouryu Sentai Zyuranger","link":"https://nerdcalistenico.github.io/perfil/preferencias/tokusatsu/kyouryu-sentai-zyuranger/","description":"Título no Brasil: Esquadrão Dinossauro ZyurangerPrimeiro episódio: 21 de fevereiro de 1992Episódio final: 12 de fevereiro de 1993Número de temporadas: 1Emissora original: TV Asahi, All-Nippon News NetworkNúmero de episódios: 50Elenco: Reiko Chiba Mei Yūta Mochizuki Geki Takumi Hashimoto Boi Seiju Umon Goushi Hideki Fujiwara DanKyouryu Sentai Zyuranger (恐竜戦隊ジュウレンジャー &#39;Kyōryū Sentai Jūrenjā&#39;, traduzido como Esquadrão Dinossauro Zyuranger) é uma série japonesa de tokusatsu, da franquia dos Super Sentai, sendo a 16ª série da franquia, sucedendo Jetman e antecedendo Dairanger.Foi produzida pela Toei Company e Bandai, indo ao ar na TV Asahi de 21 de Fevereiro de 1992 a 12 de Fevereiro de 1993. Zyuranger serviu de base para a criação de primeira temporada de Power Rangers.A partir de Zyuranger, toda série de Super Sentai produzida no Japão ganhou uma versão Power Rangers, produzida nos Estados Unidos.Em 25 de julho de 2014, a Shout! Factory anunciou o lançamento dos DVDs da série original para o público ocidental, previsto para 17 de fevereiro de 2015. Foi o segundo Super Sentai a lançar em 1992 um jogo para o Nintendo Entertainment System, distribuído pela Angel Studios.E com o auge de MMPR, foi relançado com o nome Power Rangers 2. Em 2017, a série contou com aparições de seus personagens no jogo Super Robot Wars X-Ω.HistóriaA cerca de 170 milhões de anos atrás, durante a era dos dinossauros, as Dinoferas sofreram um ataque das forças do mal de Gran Satã, lideradas pela bruxa Bandora. Ela odiava dinossauros e quis erradicar todas o espécies da face da Terra. Ao final da guerra, Bandora e seus lacaios foram presos dentro de uma urna mágica e banidos para o planeta Nemesis.Mas uma profecia dizia que após 170 milhões de anos, o planeta Nemesis iria se aproximar da Terra e Bandora iria fugir e transformar o nosso planeta em um cemitério.Então, cinco crianças dos cinco grandes reinos se ofereceram para permanecer em um tipo de hibernação até o dia em que Bandora voltasse. Barza, o mago branco, os vigiou durante seu longo sono. No presente, Bandora consegue escapar graças à astronautas errantes. Os cinco guerreiros foram despertados para combater as forças do mal, e com o poder das Dinoferas, eles se tornaram o Time Sáurio Zyuranger.https://pt.wikipedia.org/wiki/Ky%C5%8Dry%C5%AB_Sentai_Zyuranger Fonte: Wikipédia","pubDate":"Tue, 11 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/tokusatsu/kyouryu-sentai-zyuranger/","category":"tokusatsu,nostalgia"},{"title":"Gabriella Savina","link":"https://nerdcalistenico.github.io/perfil/preferencias/calistenia/gabriella-savina/","description":"Instagram: @savinagabriella","pubDate":"Tue, 11 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/calistenia/gabriella-savina/","category":"calistenia"},{"title":"Castro Brothers","link":"https://nerdcalistenico.github.io/perfil/preferencias/canais/castro-brothers/","description":"","pubDate":"Mon, 10 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/canais/castro-brothers/","category":"canais"},{"title":"Dudalegria","link":"https://nerdcalistenico.github.io/perfil/preferencias/programas-infantis/dudalegria/","description":"Título no Brasil: DudalegriaPrimeiro episódio: 1992Episódio final: 1996Número de temporadas: 4Emissora original: MancheteNúmero de episódios: –Elenco: Maria Eduarda Esteves e Alves Duda LittleEm 1992 com a saída de Cinthya e Patrick do comando do infantil Cometa Alegria, o programa deixou de ser ambientado em um planeta e passou a ser apresentado por Duda Little em um cenário simples.A, hoje jornalista, Maria Eduarda, havia alcançado sua fama na década de 1980 como a Duda Little, a repórter-mirim do Xou da Xuxa, após alguns filmes com a Rainha dos Baixinhos e uma participação no quadro “Trapa Hotel” no programa dos Trapalhões. Devido a simpatia na frente das câmeras e espontaneidade a menina acabou ganhando seu próprio programa na Tv Manchete.O Dudalegria, que ia ao ar de segunda a sexta-feira às 10 e meia da manhã, mostrava a apresentadora contando piadas para a boneca fofoqueira Miquilina e seu amigo espertalhão Manelzinho, que protagonizavam situações engraçadas na janela de sua casa.O programa era ambientado em uma Vila, onde Duda chamava convidados e apresentava desenhos animados.Mas talvez o infantil tenha ficado mais conhecido por ter sido o programa responsável pela estréia no Brasil do desenho Cavaleiros do Zoodíaco, o anime que se tornou uma verdadeira febre no início da década de 1990.Em junho de 1994 estréiam no programa mais duas séries japonesas que teriam boa repercussão por aqui, Patrine e Winspector.Em 1996, Duda prestou vestibular e decidiu sair da televisão para se dedicar aos estudos, enfim, à profissão dela de jornalista.http://infantv.com.br/dudalegria.htm Fonte: Wikipédia","pubDate":"Mon, 10 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/programas-infantis/dudalegria/","category":"programas infantis,nostalgia"},{"title":"Choushinsei Flashman","link":"https://nerdcalistenico.github.io/perfil/preferencias/tokusatsu/choushinsei-flashman/","description":"Título no Brasil: Comando Estelar FlashmanPrimeiro episódio: 1 de março de 1986Episódio final: 21 de fevereiro de 1987Número de temporadas: 1Emissora original: TV Asahi, All-Nippon News NetworkNúmero de episódios: 50Elenco: Yoko Nakamura Sara Sayoko Hagiwara Leh Näfel Mayumi Yoshida Lou Touta Tarumi Jin Kihachirō Uemura Dai Jo Ishiwatari BunChoushinsei Flashman (超新星フラッシュマン &#39;Chōshinsei Furasshuman&#39;, traduzido como Supernova Flashman e lançado no Brasil como Comando Estelar Flashman) é um seriado televisivo japonês do gênero tokusatsu, pertencente à franquia Super Sentai.Produzido pela Toei Company, foi exibido entre 1º de março de 1986 e 21 de fevereiro de 1987 pela TV Asahi. Estreou no Brasil em 6 de março de 1989 na Rede Manchete, onde ficou até 1992.A partir de 1º de Agosto de 1994 foi ao ar pela Rede Record, ficando até o final de 1995, com breves reprises em 1996. Mais tarde, começou a ser exibida na CNT, em 1997, onde permaneceu até o final daquele ano.Desde 2009, é exibida pela Ulbra TV de Porto Alegre e Rede Brasil de Televisão e atualmente, é exibido todas as segundas. Está sendo reprisado pela Tv Diário aos sábados pela manhã e diariamente substituiu Kamen Rider Black RX.Atualmente foi substituído por Changeman. Em 2020, a série passou a fazer parte do catálogo do serviço de streaming Amazon Prime. Ao todo, possui 50 episódios e 2 curta-metragens.HistóriaEm 1966, cinco crianças foram sequestradas por um grupo alienígena conhecido como Caçadores Espaciais sob as ordens do Império Mess, que queria amostras de terráqueos para seus experimentos biológicos.Essas crianças foram resgatadas pelo povo do Planeta Flash, inimigos do Império Mess, que as levaram a seu planeta. Lá, foram criadas e treinadas separadamente, uma no planeta Flash e as demais em cada uma das quatro luas do planeta, enfrentando as condições climáticas mais adversas, com a esperança de que algum dia pudessem derrotar o Império Mess e retornar à Terra para encontrar suas respectivas famílias.Vinte anos se passaram e os cinco jovens recebem a informação que o Cruzador Imperial Mess estaria justamente à caminho da Terra, com a intenção de invadir e conquistar seu planeta natal.Ao saberem disso, os cinco se reúnem no planeta Flash e, desobedecendo as ordens de seus tutores, invadem a Flash Nave e decolam rumo à Terra, para combater a ameaça do Império Mess e seu exército de mutantes.https://pt.wikipedia.org/wiki/Comando_Estelar_Flashman Fonte: Wikipédia","pubDate":"Mon, 10 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/tokusatsu/choushinsei-flashman/","category":"tokusatsu,nostalgia"},{"title":"Hannibal for King","link":"https://nerdcalistenico.github.io/perfil/preferencias/calistenia/hannibal-for-king/","description":"Instagram: @hannibalforking1Youtube: HannibalForKing1","pubDate":"Mon, 10 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/calistenia/hannibal-for-king/","category":"calistenia"},{"title":"NeuroVox (Pedro Calabrez)","link":"https://nerdcalistenico.github.io/perfil/preferencias/canais/neurovox/","description":"","pubDate":"Sun, 09 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/canais/neurovox/","category":"canais"},{"title":"Dinosaurs","link":"https://nerdcalistenico.github.io/perfil/preferencias/programas-infantis/dinosaurs/","description":"Título no Brasil: Família DinossaurosPrimeiro episódio: 26 de abril de 1991Episódio final: 19 de outubro de 1994Número de temporadas: 4Emissora original: ABCNúmero de episódios: 65Elenco: Kevin Clash Baby Sinclair Sally Struthers Charlene da Silva Sauro Stuart Pankin Earl Sinclair Jason Willinger Robbie Sinclair Jessica Walter Fran da Silva Sauro Sherman Hemsley Bradley P. Richfield Sam McMurray Roy HessDinosaurs (Família Dinossauros no Brasil e Os Dinossauros em Portugal), é uma série de televisão americana. Apesar de ser concebida como um programa infantil, faz uma crítica bem humorada ao chamado “american way of life” e uma sátira da sociedade e dos costumes da classe média desse país.Produzida pela Disney em parceria com a Jim Henson Productions - a qual concebeu os bonecos que representam os personagens - e a Michael Jacobs Productions, entre os anos de 1991 e 1994, a série trata das aventuras de uma família de dinossauros, a Família Silva Sauro (Sinclair, em inglês), que vive em uma sociedade dominada pelos grandes répteis, onde os humanos são animais selvagens.No Brasil, a série teve a sua primeira exibição pela Rede Globo em 1992, em seguida pelo SBT, e anos mais tarde foi exibido pela Rede Bandeirantes. A série reestreou no Canal Viva desde o dia 21 de agosto de 2014 às 22h e pelas manhãs, às 11h. Em Portugal, a série estreou no RTP 1 e uns anos mais tarde no Disney Channel.HistóriaA série se passa em 60.000.003 a.C. em Pangea e é centrada na família Silva Sauro (Sinclair no original): O pai Dino da Silva Sauro (Earl Sinclair no original), a mãe Fran da Silva Sauro, seus três filhos (Bob, Charlene e Baby) além da mãe de Fran, Zilda (Ethyl no original).O trabalho de Dino é derrubar árvores para a Wesayso Corporation com seu amigo e colega de trabalho Roy Hess, onde eles trabalham sob a supervisão de seu chefe, Bradley P. Richfield.https://pt.wikipedia.org/wiki/Dinosaurs Fonte: Wikipédia","pubDate":"Sun, 09 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/programas-infantis/dinosaurs/","category":"programas infantis,nostalgia"},{"title":"Dengeki Sentai Changeman","link":"https://nerdcalistenico.github.io/perfil/preferencias/tokusatsu/dengeki-sentai-changeman/","description":"Título no Brasil: Esquadrão Relâmpago ChangemanPrimeiro episódio: 2 de fevereiro de 1985Episódio final: 22 de fevereiro de 1986Número de temporadas: 1Emissora original: TV Asahi, All-Nippon News NetworkNúmero de episódios: 55Elenco: Hiroko Nishimoto Haruki Hamada Hiryu Tsurugi Mai Ooishi Mai Tsubasa Kazuoki Takahashi Sho Hayate Shiro Izumi Yuma OzoraDengeki Sentai Changeman (電撃戦隊チェンジマン &#39;Dengeki Sentai Chenjiman&#39;) traduzido e lançado no Brasil como Esquadrão Relâmpago Changeman é uma série de televisão japonesa do gênero tokusatsu, parte da franquia dos Super Sentais. Produzida pela Toei Company, foi originalmente exibida pela TV Asahi entre 2 de fevereiro de 1985 e 22 de fevereiro de 1986, sucedendo Bioman e antecedendo Flashman.Fez grande sucesso em seu país de origem e marcou a história do tokusatsu no Brasil[2] quando foi exibido pela Rede Manchete entre 1988 até meados de 1994, e a partir do mesmo ano pela Rede Record e mais tarde pela CNT. A série completa foi lançada em VHS pela TV Manchete. Também foi exibida pela Rede Brasil. A série voltou a fazer sua reestreia na TV Diário no lugar de Flashman.Em 2015, a Sato Company conseguiu os direitos de exibição dos tokusatsus da Toei para serem exibidos via streaming, através do Prime Video, serviço da Amazon, junto com outras séries exibidas no Brasil, além da inédita GARO.Em 23 de março de 2020, Changeman volta para a tv aberta através da Bandeirantes, sendo exibido 2 episódios todo domingo às 10:30, dentro do bloco Mundo Animado.HistóriaPrevendo uma possível invasão de Gôzma ao planeta Terra, Sargento Ibuki, com a organização Defensores da Terra, reuniu um exército de recrutas e os treina arduamente na esperança de que cinco deles sejam banhados pela lendária Força Terrena (Earth Force), energia gerada pelo planeta em momentos que o planeta corre enorme perigo.Quando as tropas de Gôzma surgem e começam a invasão durante um desses treinamentos, atacam os recrutas e cinco deles durante a luta são finalmente banhados por uma poderosa e misteriosa energia: os poderes dos cinco animais lendários, dragão, grifo, pégaso, sereia e fênix transformando-os instantaneamente em Changeman.Passado a batalha, Ibuki lhes leva a base secreta dos Defensores da Terra e revela que já sabia com antecedência da invasão à Terra e que todo aquele treinamento era para fortalecer ao máximo o corpo de cada um para assim conseguir com que cinco deles recebessem a Força Terrena e se tornarem o Esquadrão Relâmpago Changeman.https://pt.wikipedia.org/wiki/Esquadr%C3%A3o_Rel%C3%A2mpago_Changeman Fonte: Wikipédia","pubDate":"Sun, 09 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/tokusatsu/dengeki-sentai-changeman/","category":"tokusatsu,nostalgia"},{"title":"Demi Bagby","link":"https://nerdcalistenico.github.io/perfil/preferencias/calistenia/demi-bagby/","description":"Instagram: @demibagbyYoutube: DemiBagbyWebsite: demibagbyfit.com","pubDate":"Sun, 09 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/calistenia/demi-bagby/","category":"calistenia"},{"title":"Me Poupe!","link":"https://nerdcalistenico.github.io/perfil/preferencias/canais/me-poupe/","description":"","pubDate":"Sat, 08 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/canais/me-poupe/","category":"canais"},{"title":"Sítio do Picapau Amarelo","link":"https://nerdcalistenico.github.io/perfil/preferencias/programas-infantis/sitio-do-picapau-amarelo/","description":"Título no Brasil: Sítio do Picapau AmareloPrimeiro episódio: 7 de março de 1977Episódio final: 31 de janeiro de 1986Número de temporadas: 10Emissora original: TVE, Rede GloboNúmero de episódios: 69 ou 1.550 capítulosElenco: Zilka Salaberry Dona Benta Encerrabodes de Oliveira Jacira Sampaio Tia Nastácia André Valli Visconde de Sabugosa Rosana Garcia Narizinho Júlio César Rodrigues Vieira PedrinhoSítio do Picapau Amarelo (1ª Versão) é a série de televisão infantil brasileiro, produzido pela Rede Globo de 1977 a 1986 em parceria com a TVE e o MEC, baseado na obra de Monteiro Lobato. Foi inspirada na primeira versão, exibida pela Rede Tupi entre 1952 e 1963.HistóriaDona Benta é uma velha senhora que vive no Sítio do Pica-Pau Amarelo, afastada da correria e do barulho da cidade grande. Com ela vivem Tia Anastácia, que cozinha quitutes para todos, e sua neta Lúcia, mais conhecida como Narizinho. Vivendo sozinha e tendo apenas as duas mulheres idosas como companhia, a menina cria um mundo de fantasias, no qual a personagem principal é a sua boneca Emília, feita por Tia Anastácia com restos de pano. Também vivem no sítio o velho Tio Barnabé e seus ajudantes Zé Carneiro e Malazarte, responsáveis pela manutenção do sítio.Um dia Narizinho conhece o Príncipe Escamado, soberano do Reino das Águas Claras, que por coincidência, fica localizado no ribeirão do sítio. O Príncipe fica encantado com a menina e a convida para conhecer seu reino. Lá, ela é apresentada aos mais proeminentes súditos, como a azeda Carochinha, responsável por administrar os contos de fada, e determinada a manter o Pequeno Polegar preso em seus livros. Também a Doutor Caramujo, um renomado cientista, que dá a Emília a pílula falante. Depois que ingere o remédio, Emília começa a falar e não para mais.Durante o período de férias escolares, Narizinho tem como companhia, seu primo Pedrinho, que estuda na cidade grande onde vive com sua mãe. O Menino também tem um amigo montado por tia Anastácia, o Visconde de Sabugosa, feito de uma espiga de milho velha, que também ganha vida. Por ter sido esquecido, por um bom tempo do meio dos livros, o Visconde adquiriu uma admirável sabedoria, tornando-se intelectual e cientista.No sítio do Pica-Pau Amarelo tudo é possível. A Fantasia se mistura com a realidade, fazendo parte do cotidiano da menina Narizinho e de seu primo Pedrinho. E são com personagens adultos que as crianças compartilham suas aventuras num mundo fantástico onde transitam a boneca Emília, o Visconde de Sabugosa, o Saci Pererê, a Cuca, a Iara e outros personagens fantasiosos.https://pt.wikipedia.org/wiki/S%C3%ADtio_do_Picapau_Amarelo_(1977) Fonte: Wikipédia","pubDate":"Sat, 08 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/programas-infantis/sitio-do-picapau-amarelo/","category":"programas infantis,nostalgia"},{"title":"Ultraman","link":"https://nerdcalistenico.github.io/perfil/preferencias/tokusatsu/ultraman/","description":"Título no Brasil: UltramanPrimeiro episódio: 17 de julho de 1966Episódio final: 9 de abril de 1967Número de temporadas: 1Emissora original: Tokyo Broadcasting System, Japan News NetworkNúmero de episódios: 39Elenco: Susumu Kurobe Shin Hayata Hiroko Sakurai Akiko Fuji Masanari Nihei Mitsuhiro Ide Sandayū Dokumamushi Daisuke Arashi Akiji Kobayashi Captain 'Cap' Toshio MuramatsuUltraman (ウルトラマン - Urutoraman) é uma série japonesa de tokusatsu que estreou em 1966. Foi o segundo seriado de TV exibido em cores na televisão japonesa. O sucesso de Ultraman foi tão grande que gerou uma franquia de séries e filmes que dura até hoje.É um acompanhamento de Ultra Q, embora não seja tecnicamente uma sequela ou spin-off. Tsuburaya Productions fez 39 episódios (40, incluindo o especial pré-estréia) que foram ao ar no Tokyo Broadcasting System (TBS) de 17 de julho de 1966 a 9 de abril de 1967. Sua estréia superou a classificação média estabelecida por Ultra Q e continuava subindo a cada semana, marcando o show como um sucesso.No Brasil, foi televisionada nos anos 70, 80, 1996 e 2001 pelas emissoras: TV Tupi, TV Record, TVS (atual SBT),TV Corcovado,Rede Bandeirantes, Rede Manchete e CNT. Na Tupi, foi exibida durante anos dentro do programa Clube do Capitão Aza, sendo uma das principais atrações. Em 1971, foi lançada a série Regresso de Ultraman, que foi nome para a versão brasileira de Ultraman Jack, que contava a história do seu alter-ego Hideki Go.Foi por essa época que o público brasileiro começou a confundir essa série com a do primeiro Ultraman. Ela alternava horário com o Ultraman de Hideki Goh, fazendo confusão, entre os telespectadores, com o de Hayata, dando a entender que se tratava do mesmo herói, o que não era verdade.Com o fechamento da Tupi, em 1980, a série voltou a ser exibida pela TVS e repetiu o sucesso. Por fim, sua última exibição data de 1986, sendo uma das atrações do programa de jogos eletrônicos TV POW, exibido nessa emissora e apresentado por Mara Maravilha e Charles Myara, entre outros.Em 1996,com uma nova dublagem feita pela BKS, a serie é lançada em Home Vídeo (em parte, pois só foram lançadas doze fitas) pela RESERVA/ Intermovies e nesse mesmo ano foi reprisada pela Rede Manchete com a nova dublagem, mas exibida por pouco tempo. Depois, em 2001, passou a ser exibida na CNT. Atualmente é exibida pela Ulbra TV de Porto Alegre e pela Rede Brasil de televisão, de São Paulo que é exibido todas as quartas. Em 2015 a Editora JBC anunciou o lançamento do mangá no Brasil.HistóriaUm alienígena vindo da Galáxia M-78 a bordo de uma cúpula vermelha, ao perseguir o monstro Bemular, choca-se com a nave do oficial Hayata da S.I.A. Hayata não suporta a gravidade dos ferimentos e morre. Para reparar o erro, o misterioso alienígena funde sua energia vital à de Hayata, trazendo-o de volta a vida e entregando-lhe a Cápsula Beta. Os feitos do Alien lhe deram poderes incríveis e agora Hayata pode se transformar em Ultraman para defender a Terra de qualquer ameaça.E assim Hayata vai derrotando diversos monstros e outros invasores e sempre mantém sua identidade secreta em sigilo. Em diversas batalhas, Ultraman acaba se deparando com os Baltans-Seijins, aliens poderosos que queriam dominar a Terra e voltariam a atacá-la diversas vezes.Uma vez enfrentou Zarabu-Seijin, um misterioso ser que queria dominar a Terra e colocar Ultraman contra a população. Para seu plano funcionar, ele escraviza astronautas que estavam a bordo de um foguete e aprisiona Hayata, transformando-se em um falso Ultraman. Depois de tentar muito, Hayata consegue se libertar e se transforma em Ultraman para enfrentar ZarabuSeijin.Entre essa e muitas batalha de destaque, Hayata consegue ser um herói e ter uma vida normal junto com seus amigos da S.I.A. Entre eles: o Capitão Muramatsu, Arashi, Ide e Akiko. Apesar disso, ele sempre tem restrição com todos e nada se sabe sobre sua vida pessoal.Por fim, Zeton-Seijin invade a Terra com um plano para exterminar Ultraman, que acaba sendo derrotado e morto. Vindo do espaço, surge Zoffy, um outro Ultra que aparece para resgatar Ultraman e levá-lo de volta a M-78, assim se separando de Hayata (este recebeu uma nova vida que Zoffy trouxera com ele).Hayata voltou a aparecer se transformando em Ultraman como convidado nas séries O Regresso de Ultraman (1971), Ultraman Taro (1973) e Ultraman Mebius (2007). Na década de noventa, Ultraman também fez uma ponta num dos capítulos finais de Ultraman Tiga. No cinema, Hayata apareceu nos longa-metragens Ultraman Mebius &amp; Ultraman Brothers (2006), Dai Kessen e Chou Ultra Hachi Kyodai (2008).https://pt.wikipedia.org/wiki/Ultraman Fonte: Wikipédia","pubDate":"Sat, 08 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/tokusatsu/ultraman/","category":"tokusatsu,nostalgia"},{"title":"Lazar Novovic","link":"https://nerdcalistenico.github.io/perfil/preferencias/calistenia/lazar-novovic/","description":"Instagram: @lazarnovovicYoutube: LazarNovovic","pubDate":"Sat, 08 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/calistenia/lazar-novovic/","category":"calistenia"},{"title":"July 2020","link":"https://nerdcalistenico.github.io/perfil/dailylog/2020/jul/","description":"JulyDay 01Day 02pj-gh Mythological Alliancepb-ws Dia 1/2019 - Smile com CSSDay 03pj-gh Mythological Alliancepj-gh HachimanDay 04pj-gh Hachimanpb-ws Dia 2/2019 - Cartão com CSS hoverDay 05ar How to write and build JS libraries in 2018ar How to publish JavaScript Librariesar Create Your Own React Library in 2020: Step by Stepar Master UX with React in 2020: Four Ways to Upgrade Your React App User ExperienceDay 06ar How To Reverse Engineer Websitesar Web Architecture 101ar Two years of micro-frontends: A retrospectivepb-ws Dia 3/2019 - Pacman LoaderDay 07ar Arquitetura de projetos Vue.js com DDDar Senior designers, you’re not junior enoughar 25 Cognitive Biases every UX Designer should knowar I Got Rejected by Apple Music… So I Redesigned Itpb-ws Dia 4/2019 - Smartphone com transição para a esquerdaDay 08ar UI cheat sheet: pagination, infinite scroll and the load more buttonar 47 Key Lessons for UI &amp; UX Designersar Spotify in Neumorphismar Distributed Ownershipar Selection controls — UI component seriesar 8 rules to help you design a better card user interfacepb-ws Dia 5/2019 - Bússola com CSSDay 09ar NPM Tips and Tricksar How is UI/UX the heart of a clean front end?ar Understanding WeakMaps in JavaScriptar Introducing Storybook Argsar You don’t need to solve problems twice — you need a design systemar 5 mistakes frontend developers commit that UX engineers hatepb-ws O ano dos desafiosDay 10ar Liderança na pandemiaar Are “you” designing for your users?ar How to Create a High-Fidelity Prototype and Export HTML with Figmaar Designing a Mobile Platformar Estourando a bolha: um relato sobre uma pesquisa imersiva em cidades remotas do Brasilar Can a Product Fail due to Innovation Overkill?pb-ws Ações recomendadas para Julho/2020pb-ws Dia 6/2019 - Gráfico de barrasDay 11ar React: SVG Stroke Animation with CSS Explainedar Better Reusable React Components with the Overrides Patternar The Ultimate VSCode Setup for Front End/JS/Reactpb-ws Dia 7/2019 - Filtro de dadosDay 12ar Asynchronous Functional Programming Using React Hooksar 5 Micro libraries to elevate any React JS projectar How To Use an IntersectionObserver in a React Hookar Progressively Loading Images In Reactpb-ws Dia 8/2019 - Menu circularDay 13ar State Management with React Hooks — No Redux or Context APIar Passing Elements as Props in Reactar React TypeScript: Basics and Best Practicespb-ws Dia 9/2019 - Jogo de alvoDay 14ar Flipper — A React Native revolutionar Testing React with Jest and Enzyme Iar 11 Useful Custom React Hooks for Your Next Web Appar Building a JavaScript Monorepo with Lernapb-ws Dia 10/2019 - Calendário com CSS GridDay 15ar Making Sense of React Hooksar 5 Ways to animate a React app.ar JavaScript: async/await with forEach()ar Forms with Formik + TypeScriptar Making API Calls with React Hookspb-ws Dia 11/2019 - Carrossel com autoplayDay 16ar Addressing the iOS Address Bar in 100vh Layoutsar Customize webpack configuration of React App created with Create-react-appar Using the React useContext Hookpb-ws Dia 12/2019 - Slider com CSSDay 17ar Centralizing API error handling in React appsar Understanding npm-linkpb-ws Dia 13/2019 - Texto com efeito neonDay 18ar Sorry React, but I can’t keep up anymorear React: Rendering using Concurrent Mode and Suspensear Exploit React Error Boundaries to Improve UXar 3 Essential Tools to Boost your React App’s SEOpb-ws Dia 14/2019 - Tabela responsivaDay 19ar Handling Time Zone in JavaScriptar Why I no longer use D3.jsar 5 Recommended Tools for Optimizing Performance in ReactJSpb-ws Dia 15/2019 - Botão com efeito de ondulaçãoDay 20ar Using JWT in Your React+Redux App for Authorizationar React Hooks — How To Use useState and useEffect Examplear Flexible Icons with React and SVGar React Hook Form VS Formikar Understanding Ref Forwarding in Reactar Keep Your Promises in TypeScript using async/awaitpb-ws Dia 16/2019 - Efeito de deslizar na barra de abasDay 21ar Gatsby: Fetching Data at The Component Level with useStaticQueryar Sharing React Widgets Between Appsar Understanding ES Modules in JavaScriptar Selecting the Right Tool for Your Monorepoar How to Publish React Componentspb-ws Dia 17/2019 - Acordeão animadoDay 22ar Theming React Components with CSS Variablesar How to Share React UI Components between Projects and Appsar Microfrontends — should I care?pb-ws Dia 18/2019 - Texto com animação de ondapb-ws Trinity NovaDay 23ar Os 4 Hábitos Que Tornam Você Um Programador Ineficientear Programação: Devo Estudar o Que Gosto ou Focar no Que o Mercado Está Pedindo?ar Checklist do Programador Sênior: 10 Itens Para Você Ser um Programador MUITO Acima da Médiaar Como Ter as Melhores Ideias Para Programar? (De Onde Tirar Ideias de Programas Para Desenvolver ou Treinar Programação?)pb-ws Dia 19/2019 - Efeito de girar o cartãoDay 24ar Have You Mastered These 9 Vue Techniques?ar Scraping Amazon.com using JavaScript and Node.jsar 11 Useful Custom React Hooks for Your Next Web Appar Advanced TypeScript Types with Examplespb-ws Dia 20/2019 - Interruptor customizadoDay 25ar Is Monorepo for You? — 2020ar Understanding WeakMaps in JavaScriptar Styled-JSX for React: How and Whypb-ws Dia 21/2019 - Tooltip com aria-labelDay 26ar HTTPS: an awesome, secure tale (pt 1)ar React Router VS Reach Routerar Understanding WebGLar Start Collecting Feedback from Users across Your React Apps with Feeder.shar 5 Simple Way of Writing Optimized JavaScript Codepb-ws Dia 22/2019 - Animação em menu de redes sociaisDay 27ar Checking for Available Permissions in Denoar Packaging a UI Library for Distributionar 14 JavaScript Code Optimization Tips for Front-End Developersar Why Using Tokens and Cookies Together is Better for Web App Securitypb-ws Dia 23/2019 - Efeito ParallaxDay 28ar First UI Kit for the latest Twitter’s Bootstrap 5ar Design Systems: React Buttons with the Base + Variant Patternar Securely Upload Files Directly from Browser to Amazon S3pb-ws Dia 24/2019 - Formulário simplesDay 29ar A Web Developer’s Roadmap to Learning React Nativear 8 Performance Analysis Tools for Front-End Developmentar Top 5 React Table Librariesar 5 Service Worker Caching Strategies for Your Next PWA Appar Revolutionizing Micro Frontends with Webpack 5, Module Federation and Bitpb-ws Dia 25/2019 - Experimento com input do tipo colorDay 30ar 6 Top GraphQL Clients for 2020ar How to Develop Microfrontends Using React: Step by Step Guidear Data Structures You Should Know as a JavaScript Developerar How and Why You Should Use React Queryar Improving Google PageSpeed Score using Code-Splittingpb-ws Dia 26/2019 - Galeria com ModalDay 31ar Getting Content Painted under 2 seconds on the Mobile Webar How to Add Color to SVG Icons and Elements With CurrentColorar Beam Me Up, Scotty — On Teleporting Templates in Angularar Data Structures You Should Know as a JavaScript Developerar 5 Ways Service Workers Reshape Modern Web Appsar Importance of using JavaScript Telemetry for Single Page Appspb-ws Dia 27/2019 - Jogo de matar moscas","pubDate":"Sat, 01 Aug 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/dailylog/2020/jul/","category":"dailylog"},{"title":"Canal do Cortella","link":"https://nerdcalistenico.github.io/perfil/preferencias/canais/canal-do-cortella/","description":"","pubDate":"Tue, 07 Jul 2020 19:20:00 GMT","guid":"https://nerdcalistenico.github.io/perfil/preferencias/canais/canal-do-cortella/","category":"canais"}]}
