{"title":"Nerd Calistênico","description":"","language":"pt-br","link":"https://nerdcalistenico.github.io/saborinstintivo","pubDate":"Sun, 21 Jul 2019 18:20:00 GMT","lastBuildDate":"Wed, 19 Aug 2020 12:21:26 GMT","webMaster":"Sabor instintivo","items":[{"title":"Doce de banana com creme inglês","link":"https://nerdcalistenico.github.io/saborinstintivo/receitas/doce-e-sobremesa/doce-de-banana-com-creme-ingles/","description":"A banana é uma fonte muito rica de potássio, manganês, vitamina C, cobre e vitamina B6. A banana d’água também como banana nanica, é o tipo mais popular no Brasil. Cada porção tem 98 kcal e 373 mg de potássio, e tem propriedades laxantes.InformaçõesPreparo: 30 minRendimento: 12 porçõesIngredientesBanana em calda12 bananas d’água maduras500g de açúcar700ml água mornaCreme150ml leite condensado300ml leite6 gotas baunilha4 gemas2 colher de sopa de amido de milhoCanela em pó a gostoModo de preparoBanana em caldaEm uma panela média coloque o açúcar e deixe corar no fogão, em fogo baixo. Assim que corar por completo, mexa lenta e continuamente até o açúcar virar uma calda caramelo.Em seguida, coloque a água morna . Continue mexendo lentamente por mais uns 5 minutos.Adicione a banana cortada em rodelas e deixe cozinhar e pegar cor, sem mexer muito para não quebrar.Reserve e deixe esfriar.CremeEm outra panela, coloque o leite, o leite condensado e as gotas de baunilha e o amido de milho. Mexa até dissolver todo o amido de milho na mistura.Acrescente as gemas e bata com um batedor até que a mistura fique novamente homogênea e leve agora ao fogo, em temperatura baixa. Mexa até engrossar.Quando começar a engrossar retire do fogo .Considerações finaisUma dica para enfeitar mais antes de servir, seria colocar alguns pedaços da banana caramelada em potinhos, de preferência de vidro, e acrescente sobre os mesmos um pouco do creme ainda quente e polvilhe a canela para finalizar.","pubDate":"Sun, 21 Jul 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/saborinstintivo/receitas/doce-e-sobremesa/doce-de-banana-com-creme-ingles/","category":"doce e sobremesa"},{"title":"Brownie com nozes e cobertura de nutella","link":"https://nerdcalistenico.github.io/saborinstintivo/receitas/doce-e-sobremesa/brownie-com-nozes-e-cobertura-de-nutella/","description":"Brownie é uma sobremesa de chocolate típico da culinária dos Estados Unidos e pode considerar-se um bolo feito num tabuleiro para bolos e partido em pequenos quadrados.InformaçõesPreparo: 60 minRendimento: 10 porçõesIngredientesmassa250g de farinha de trigo200g de açúcar refinado200g de açúcar mascavo200g de manteiga100g cacau em pó90g de chocolate amargo em barra90g de chocolate ao leite em barra1/2 de colher de sopa de bicarbonato de sódio5 gostas de essência de baunilha4 ovos100g de nozes picadasCobertura280g de creme de avelã3 colheres de sopa de chocolate em pó2 colheres de sopa de cacau em pó100g de manteiga sem sal200g de leite em pó200g de creme de leite1 colher de sopa rasa de emulsificante para sorveteModo de preparomassaNa batedeira, misture bem os ovos com os ingredientes secos.Derreta o chocolate em banho-maria com a manteiga e junte aos ovos batidos, mexendo até incorporar bem.Ponha em fôrma untada e coberta com papel-manteiga, também untado com um pouco de manteiga.Leve ao forno preaquecido, a 180°C, por aproximadamente 25 minutos ou até que esteja no ponto, crocante por cima e úmido por dentro.CoberturaNa batedeira, bata a manteiga.Acrescente o restante dos ingredientes e bata até ficar homogêneo.Coloque no bolo ainda quente.Não precisa aquecer, apenas misturar bem.Considerações finaisEssa receita sempre me deixa em dúvida, pois o mesmo segue a ideia de um bolo solado. A massa não pode ficar muito alta, para não parecer um bolo. Acredito que é o tipo de receita que vai aprimorando a cada vez que faz. Até hoje só fiz 2 vezes na vida. Bownie agrada à todos e na maioria das vezes que encontramos nas lojas, tem um preço bem alto. Portanto, vale uma tentativa caseira.. :)","pubDate":"Sat, 20 Jul 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/saborinstintivo/receitas/doce-e-sobremesa/brownie-com-nozes-e-cobertura-de-nutella/","category":"doce e sobremesa"},{"title":"Cheesecake de maracujá - Light e sem forno","link":"https://nerdcalistenico.github.io/saborinstintivo/receitas/doce-e-sobremesa/cheesecake-de-maracuja/","description":"O cheesecake é um alimento doce muito popular nos Estados Unidos. Originalmente naquele país, tratava-se de um torta doce de queijo cremoso e calda de frutas vermelhas, mas diversas outras variações da receita foram criadas no mundo, inclusive salgadas.InformaçõesPreparo: 60 minRendimento: 12 porçõesIngredientesMassa1 xícara de farinha de amêndoas3 colheres (sopa) de manteiga geladaRecheio450g de cream cheese light200g de leite condensado - zero adição de açúcares2 limões sicilianos200g de creme de leite light1 pacote de gelatina em pó incolor e sem sabor (12 g)50ml de água para hidratar a gelatinaCobertura3 maracujás200ml de água1 pacote de gelatina sabor maracujá - zero açúcar (12 g)1 pacote de gelatina em pó incolor e sem sabor (12 g)50ml de água para hidratar a gelatinaModo de preparoMassaMisture a farinha de amêndoas com a manteiga até ficar uma farofa úmida, abra numa forma com fundo removível e leve ao forno por 10 minutos e reserve.RecheioEm um recipiente coloque a gelatina em pó incolor e os 50ml de água para hidratarEm um Bowl ou batedeira, bata bem o cream cheese até ficar bem aveludadoAdicione o o creme de leite e o leite condensado, continue batendo até ficar homogêneo.Agora resta adicionar o suco do 2 limões.Restando apenas adicionar a gelatina em pó incolor hidratada. Adicione e continue batendo para continuar homogêneo.Agora despeje o recheio sobre a massa.Coloque o cheesecake na geladeira para firmar, coberto com filme plástico. Cerca de 1h.Após passar uns 40 min, comece a fazer a coberturaCoberturaVamos repetir o processo de hidradatação da gelatina em pó incolor e os 50ml de água em um recipienteLeve uma panela ao fogo com os 200ml de água e a polpa dos 3 maracujásConforme for mexendo adicione o pacote de gelatinaAdicione a gelatina em pó incolor hidratada. Mexa para misturarEspere esfriar por uns 3 minutosRetire a forma com o recheio da geladeira e despeje essa coberturaLeve novamente a forma para a geladeira para firmar, coberto com filme plásticoEspere umas 4h e estará proto para servir.Considerações finaisAqui temos mais uma receita de cheesecake sem forno, mas agora mais light. Para mim que não sou chegado muito ao gosto doce, essa é uma boa receita. E também tem a vantagem que não vem com muita culpa. Não tem como dizer que é 0 o açúcar, mas agrada sem preocupação quem precisa maneirar no açúcar. A quantidade de maracujá na cobertura também pode variar para menos. Como a maioria das pessoas sabem, essa fruta não vai te deixar sem sono, pelo contrário. :)","pubDate":"Wed, 10 Jul 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/saborinstintivo/receitas/doce-e-sobremesa/cheesecake-de-maracuja/","category":"doce e sobremesa"},{"title":"Purê de batata com cream cheese","link":"https://nerdcalistenico.github.io/saborinstintivo/receitas/acompanhamento/pure-de-batata/","description":"O purê ou puré é uma designação para alimentos cozidos - geralmente vegetais, legumes ou frutas - que foram moídos, prensados, misturados, e/ou peneirados para obtenção de uma pasta cremosa de consistência macia ou líquido espesso.InformaçõesPreparo: 30 minRendimento: 5 porçõesIngredientes1 kg de batata1 colher de sopa de manteiga150 gr de cream cheese1 xícara (chá) de leite1/2 xícara (chá) de parmesão2 colheres de sopa de azeitesal a gostoModo de preparoCozinhe as batatas, descasque-as e passe-as pelo espremedor de legumes.Alternativa: Descasque-as, corte-as em rodelas, cozinhe e as amasse com uma colher de pau.Em uma panela coloque a manteiga e a derreta.Adicione a batata, o leite e metade do cream cheese.Mantenha em fogo baixo e misture bem os ingredientes.Agora adicione o sal a gosto.Acrescente a outra metade do cream cheese e misture.Adicione o azeite, ao ficar cremoso misture o queijo parmesão.SirvaConsiderações finaisEssa receita é extremamente simples. Sempre gostei muito de purê de batata, mas só recentemente venho experimentando com cream cheese. Antes sempre era apenas com leite e manteiga. O grande diferencial é que fica mais cremoso e com uma boa consistência.Um acompanhamento muito bom que vale a pena está na sua mesa.","pubDate":"Tue, 09 Jul 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/saborinstintivo/receitas/acompanhamento/pure-de-batata/","category":"acompanhamento"},{"title":"Cheesecake de Kiwi - Sem forno","link":"https://nerdcalistenico.github.io/saborinstintivo/receitas/doce-e-sobremesa/cheesecake-de-kiwi/","description":"O cheesecake é muito popular nos Estados Unidos. Trata-se de um torta doce de queijo cremoso e calda de frutas vermelhas, mas diversas outras variações da receita foram criadas no mundo, inclusive salgadas.InformaçõesPreparo: 60 minRendimento: 16 porçõesIngredientesMassa200g de biscoito maisena100g de margarina50g de açúcarRecheio1 pacote de gelatina em pó incolor e sem sabor (12 g)50ml de água para hidratar a gelatina900g de cream cheese, temperatura ambiente200ml de creme de leite;395g de leite condensado200g de açúcar brancoSuco de 2 limões sicilianos (um pouco das raspas também)3 kiwisCobertura4 kiwis100g de açúcar200ml de água1 pacote de gelatina em pó incolor e sem sabor (12 g)50ml de água para hidratar a gelatinaModo de preparoMassaTriture no multiprocessador os biscoitos até formar uma farinhaAdicione o açúcar e a manteiga derretidaEm uma forma com fundo removível pressione essa massa uniformemente sobre o fundo. Cubra e reserve enquanto faz o recheio.RecheioEm um recipiente coloque a gelatina em pó incolor e os 50ml de água para hidratarEm um Bowl ou batedeira, bata bem o cream cheese até ficar bem aveludadoAdicione o açúcar e continue batendo até ficar homogêneo. Faça a mesma coisa com o creme de leite e o leite condensadoAgora resta adicionar o suco do 2 limões com um pouco de raspas se preferir.Restando apenas adicionar a gelatina em pó incolor hidratada. Adicione e continue batendo para continuar homogêneoCom os 3 kiwis descascados e cortados em rodelas, só colocar nas laterais da forma, para ficar como a imagem no topo dessa receitaAgora despeje o recheio sobre a massa.Coloque o cheesecake na geladeira para firmar, coberto com filme plástico. Cerca de 1h.Após passar uns 40 min, comece a fazer a coberturaCoberturaVamos repetir o processo de hidradatação da gelatina em pó incolor e os 50ml de água em um recipienteLeve uma panela ao fogo com os 200ml de água e os 4 kiwis cortados em cubos (deixe duas rodelas de kiwi para decorar depois)Conforme for mexendo adicione o açúcarApós uns 10 min mexendo, os cubos já estarão quase brancos, perdendo a colocaração verdeDesligue o fogo e use uma peneira para obtiver apenas o líquido e as sementes em um recipienteE adicione a gelatina em pó incolor hidratada. Mexa para misturarEspere esfriar por uns 3 minutosRetire a forma com o recheio da geladeira e despeje essa cobertura (antes coloque as duas rodelas no centro para ficar igual a imagem)Leve novamente a forma para a geladeira para firmar, coberto com filme plásticoEspere umas 4h e estará proto para servir.Considerações finaisNão estamos na época de morangos, abacaxi e está começando a época de maracuja. Não vi muitas outras opções de frutas para comprar no super mercado. Então, fui querer ver como ficava a mistura de kiwi com limão siciliano.Estava na dúvida como seria o título, mas deixo o Kiwi como destaque até para não confundir. A cobertura fica amarela, mas não é por causa do limão, é apenas kiwi. O limão está apenas no recheio. E foi uma alegria acertar na quantidade, para não ficar enjoativo. Minhas cobaias disseram que estava bom e até eu que não sou tão chegado a doce, gostei.Fica aqui a dica de uma boa sobremesa. E tem como característica de não precisar ir ao forno (em inglês: no-bake cheesecake). Então é bem tranquilo de fazer, sem mistério.","pubDate":"Mon, 24 Jun 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/saborinstintivo/receitas/doce-e-sobremesa/cheesecake-de-kiwi/","category":"doce e sobremesa"},{"title":"Gratinado de batata e carne","link":"https://nerdcalistenico.github.io/saborinstintivo/receitas/prato-principal/gratinado-de-batata-e-carne/","description":"Gratinado é uma técnica culinária difundida em que um ingrediente é coberto com uma crosta dourada, muitas vezes usando pão ralado, queijo ralado, ovo ou manteiga. Gratinado originou na cozinha francesa e é geralmente preparado em um prato raso de algum tipo.InformaçõesPreparo: 60 minRendimento: 10 porçõesIngredientes6 batatas grandes1,3kg de carne moída (receita feita com acém)1 cebola200g de muçarelaSalsinha a gostoSal a gostoModo de preparoBasta misturar a carne moída com a cebola picada, a salsinha picada e o sal. Reserve.Cozinhe as batatas em água com salCom as batatas cozidas, corte em rodelas e cubra a base e laterais da asssadeira de vidro.Faça bolas de carne e coloque uma sobre cada rodela de batata.Adicione rodelas de batata entre as bolas de carne e adicionar o molho bechamel sobre as bolas de carne.Adicione a muçarela e leve ao forno por 30 minutos ou até o queijo dourar em cerca de 220 °C.Sirva.DicasVeja como fazer o molho bechamel.A quantidade de batatas e de carne podem variar de acordo com o tamanho da assadeira que tenha disponível.Considerações finaisNão tem muito mistério nesse prato, sendo bem tranquilo de fazer. Requer mais paciência para ficar de olho nas batatas enquanto cozinham e no forno na etapa final.Com toda a certeza não tem nada de fit. Exemplo:Temos aqui umas 190 calorias por cada 100g de carne moída;Por volta de 100 calorias em cada 30g de muçarela;Mais ou menos 77 calorias a cada 100g de batata cozida;Então fica aqui uma boa refeição para quebrar a rotina e enfiar o pé na jaca, quando se trata de dieta. E não se esqueça do acompanhamento.","pubDate":"Sun, 23 Jun 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/saborinstintivo/receitas/prato-principal/gratinado-de-batata-e-carne/","category":"prato principal"},{"title":"Molho bechamel","link":"https://nerdcalistenico.github.io/saborinstintivo/receitas/molho/molho-bechamel/","description":"O molho bechamel, do francês béchamel é um molho que se obtém cozinhando farinha de trigo em manteiga e depois diluindo essa mistura com leite. Deve ter coloração marfim, aparência de creme e sabor sem gosto de farinha crua. Depois de cozido, deve ser temperado de acordo com os alimentos que vai acompanhar.InformaçõesPreparo: 15 minIngredientes3 colheres de sopa de manteiga3 colheres de sopa de farinha de trigo750ml de leiteSal a gostoPimenta do reino a gostoModo de preparoDerreta a manteiga em uma panela.Adicione a farinha de trigo e mexa por dois minutos até dourar levemente.Retire a panela do fogo e comece a bater sem parar, usando um batedor de arame (fouet), enquanto adiciona o leite aos poucos.Retorne a panela para o fogão, aumente a temperatura e continue mexendo até ferver.Abaixe o fogo, tempere e deixe cozinhar por volta de 10 minutos, mexa a cada dois minutos até engrossar um pouco, mas tendo a consistência mais líquida.DicasPara mexer o molho, use batedor de arame (fouet), para que o molho fique mais homogêneo e liso.Se o seu molho empelotar, deixe amornar e bata no liquidificador até ficar liso.Se quiser um molho mais denso, aumente a quantidade de farinha de trigo.O molho bechamel, também conhecido por molho branco, é muito versátil e pode ser acrescido de bacon frito em cubos, brócolis ou espinafre cozido e picado e muitos outros vegetais.A proporção é 1 xícara de chá (250ml) de leite para 1 colher de sopa de manteiga e 1 colher de sopa de farinha. Então, se for diminuir ou aumentar a quantidade, siga essa proporção.Se não for usado imediatamente, retire-o do fogo e deixe amornar levemente. Em seguida, passe sobre a superfície um pedaço de manteiga espetado em um garfo. Assim, evita-se a formação de uma película dura na superfície do molho. Quando o molho estiver completamente frio, cubra a panela com filme plástico e coloque na geladeira.Considerações finaisPara se ter mais sabor, você pode usar cravo da índia, noz-moscada e cebola. Cozinhe todos os ingredientes até que a mistura fique cremosa. Depois, é só utilizá-lo no macarrão, lasanha, gratinado ou prato que achar adequado esse molho.","pubDate":"Sun, 23 Jun 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/saborinstintivo/receitas/molho/molho-bechamel/","category":"molho"},{"title":"Macarrão e o carboidrato","link":"https://nerdcalistenico.github.io/saborinstintivo/receitas/acompanhamento/macarrao-e-o-carboidrato/","description":"O grande vilão no prato de macarrão está no molho. Enquanto, 200g de massa de macarrão tem por volta de 282 calorias, 20g de queijo parmesão ralado acrescentam mais 91 calorias.Segundo especialistas, para esportes de longa duração, como maratonas, é importante haver um alto consumo de massas. Os carboidratos presentes no alimento são transformados em glicogênio e sendo estocados dentro do corpo, fornecem a energia necessária para aguentar o percurso.Para esses atletas, a quantidade de carboidratos consumidos antes do treino deve ser maior em relação ao total de proteínas e legumes presentes na refeição.Após o treino é importante consumir uma porção de macarrão combinada com alguma proteína magra. Isso porque, de acordo com os especialistas, a proteína está diretamente relacionada com a formação e reposição muscular, importante para os atletas.InformaçõesPreparo: 30 minIngredientes200gr de macarrão Aletria (cabelo de anjo)100gr de queijo ralado2 colheres (sopa) de manteiga2 dentes de alho1/2 cebola picada2 folhas de louro2 gomos de calabresa4 colheres (sopa) de molho de tomateSal à gostoErvas finas2 colheres (sopa) de creme de leiteModo de preparoPara a massa de macarrão não tem mistério.Leve ao fogo uma panela com água e sal, para cozinhar o macarrãoEspere ferver e acrescente a massa de macarrãoA aletria não pode ficar muito tempo cozinhando. Mexa para que os ninhos se soltem. Isso tem que ser rápido porque o tempo total de cozimento não pode ultrapassar 1 minuto.Mesmo que não parecça cozido, retire a panela do fogo entre 30 segundos e 1 minuto de cozimento.Costumo soltar a massa rápido e tirar logo em seguida, isso não chega a 1 minuto.Escorra o macarrão.Deixe um pouco de água, para a massa não secar e grudar. Ou se preferir, só lavar o macarrão na água fria, mas como prefiro o macarrão quente e não gosto de deixar isso na responsabilidade do molho, prefiro deixar a água do cozimento (e cozinha mais a aletria).Para o molho, o ideal é que ele esteja pronto antes de cozinhar a massa e que não esteja quente (nem gelado).O molho é bem simples, só juntar os ingredientes em uma panela e levar ao fogo. Corte a calabresa em rodelas e cozinhe à parte ou cozinhe com esses temperos e um pouco de água. Na foto que está no início desse artigo, cozinhei a calabresa junto com o molho. Mesmo tendo feito dessa forma, aconselho cozinhar à parte. O molho não fica tão encorpado, por causa da água e gorduroso por causa da calabresa.Para finalizar é só juntar os dois e saborear.ConclusãoSe tem vários tipos de macarrão. Escolhi a aletria porque ela cozinha muito rápido. Pra quê, miojo?? :) E por ser mais fina que a massa de espaguete, acho mais saborosa e mais leve. (impressão que dá).","pubDate":"Sun, 04 Sep 2016 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/saborinstintivo/receitas/acompanhamento/macarrao-e-o-carboidrato/","category":"acompanhamento"},{"title":"Arroz e seus incrementos","link":"https://nerdcalistenico.github.io/saborinstintivo/receitas/acompanhamento/arroz-e-seus-incrementos/","description":"Não se tem muito mistério em fazer o arroz. A única questão que devemos ficar atentos, é que ele não vire um mingau e fique bem solto. Abaixo, nas observações, vou informar o que faço, para ficar no ponto.InformaçõesPreparo: 30 minIngredientes2 xícaras (chá) de arroz branco4 xícaras (chá) de águasalalhocebolaModo de preparoLave o arroz, utilizando o escorredor próprio para esse fimPrepare o tempero com sal, cebola e alho.Leve o tempero ao fogo em uma panela e deixe dourarAdicione o arroz e complete com águaDeixe ferver até o os grãos estarem cozidosObservaçõesDica para deixar solto - Após o tempero dourar, antes de colocar o arroz, coloco 1 “dedo” de água para ferver com o tempero. Só depois adiciono o arroz.Quantidade de água - As medidas são mais para o fator didático, pois sempre vou com a mesma lógica, independente da quantidade de arroz e tamanho da panela. Então, após adicionar o arroz, coloco água, até fica 1 “dedo” acima do nível do arroz.IncrementosO arroz te dá várias possibilidades para incrementar, como : ervilha, passas, batata, lentilha, presunto, cenoura e mais. E tubérculos como a batata ou os legumes como a abóbora, é só cozinhar à parte e depois adicionar na hora do cozimento do arroz. Então, não há mistério.ConclusãoPortanto, lave bem o arroz, não utilize água fria no processo e não esqueça dele no fogo. Assim, terá um bom arroz, para servir e comer. :)","pubDate":"Fri, 06 May 2016 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/saborinstintivo/receitas/acompanhamento/arroz-e-seus-incrementos/","category":"acompanhamento"},{"title":"Feijão - Fonte de proteínas","link":"https://nerdcalistenico.github.io/saborinstintivo/receitas/acompanhamento/feijao-fonte-de-proteinas/","description":"Na cozinha brasileira não pode faltar o feijão. Além de ser um acompanhamento tradicional, tem vários benefícios como: prevenção de câncer, função cerebral, açúcar no sangue, desintoxicação, saúde do aparelho digestivo, fonte de energia e rico em proteínas.Ao preparar o feijão, devemos ter muito cuidado ao lidar com a panela de pressão. Portanto, tenha o cuidado de não exagerar ao colocar água demais. Muita pressão, pode fazer um estrago na sua cozinha.Abaixo, coloco uma estimativa de 2 litros de água para uma panela de pressão de 4,5 litros. Para uma segurança visual, costumo me basear na marca dos parafusos, dentro da panela de pressão. No caso, vejo se a água e o feijão estão a 2 dedos abaixo da marca. Podemos seguir também a recomendação do fabricante, só seguir o manual.InformaçõesPreparo: 50 minPanela de pressão: 4,5LIngredientes500g de feijão2L de águasalalhocebolalouro em póModo de preparoEscolha o feijãoLave o feijãoEncha a panelão de pressão com a água e feijãoDeixe cozinharA partir do momento que começar a fazer barulho com a saída do ar, espere cozinhar de 30 a 40 minutosDepois desligar e esperar todo ar sairPrepare o tempero com sal, alho, cebola e o louroColoque o tempero em uma panela e doureAcrescente um pouco do feijão cozido e misture para pegar o temperoNessa etapa, você pode optar por juntar ao restante do feijão ou congelar o restante sem tempero. Por uma questão de ser mais prático, eu tempero tudo e congelo. Assim, é só separar em vasilhas e guardar no congelador ou na geladeira perto do congelador.ObservaçõesA receita acima, se refere a um feijão básico. Podemos incrementar de várias formas, como: acrescentar carne seca e/ou outros tipos de carne na etapa do cozimento. Particurlamente, prefiro carne seca. :)Também podemos brincar com o processo, como colocar uma lata de leite condensado. Quando acabar o cozimento, teremos uma lata de doce de leite. :)ConclusãoDepois de algum tempo, o preparo é automático e a sensação é diferente de quando ainda se é iniciante na cozinha. Agora é só saborear o feijão. :)","pubDate":"Wed, 27 Apr 2016 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/saborinstintivo/receitas/acompanhamento/feijao-fonte-de-proteinas/","category":"acompanhamento"},{"title":"Pavê de Prestígio","link":"https://nerdcalistenico.github.io/saborinstintivo/receitas/doce-e-sobremesa/pave-de-prestigio/","description":"Decidi inaugurar o blog com essa receita, por ser de nível fácil e por ser a mais pedida pelos familiares, principalmente as crianças.InformaçõesPreparo: 50 minRendimento: 12 porçõesIngredientesCamada de coco500 ml de leite1 lata de leite condensado200 ml de leite de coco4 colheres(sopa) de amido de milho100g de coco ralado1 caixa(200g) de creme de leiteCamada de chocolate1 pacote de bolo pronto de chocolate300g de chocolate ao leite(barra)DecoraçãoCoco raladoChocolate granuladoCerejaModo de preparoCamada de cocoJunte em uma panela o leite, o leite condensado, o leite de coco, o amido e o coco ralado.Leve ao fogo e mexa até engrossar.Acrescente o creme de leite.Coloque na geladeira por 1 hora.Camada de chocolatePrepare o bolo de chocolate, seguindo as intruções da embalagemCom um fio de nylon, corte o bolo ao meio no sentido horizontal para termos 2 camadasColoque as barras de chocolate com um pouco de leite em uma panelaLeve ao fogo.MontagemEm uma tijela, colocaremos a primeira camada do bolo e o umedeceremos com metade do chocolate derretido.Despeje a metade do creme de coco, fazendo a próxima camadaRepita o que foi feito com a camada de chocolate e depois com a de coco.Teremos 4 camadas e podemos decorar o pavêLeve à geladeiraAlternativaConheço pessoas que preferem que a camada de chocolate seja feita com biscoito de maisena, então segue a alternativa.Camada de chocolateIngredientes400g de chocolate ao leite2 caixa de creme de leite6 claras em batidas em neve2 pacote de biscoito de maisena200 ml de leite2 colheres de sopa de achocolatadoModo de preparoColoque em uma panela o chocolate e o creme de leiteLeve ao fogo, misture até ficar homogêneo. Espere esfriar e adicione as claras em neve;Junte o achocolatado ao leite e umedeça os biscoitosNa tijela, coloque metade do creme de chocolate e uma camada de biscoitos umedecidosColoque a camada de cocoRepita o processo, para se ter 4 camadas (2 de chocolate e 2 de coco)Decore e leve à geladeiraConclusãoO pavê de prestígio, é uma receita muito simples e agrada quem gosta de chocolate e coco. Com doce não tem como errar, então ela permite muitas variações. Prefiro fazer com bolo de chocolate, mas também deixo a alternativa com biscoito de maisena. Espero que gostem, até a próxima.","pubDate":"Tue, 12 Apr 2016 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/saborinstintivo/receitas/doce-e-sobremesa/pave-de-prestigio/","category":"doce e sobremesa"}]}
