{"title":"Nerd Calistênico","description":"","language":"pt-br","link":"https://nerdcalistenico.github.io/noobdaera8bits","pubDate":"Sat, 08 Aug 2020 18:20:00 GMT","lastBuildDate":"Fri, 21 Aug 2020 17:30:01 GMT","webMaster":"Noob da era 8 bits","items":[{"title":"Ludo Club - Jogo Divertido de Dados","link":"https://nerdcalistenico.github.io/noobdaera8bits/jogos/tabuleiro/ludo-club/","description":"Ludo Club é a versão online para múltiplos jogadores do épico jogo de tabuleiro Ludo! Junte-se a um clube exclusivo de estrelas neste jogo de dados premium - seja o melhor jogador, conquiste os degraus da vitória e torne-se o REI DO LUDO!Saiba como mover suas peças vermelhas, amarelas, verdes ou azuis com estratégia e sorte da melhor forma no jogo de tabuleiro. Seja o rei do Ludo e torne-se uma estrela! Compita contra outros jogadores e chegue ao topo da classificação! Baixe e instale para obter horas de diversão e prazer.Características:✦ Jogue este jogo de dados com amigos e familiares✦ Conecte-se ao Facebook e jogue o jogo Ludo em dispositivos diferentes!✦ Use muito pouco dados - funciona sem problemas em 2G, 3G e 4G!✦ Jogue o jogo de dados Ludo em modo offline versus computador, e com seus amigos✦ Envie presentes para outros jogadores e amigos✦ Converse com outros jogadores de seu tabuleiro✦ Ganhe moedas GRÁTIS utilizando o nosso Bônus Diário e recursos de Dado da Sorte para continuar jogando!InformaçõesTítulo original: Ludo Club - Fun Dice GameData de lançamento: 24 de Janeiro de 2013 (Brasil)Plataformas: Android e IOSEstúdios: Moonfrog, Moonfrog Labs Pvt Ltd., Play Labs StudioClassificação: LivreOpiniãoLudo é o nome utilizado para a versão do jogo indiano Pachisi. Particularmente, eu não conhecia e foi uma boa surpresa.Se busca um jogo online, onde pode desafiar pessoas de todo o mundo, esse pode ser um jogo que te interesse.Uma mistura de estratégia com sorte, que vai despertar o seu instinto de competidor. Além de jogar com os desconhecidos do mundo, também pode jogar com os seus amigos reais.Se mostra um bom jogo de tabuleiro e onde você gasta um pouco mais de tempo, principalmente se for com 4 jogadores.Se quer algo rápido, só inicie um jogo com 2 jogadores. Sendo assim, é bem flexível na questão de tempo.Considerações finaisLudo Club é completamente grátis para baixar e jogar, no entanto, oferece itens que podem ser comprados com dinheiro de verdade.Abaixo, é possível fazer o download nas lojas: Google Play &nbsp;&nbsp;|&nbsp;&nbsp; App Store","pubDate":"Sat, 08 Aug 2020 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/noobdaera8bits/jogos/tabuleiro/ludo-club/","category":"tabuleiro"},{"title":"Banana Kong","link":"https://nerdcalistenico.github.io/noobdaera8bits/jogos/acao/banana-kong/","description":"Corra, pule e balance em cipós para ajudar Banana Kong a fugir de uma avalanche de bananas! Mantenha o controle com controles de toque altamente precisos.Monte o Javali ou voe com o Tucano para superar obstáculos perigosos, como pedras enormes, crocodilos, piranhas e lava fervendo. A natureza pode ser cruel…Enquanto corre pela selva, você poderá superar seus amigos! A integração com o Game Services permite ver a distância percorrida pelos amigos diretamente no jogo. Compare suas pontuações e desbloqueie proezas enquanto melhora suas habilidades.Um jogo altamente dinâmico que proporciona uma corrida infinita com diversão infinita. Cada sessão é um novo desafio, pois os níveis são construídos aleatoriamente.Apanhe o máximo possível de bananas para encher a barra de energia. Use a Velocidade para destruir obstáculos ou acessar rotas alternativas, como a caverna subterrânea ou o topo das árvores.Encontre segredos e desbloqueie itens adicionais para aproveitar o jogo ao máximo.InformaçõesTítulo original: Banana KongData de lançamento: 24 de Janeiro de 2013 (Brasil)Plataformas: Android e IOSEstúdios: FDG Entertainment GmbH &amp; Co.KGClassificação: LivreOpiniãoNo começo achei que seria algo envolvendo várias fases, ao estilo Super Mario. Tem relação, mas a ideia principal não é de ficar passando de fases e sim, de permanecer vivo pelo maior tempo possível.Sendo assim, traz um desafio diferente dos jogos do mesmo estilo. Fazendo o usuário de desafiar. Lembra o dinossauro da página Sem Internet, no Google Chrome. É claro, com gráficos muito mais elaborados.Não tem muito mistério na jogabilidade, basta permanecer vivo, completar os objetivos e coletar muitas bananas.O jogo fica na lista de jogos rápidos para distrair a mente.Considerações finaisBanana Kong é completamente grátis para baixar e jogar, no entanto, oferece itens que podem ser comprados com dinheiro de verdade.Abaixo, é possível fazer o download nas lojas: Google Play &nbsp;&nbsp;|&nbsp;&nbsp; App Store","pubDate":"Fri, 07 Aug 2020 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/noobdaera8bits/jogos/acao/banana-kong/","category":"ação"},{"title":"Coin Master","link":"https://nerdcalistenico.github.io/noobdaera8bits/jogos/casual/coin-master/","description":"Coin Master permite você viajar pelo tempo e por terras mágicas e batalhar para ser o melhor Pirata, Hippie, Rei, Guerreiro ou Viking de todos os tempos!Gire a roda para lutar contra o tempo, ganhar fortunas, saques, escudos ou invasões. Garanta seus saques carregando seus sacos de ouro ou moedas para construir aldeias resistentes no jogo e subir de níveis. Ganhe escudos para proteger as aldeias de ataques de outros vikings. Torne-se o Coin Master com a vila mais forte e o maior saque!Ganhar moedas no caça-níqueis não é a única maneira de garantir o seu saque, você também pode roubá-lo! Ataque e invada um vilarejo amigo ou inimigo e leve o quanto puder para construir a sua aldeia sem precisar quebrar o cofrinho de porco!Vingue-se daqueles que atacarem a sua aldeia e recupere o que é seu por direito! Traga o seu caça-moedas e fique rico de novo! Não perca tempo, nunca se sabe quais tesouros estão escondidos nas aldeias alheias!Nem só de saque vive uma aldeia, o tesouro também é muito importante! Colete cartas para completar conjuntos e seguir para a próxima aldeia. Quanto mais aldeias conquistar, maiores serão as recompensas!Troque cartas na sua comunidade online para completar suas coleções!InformaçõesTítulo original: Coin MasterData de lançamento: 10 de Janeiro de 2016 (Brasil)Plataformas: Android e IOSEstúdios: Moon ActiveClassificação: LivreOpiniãoEsse é o meu passatempo no momento. Um jogo que não prende muito, no meu caso, o vejo 2 vezes por dia.Lembro, jogo rápido e saio.Para quem busca algo que seja bem rápido e mostre nos cenários regularmente, essa é uma boa dica.É bem simples e parece que tem haver apenas com caça-níqueis, mas o interesse fica em ganhar os recursos e avançar no ranking.Ótimos gráficos e se gasta pouco tempo nele. Portanto, bem casual.Considerações finaisCoin Master é completamente grátis para baixar e jogar, no entanto, oferece itens que podem ser comprados com dinheiro de verdade.Abaixo, é possível fazer o download nas lojas: Google Play &nbsp;&nbsp;|&nbsp;&nbsp; App Store","pubDate":"Thu, 06 Aug 2020 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/noobdaera8bits/jogos/casual/coin-master/","category":"casual"},{"title":"Saint Seiya Awakening: Os Cavaleiros do Zodíaco","link":"https://nerdcalistenico.github.io/noobdaera8bits/jogos/rpg/saint-seiya-awakening/","description":"Saint Seiya Awakening: Os Cavaleiros do Zodíaco é o RPG oficial baseado na renomada série, de Masami Kurumada. Reviva a saga épica, enriquecida com paisagens deslumbrantes e excelentes gráficos que dão vida a todos os seus Cavaleiros favoritos, totalmente em 3D! Aprecie a trilha sonora original da série, além da atuação dos dubladores oficiais japoneses, para curtir uma experiência audiovisual de primeira!O jogo permite que você vivencie as batalhas memoráveis do mangá como nunca antes, dos Duelos Galácticos às Doze Casas do Santuário, do Templo de Poseidon ao Muro das Lamentações, e por fim, os Campos Elísios!Monte sua equipe ideal a partir de uma seleção abrangente de Cavaleiros, cada um com habilidades e características únicas. Com a combinação certa, até mesmo Cavaleiros de Bronze podem derrotar Cavaleiros de Ouro! Empregue estratégia e astúcia para conquistar a vitória, sejam quais forem as circunstâncias! Utilize as poderosas técnicas de seus Cavaleiros com um simples toque na tela e ative o Sétimo Sentido para revelar o verdadeiro potencial de combate de todos eles!Participe dos Duelos Galácticos, nos quais os Cavaleiros lutam pela Armadura de Ouro! Teste suas habilidades contra jogadores do mundo inteiro em lutas JxJ em tempo real, com partidas balanceadas!InformaçõesTítulo original: Saint Seiya Awakening: Knights of the ZodiacData de lançamento: 10 de Setembro de 2019 (Brasil)Plataformas: Android e IOSEstúdios: YOUZU (SINGAPORE) PTE. LTD.Classificação: 12+OpiniãoEsse era um jogo esperado por muitos. Há anos, buscava um jogo dos Cavaleiros do Zodíaco. Fico feliz que o jogo não decepciona e fizeram um bom trabalho.Sempre gostei de colecionáveis como criaturas e/ou no caso, armaduras. A série que vem com muita nostalgia, tem várias possibilidades quando falamos do zodiáco.O jogo conta com muita qualidade gráfica e agrada muita na parte sonora. Tem muita nostalgia envolvida e muita jogabilidade.Pode deixar algumas usuários com o pé atrás, por ser RPG, mas tem muitas interações e tem boa jogabilidade.Devido aos seus gráficos, tem um peso por volta de 2 GB e precisa ter um celular que tenha boa memória ram e bom espaço de armazenamento. Portanto, roda bem em um Samsung Galaxy A30, mas nem é possível baixa em um Samsung Galaxy J4. Citei esses, pois foi onde testei.Também precisa de um bom Wi-fi. Infelizmente a infraestrutura no Brasil, não é boa em todos os lugares. Os jogos cada vez mais, vem buscando mais qualidade e exigindo mais de nossas redes.Com certeza, agrada aos fãs de Os Cavaleiros do Zodíaco e ganha mais fãs graças ao jogo. Nunca fui tão ligado a história, mas graças ao jogo, fiquei prestando mais atenção ao enredo.Considerações finaisSaint Seiya Awakening é completamente grátis para baixar e jogar. Há mais de cem personagens originais de Masami Kurumada para o seu dispositivo móvel.Abaixo, é possível fazer o download nas lojas: Google Play &nbsp;&nbsp;|&nbsp;&nbsp; App Store","pubDate":"Wed, 05 Aug 2020 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/noobdaera8bits/jogos/rpg/saint-seiya-awakening/","category":"rpg"},{"title":"Shadow Fight 2","link":"https://nerdcalistenico.github.io/noobdaera8bits/jogos/luta/shadow-fight-2/","description":"Shadow Fight 2 é uma mistura entre RPG e os classicos jogos de luta. Este jogo permite que você equipe seu lutador com incontaveis armas letais e armaduras raras, contendo dezenas de animações e golpes de artes marciais reais.Viaje por 6 mundos distintos enfrentando demônios neste jogo cheio de ação, carregado de adrenalina e que conta com detalhado sistema de combate com toque de RPG imersivo e história intrigante.InformaçõesTítulo original: Shadow Fight 2Data de lançamento: 1 de maio de 2014 (Brasil)Plataformas: Android, IOS, Windows, Nintendo Switch, PlayStation 4, Mac OS Classic e Xbox OneEstúdios: NekkiClassificação: 12+OpiniãoConheci esse jogo em 2014, mas só em 2016 e 2017, que joguei mais ativamente. O grande atrativo do jogo, é que ele não se torna enjoativo. Os lutadores são silhuetas que tem suas características, mas não se torna algo repetitivo. Resumindo, a arte gráfica foi muito bem elaborada para o jogo.Nunca fui ligado em jogos, por ter a mania de pegar um jogo, virar em algumas horas e depois não ver mais. Acabo fazendo a mesma coisa com séries. No subconsciente, seria meio que dedicar um tempo, mas não perder tempo demais. Por isso, nunca fui de ficar em um mesmo jogo por muito tempo.Esse foi o primeiro jogo que me manteve fiel por 1 ano. Por ser de luta, o tempo que você dedica à ele, é curto ao longo do dia. Por ter um toque de RPG, acaba se tornando um desafio por um longo prazo.Uma hora a história acaba, mas o tempo que leva, faz o jogo ser uma boa experiência.A história gira em torno de ninjas, que faz ser muito interessante cada luta e as ilustrações são muito boas. O controle é bem simples, sendo bem confortável no celular. Não joguei em outras plataformas, mas para jogos nesse estilo, prefiro no celular.Em um console, não vejo tanta graça em jogos de luta. No máximo acho interessante o Injustice, que os gráficos e a combinação de trechos de um filme, merecem ser vistos em uma tela grande.Recomendo esse jogo, ser você curte a arte ninja, bons gráficos e jogos que não ocupam muito tempo do dia. E ainda mais, você pode jogar por meses, em uma mesma história.Considerações finaisShadow Fight 2 é completamente grátis para baixar e jogar, no entanto, oferece itens que podem ser comprados com dinheiro de verdade.Abaixo, é possível fazer o download nas lojas: Google Play &nbsp;&nbsp;|&nbsp;&nbsp; App Store","pubDate":"Fri, 06 Sep 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/noobdaera8bits/jogos/luta/shadow-fight-2/","category":"luta"},{"title":"Jurassic World Com Vida","link":"https://nerdcalistenico.github.io/noobdaera8bits/jogos/aventura/jurassic-world-com-vida/","description":"Os dinossauros voltaram a dominar a Terra, e estão vagando livres pelo nosso mundo. Agora, explore a área ao seu redor e descubra seus dinossauros favoritos do Mundo Jurássico, incluindo novas raças mais impressionantes, e assustadoras, do que nunca!Colete DNA de dinossauros épicos para subir de nível e criar híbridos no laboratório. Crie a equipe de ataque perfeita e leve-a para a batalha em partidas contra outros jogadores em tempo real. Também é possível desafiar seus amigos para ganhar recompensas exclusivas!InformaçõesTítulo original: Jurassic World AliveData de lançamento: 30 de maio de 2018 (Brasil)Plataformas: Android e IOSEstúdios: Ludia, NBCUniversalClassificação: 10+OpiniãoApós o sucesso momentâneo do Pokémon GO, muita gente gosta desse jogo ou simplesmente nem quer saber como é.Sempre me chamou a atenção, o que é colecionável. Acredito que o grande atrativo dos jogos desse tipo, é a possibilidade de ter inúmeros itens diferentes ou nesse caso, dinossauros.Por mais que tenha a realidade aumentada, não uso o recurso. No meu caso, a ideia é só conhecer e ter o maior número de dinossauros possíveis.No momento, devo ter um pouco mais de 60 dinossauros e hoje, o jogo tem até 162 tipos de dinossauros. O que mais chama a atenção no jogo, é a qualidade gráfica.O processo de coleta de DNA, batalhas e coleta de recursos, é bem repetitivo. Com isso, para mim, a graça está em ver e ter as diferentes espécies de dinossauro.Hoje, é um jogo que acesso pouco, mas é interesse ver a coleção de dinossauros. Reserva pouco do seu tempo dia, para cumprir as atividades nele. Por isso, serve bem como um jogo para se distrair.Considerações finaisJurassic World™ Com Vida é completamente grátis para baixar e jogar, no entanto, oferece itens que podem ser comprados com dinheiro de verdade.O uso contínuo do GPS funcionando em segundo plano pode reduzir drasticamente a vida da bateria.Abaixo, é possível fazer o download nas lojas: Google Play &nbsp;&nbsp;|&nbsp;&nbsp; App Store","pubDate":"Thu, 29 Aug 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/noobdaera8bits/jogos/aventura/jurassic-world-com-vida/","category":"aventura"},{"title":"Guns Of Glory","link":"https://nerdcalistenico.github.io/noobdaera8bits/jogos/estrategia/guns-of-glory/","description":"Guns of Glory é um jogo MMO (Multijogadores Massivos Online) de estratégia que coloca você na pele de um cavaleiro destinado a fazer justiça.Assuma a liderança como um Lorde em ascensão em um reino jogado na guerra! Para tornar-se soberano supremo e aproveitar a Coroa do Destino do cardeal que é o vilão dessa história. Você se aliará aos famosos três mosqueteiros, matará feras, construirá seu próprio castelo, terá um dirigível, pode se reunir com amigos para destruir inimigos e muito mais!Treine um exército de mosqueteiros leais, gerencie seus recursos, construa armadilhas e invada seus inimigos para o esquecimento, tudo para se tornar rei e transformar sua Aliança em um império imbatível!InformaçõesTítulo original: Guns Of GloryData de lançamento: 21 de setembro de 2017 (Brasil)Plataformas: Android e IOSEstúdios: FunPlus e Century Game (DianDian Interactive)Classificação: 12+OpiniãoConheci esse jogo em 2018, joguei por pouco tempo e reinstalei novamente há 1 mês atrás. É um jogo de estratégia que deixa muito recursos na tela e atalhos de compra.Pode parecer complexo de imediato, mas conforme vai jogando, as atividades se tornam automáticas.Seu foco inicial se concentra em contruir e montar o seu exército. Esse processo começa fácil onde o tempo para essas atividades, são de curto prazo. Conforme a evolução do castelo e outras construções, o tempo para passar de nível, fica maior. Assim, você dedica menos tempo para o jogo.Hoje, no nível 14 do castelo, só olho uma vez por dia. A maioria das contruções e criação de mosqueteiros, duram mais de 5h de espera.É um jogo que exige disciplina e paciência. Por esses motivos que me fazem gostar do jogo, pois é isso mesmo que estou buscando no momento.Participo da aliança Domination ([DOM]), a galera é bem participativa e comunicativa no chat. A maioria leva a sério o jogo e sempre estão se ajudando.Os gráficos são muitos bons e geralmente jogo no Wi-fi, vejo a galera reclamando um pouco quando se joga no 4g.Ao subir de niveis os recursos ficam mais escassos, mas justamente a integração com a sua aliança e colaboram de outros lordes, fazem o jogo ficar interessante. É um típico MMO, que faz sucesso por você ter contato com outras pessoas e o mesmo propósito.Agora é continuar tendo disciplina e paciência para formar um império.Considerações finaisGuns of Glory é completamente grátis para baixar e jogar, no entanto, alguns itens podem ser adquiridos com dinheiro real. Se não quiser usar esta função, por favor, desabilite compra no aplicativo nas congifurações do seu dispositivo.Abaixo, é possível fazer o download nas lojas: Google Play &nbsp;&nbsp;|&nbsp;&nbsp; App Store","pubDate":"Wed, 28 Aug 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/noobdaera8bits/jogos/estrategia/guns-of-glory/","category":"estratégia"}]}
