{"title":"Nerd Calistênico","description":"","language":"pt-br","link":"https://nerdcalistenico.github.io/foradabolha","pubDate":"Sat, 17 Aug 2019 18:20:00 GMT","lastBuildDate":"Wed, 09 Sep 2020 19:37:57 GMT","webMaster":"Fora da Bolha","items":[{"title":"Marechal Rondon - O desbravador e os índios","link":"https://nerdcalistenico.github.io/foradabolha/artigos/individuo/marechal-rondon-o-desbravador-e-os-indios/","description":"Nascido em Mimoso, no estado de Mato Grosso, em 5 de maio de 1865. Cândido Mariano da Silva Rondon, ou simplesmente Marechal Rondon, foi um militar, explorador, pacificador e sertanista brasileiro. Viveu 92 anos, vindo a falecer em 19 de janeiro de 1958, no Rio de Janeiro. O sobrenome Rondon, com a autorização do Ministério da guerra, ele acrescentou ao seu próprio nome, como uma forma de homenagem ao seu tio que cuidou dele até os seus dezesseis anos.Não é à toa que pode vir o estado de Rondônia em sua mente. Cujo estado é o único do Brasil, que tem seu nome como forma de homenagem a uma figura histórica nacional.Morrer se preciso for, matar nunca! – Lema de Marechal RondonFamíliaSeu pai, Cândido Mariano da Silva, descendia de portugueses e espanhóis miscigenados com índígenas Guaná. Sua mãe, Claudina Freitas Evangelista, era descendente de indígenas Terena e Bororo.Infelizmente seu pai morreu de varíola, em 1864, e sua mãe faleceu em 1867. Sendo Rondon, criado pelo seu avô José Mariano da Silva, que posteriormente veio a falecer. Restando o seu tio paterno, Manuel Rodrigues da Silva Rondon, capitão da Guarda Nacional, que o levou para Cuiabá para cuidar de sua criação.Iniciando a sua vida no exércitoRondon, deixa os cuidados do seu tio e ingressa no Exército Brasileiro, aos 16 anos.O jovem incorpora-se ao 3º Regimento de Artilharia à Cavalo, como soldado. Logo após, ingressa na Escola Militar da Praia vermelha, no Rio de Janeiro, onde obtém o bacharelado em Ciências Físicas e Naturais.Em março de 1889, ingressou na Escola Superior de Guerra. Foi aluno de Benjamin Constant, de quem recebeu a formação positivista que conservou por toda a vida. Ainda no mesmo ano, participou do movimento político-militar no Rio de Janeiro que derrubou a monarquia e instituiu o regime republicano no país.Em dezembro de 1889, recebeu o título de engenheiro militar e de bacharel em matemática e ciências físicas pela Escola Militar. No dia 23 deste mesmo mês, é nomeado Ajudante do major Antonio Ernesto Gomes Carneiro na Comissão Construtora de Linhas Telegráficas de Cuiabá ao Araguaia.Em 4 de janeiro de 1890, era promovido a alferes (posto correspondente hoje a aspirante-a-oficial). Três dias depois, ascendeu ao posto de Primeiro-tenente de Estado Maior de Primeira Classe por serviços relevantes à República.Em 1891, tornou-se professor de Astronomia e Mecânica da Escola Militar.Constituindo uma nova famíliaEm fevereiro de 1982, casou-se no estado do Rio de Janeiro com Francisca Xavier, filha de um de seus professores do curso preparatório. Eles tiveram sete filhos: Bernardo Tito, Heloísa, Clotilde, Beatriz Emília, Branca Luíza, Maria Sylvia e Maria de Molina.Em março de 1982, Rondon é nomeado chefe do Distrito Telegráfico de Mato Grosso e pede exoneração do cargo de professor. Em setembro do mesmo ano, promovido a capitão, substituiu o major Gomes Carneiro na chefia da Comissão Construtora de Linhas Telegráficas.Desbravando em paz com os índiosRondon teve uma grande importância no sertão brasileiro, abrindo caminhos, lançando linhas telegráficas, registrando sua topografia, descobrindo rios, estudando a flora e a fauna. E quando você vê um cenário que junta militares e índios, pode parecer que houve dispustas e desentendimentos, mas segundo a história e relatos de quem participou das expedições, foram estabelecidas relações respeitosas e desmistificando a imagem que os índios tinham de violentos, na época.Com essa mentalidade humanista, foi possível que as missões de desbravamentos e construções fossem realizadas em paz, sem combates. Entre outras nações indígenas, Rondon manteve contato pacífico com o povo Bororo, Nhambiquara, Urupá, Jaru, Karipuna, Ariqueme, Boca Negra, Pacaás Novo, Macuporé, Guaraya, Macurape, entre outras.De 1892 a 1898, Rodon ajudou a construir as linhas telegráficas de Mato Grosso a Goiás, entre Cuiabá e o Araguaia, e uma estrada de Cuiabá a Goiás. Nomeado auxiliar técnico da Intendência Geral da Guerra em 1899, permaneceu pouco tempo no cargo.Em 1900, recebeu a missão de estender a ligação telegráfica a partir do Rio de Janeiro até as fronteiras com o APraguai e a Bolívia. Durante esse trabalhado, Rondon foi promovido a major em 1903. Essa expedição terminou em 1906, e foram contruídas 1.746km de linhas telegráficas, ficando o Rio de Janeiro ligado à Corumbá e Coimbra, na fronteira da Bolívia, e a Porto Murtinho e Bela Vista, na fronteira com o Paraguai.Em 1907, no posto de major do Corpo de Engenheiros Militares, foi nomeado chefe da comissão que deveria construir a linha telegráfica de Cuiabá a Santo Antônio do Madeira, a primeira a alcançar a região amazônica, e que foi denominada Comissão Rondon. Esse trabalho foi desenvolvido de 1907 a 1915.Durante esse período, houve o processo de demarcação de pequenas reservas de terras para os índios do Mato Grosso ao Amazonas. Ele tinha uma real preocupação com os povos indigenas, devido a um cenário marcadamente de extermínio aos povos indígenas no Brasil.Essa comissão, acabou sendo mais do que uma expedição para estender linhas telegráficas e se tornou um simbolo de contato com os povos indígenas.Em 20 de junho de 1910, foi criado o primeiro órgão de assistência aos indígenas. O Serviço de Proteção aos Índios (SPI) foi organizado pelo marechal Rondon, seu primeiro diretor, sendo substituído apenas na década de 60 pela Fundação Nacional do Índio (Funai), que atua até hoje.Theodore Roosevelt e o rio da dúvidaTheodore Roosevelt, Jr. foi um militar, explorador, naturalista, autor e político norte-americano. Ele foi o 26º Presidente dos Estados Unidos de 1901 a 1909, tendo ascendido à presidência depois de brevemente atuar como o 25º Vice-presidente.1 ano após de ter sido derrotado na eleição de 1912, quando tentava o seu terceiro mandato. Ele aceitou os convites da Argentina, Brasil e Chile para fazer conferências. No Brasil, ele faria uma expedição para obter espécimes da fauna brasileira, para o Museu Americano de História Natural de Nova York.O nosso governo brasileiro, ofereceu o então coronel Rondon, para acompanhá-lo a expedição e a ajuda logística para o transporte de até 5 toneladas de bagagens.No dia 4 de outubro de 1913, Rondon encontrava-se no interior da Floresta Amazônica, no posto telegráfico de Barão do Melgaço, quando recebeu telegramas dos ministros da Guerra, Viação e Exterior informando-o da nova missão.Em 12 de dezembro de 1913, Rondon partiu com o ex-presidente dos Estados Unidos, Theodore Roosevelt na Expedição Científica Rondon-Roosevelt, cujos objetivos eram explorar o Rio da Dúvida. A expedição deixou Tapiripuã e chegou ao Rio da Dúvida em 27 de fevereiro de 1914. Eles colocaram no mapa do Brasil um rio antes totalmente desconhecido, pois o que era o rio da Dúvida, passou a ser o Rio Roosevelt. A Expedição durou até o dia 7 de maio de 1914.A aventura envolveu muitos sacrifícios, sendo a expedição mais difícil da vida de Roosevelt. Segundo as pesquisas que fiz, 3 pessoas morreram nessa aventura. O rio tem cerca de 1500 km de extensão, nascendo no município de Vilhena, Rondônia, e deságua no rio Madeira, no estado do Amazonas.Continuando a carreiraApós a expedição com Roosevelt, Rondon continuou mapeando o estado de Mato Grosso, até 1919. Descobrindo mais alguns rios e fzanedo contato com várias tribos indígenas.Como general de brigada em 1919, Rondon foi nomeado diretor de Engenharia do Exército, e autorizou a construção de quartéis. Nessa época ele também acumulou os cargos de chefe da corporação brasileira de engenheiros e de chefe da Comissão Telegráfica. E em 1923, sendo promovido a general de divisão.Em 1924 e 1925, é nomeado para reprimir os militares rebeldes que, sob o comando de Isidoro Dias Lopes, combatiam o governo federal nos Estados do Paraná e de Santa Catarina. Fora ter o trabalho na inspeção das linhas telegráficas.Entre 1927 a 1930, fica responsável pela inspeção das fronteiras do País, estudando seu povoamento e segurança, enquanto mantém a inspeção das linhas telegráficas. Com a Revolução de 1930, solicita passagem para a reserva do Exército. Assim, preparando relatórios da inspeção de fronteiras, de 1931 a 1934.Nomeação como MarechalEm 5 de maio de 1955, data de seu aniversário de 90 anos, recebeu o título de Marechal Honorário do Exército Brasileiro, concedido pelo Congresso NacionalPatrono das comunicaçõesEm 1963, foi homenageado com a designação de Patrono da Arma de Comunicações do Exército Brasileiro. E é por isso, que no dia 5 de maio, é celebrado o Dia Nacional das Telecomunicações, em homenagem ao dia do seu aniversário. Se vê que o dia 5 de maio, foi bem marcante na vida de Rondon.Considerações finaisTinha que falar do Marechal Rondon, por ter servido no exército na área de comunicações como soldado. Onde tive a oportunidade de conhecer mais sobre esse patrono que foi muito importante para a nossa história e contribuiu muito para a proteção dos índios.E vale lembrar que:Em 1939, Rondon é nomeado presidente do Conselho Nacional de Proteção aos Índios.Em 1943, o Dia do Índio é instituído no Brasil.Em 1948, constrói em Mimoso, com recursos próprios, as Escolas Reunidas Santa Claudina.Em 1952, encaminha ao presidente da República o projeto de criação do Parque do Xingu, elaborado por antropólogos e indigenistas.Em 1953, junto com Darcy Ribeiro, inaugura o Museu do Índio.Em 1955, lança o último volume da sua obra Índios do Brasil.Em 1956, o território de Guaporé é renomeado Rondônia.Em 1957, surge, no exterior e no Brasil, um movimento apresentando a sua candidatura ao Prêmio Nobel da Paz .Em 1958, com 92 anos, falece a 19 de janeiro em sua residência no Rio de Janeiro.Acredito que foi possivel mostrar uma parte da história desse indivíduo que teve grande importância na evolução do Brasil.ReferênciasMarechal Rondon - Militar BrasileiroMarechal Rondon - IntroduçãoMarechal Rondon - ComunicaçõesMarechal Rondon: 150 anos de nascimento do eterno sertanista brasileiroLivro revela aspectos inéditos da vida de Marechal Rondon e sua relação com os índiosMarechal Rondon - Museu do ÍndioJornalista desvenda as muitas faces do marechal RondonLivro - Dicionário histórico-biográfico da Primeira República (1889-1930)Criação do SPIMarechal Rondon cria Serviço de Proteção aos Índios (SPI), transformado em Funai","pubDate":"Sat, 17 Aug 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/foradabolha/artigos/individuo/marechal-rondon-o-desbravador-e-os-indios/","category":"indivíduo"},{"title":"Tokusatsu - Um presente do Japão","link":"https://nerdcalistenico.github.io/foradabolha/artigos/audiovisual/tokusatsu-um-presente-do-japao/","description":"Tokusatsu (特撮) é a abreviação em japonês para a expressão tokushu satsuei(特殊撮影), que pode ser traduzido como efeitos especiais. Acabou se tornando um termo para se referir a filmes ou séries live-action com efeitos especiais.O primeiro filmeQuando você ouve falar em filme japonês com efeitos especiais, é quase certo que você irá pensar em Godzilla, ou melhor Gojira (ゴジラ). Esse tipo de filme é do gênero Kaiju(怪獣), que costuma ser traduzido como monstro e foi o longa que abriu as portas com grande sucesso na época. O primeiro filme do Godzilla teve a direção de Ishirō Honda e foi lançado em 3 de novembro de 1954, no Japão.Na década de 50, também surgiu o gênero de super-herói mascarado no Japão, que foi ganhando mais popularidade que os monstros gigantes e começou a onda das séries de Tokusatsu. O primeiro filme que traz um super-herói, é o Super Giant (Sūpā Jaiantsu) de 1957. O personagem principal foi interpretado por Ken utsui e virou uma franquia com 9 filmes.Super Giant(スーパー・ジャイアンツ 鋼鉄の巨人) - 30 de julho de 1957Super Giant Continues(続スーパー・ジャイアンツ 続鋼鉄の巨人) - 13 de agosto de 1957Super Giant - The Mysterious Spacemen’s Demonic Castle(スーパー・ジャイアンツ 怪星人の魔城) - 01 de outubro de 1957Super Giant - Earth on the Verge of Destruction(スーパー・ジャイアンツ 地球滅亡寸前) - 08 de outubro de 1957Super Giant - The Artificial Satellite and the Destruction of Humanity(スーパー・ジャイアンツ 人工衛星と人類の破滅) - 28 de dezembro de 1957Super Giant - The Spaceship and the Clash of the Artificial Satellite(スーパー・ジャイアンツ 宇宙艇と人工衛星の激突) - 03 de janeiro de 1958Super Giant - The Space Mutant Appears(スーパー・ジャイアンツ 宇宙怪人出現) - 29 de abril de 1958Super Giant Continues - The Devil’s Incarnation(続スーパー・ジャイアンツ 悪魔の化身) - 27 de março de 1959Super Giant Continues - Kingdom of the Poison Moth(続スーパー・ジャイアンツ 毒蛾王国) - 24 de abril de 1959As primeiras séries de TVSuper Giant deu o ponta pé e 1 ano depois do primeiro filme, surgiu o primeiro super-herói Japonês da história, exclusivo para a TV. Em 1958, a Toei Company produzia o Gekko Kamen (月光仮面), sendo traduzido como Máscara Luar e foi criado pelo escritor Kohan Kawauchi.O estúdio existe até hoje e na época só tinha 1 ano desde a sua fundação. A série teve a direção de Tsuneo Kobayashi e foi trasmitido de 24 de fevereiro de 1958 a 5 de julho de 1959, pela atual TBS TV no Japão. A série teve 131 episódios e foram divididos em 5 capítulos.Com grande sucesso e com a porta aberta, veio a onda de séries. Pesquisei por um bom tempo as séries que foram lançadas e tentei colocar todas aqui. A listagem pode estar incompleta, mas com certeza tem algo de novo para quem tem um conhecimento razoável desse universo.7-Color Mask (七色仮面) - Nana-Iro Kamen31 episódios - 3 de junho de 1959 a 30 de junho de 1960National Kid (ナショナルキッド) - Nashonaru Kiddo39 episódios - 4 de agosto de 1960 a 27 de abril de 1961Ultraman (ウルトラマン) - Urutoraman39 episódios - 17 de julho de 1966 a 9 de abril de 1967Captain Ultra (キャプテンウルトラ) - Kyaputen Urutora24 episódios - 16 de abril de 1967 a 24 de setembro de 1967Ultraseven (ウルトラセブン) - Urutorasebun49 episódios - 1 de outubro de 1967 a 8 de setembro de 1968O Príncipe Dinossauro (怪獣王子) - Kaiju Ouji26 episódios - 2 de outubro de 1967 a 25 de março de 1968Robô Gigante (ジャイアントロボ) - Jaianto Robo26 episódios - 11 de outubro de 1967 a 1 de abril de 1968Spectreman (スペクトルマン) - Supekutoruman63 episódios - 2 de janeiro de 1971 a 25 de março de 1972Kamen Rider (仮面ライダー) - Kamen Raidā98 episódios - 3 de abril de 1971 a 10 de fevereiro de 1973O Regresso de Ultraman (帰ってきたウルトラマン) - Kaettekita Urutoraman51 episódios - 21 de abril de 1971 a 31 de março de 1972Mirrorman (ミラーマン) - Mirāman51 episódios - 5 de dezembro de 1971 a 26 de novembro de 1972Ultraman Ace (ウルトラマンエース) - Urutoraman Ēsu52 episódios - 8 de abril de 1972 a 31 de março de 1973Rainbowman (愛の戦士レインボーマン) - Ai no Senshi Reinbōman52 episódios - 6 de outubro de 1972 a 18 de setembro de 1973Iron King (アイアンキング) - Aian Kingu26 episódios - 8 de outubro de 1972 a 8 de abril de 1973Jumborg Ace (ジャンボーグ) - Janbōgu Ēsu50 episódios - 17 de janeiro a 29 de dezembro de 1973Kamen Rider V3 (仮面ライダーV3) - Kamen Raidā Buisuri52 episódios - 17 de Fevereiro de 1973 a 09 de fevereiro de 1974Zone Fighter (流星人間ゾーン) - Ryūsei Ningen Zōn26 episódios - 2 de abril a 24 de setembro de 1973Ultraman Taro (ウルトラマンタロウ) - Urutoraman Tarō53 episódios - 6 de abril de 1973 a 5 de abril de 1974Kamen Rider X (仮面ライダーX) - Kamen Raidā Ekkusuepisódios - 16 de Fevereiro de 1974 a 12 de outubro de 1974Ultraman Leo (ウルトラマンレオ) - Urutoraman Reo51 episódios - 12 de abril de 1974 a 28 de março de 1975Kamen Rider Amazon (仮面ライダーアマゾン) - Kamen Raidā Amazon24 episódios - 19 de Outubro de 1974 a 29 de março de 1975Kamen Rider Stronger (仮面ライダーストロンガー) - Kamen Raidā Sutorongā39 episódios - 05 de abril de 1975 a 27 de dezembro de 1975SentaiInterrompi a listagem das séries em 1975, porque não poderia deixar de mencionar que neste mesmo ano, foi criado um novo gênero de Tokusatsu: o Sentai. Que são as séries nas quais equipes de três a cinco guerreiros, cada um usando um uniforme de cor diferente, defendem a Terra das forças do mal.A primeira série desse gênero foi Himitsu Sentai Goranger (Esquadrão Secreto Goranger), que teve 84 episódios e foi transmitido de 5 de Abril de 1975 até 26 de Março de 1977.Depois tivemos a série JAKQ Dengeki Tai (ジャッカー電撃隊), sendo traduzido como Equipe Relâmpago JAKQ, tendo 35 episódios e sendo exibido originalmente de 9 de abril e 24 de dezembro de 1977.Super SentaiEm 1979, após as 2 primeiras séries que citei acima, as demais equipes passaram a dispor de veículos mecânicos que se transformam em um robô gigante, passando a denominar-se Super Sentai.Em 1993, tivemos a primeira adaptação norte-americana do gênero Super Sentai, com a série Mighty Morphin Power Rangers ou simplesmente Power Rangers. Sendo composta de 3 temporadas (145 episódios), de 28 de agosto de 1993 a 27 de novembro de 1995. Ela foi uma adaptação da série Kyouryu Sentai Zyuranger, que foi a 16ª série japonesa do gênero e foi transmitida no Japão, de 21 de fevereiro de 1992 a 12 de fevereiro de 1993 e teve 50 episódios.O curioso é saber que o ranger amarelo no Kyouryu Sentai Zyuranger, foi o Takumi Hashimoto, que era o Manabu Yamashi na série Jiraiya.Metal HeroTambém vale falar desse gênero que tinha como premissa básica ter um jovem que usava uma armadura metálica de última geração para combater uma organização maligna que ameaçasse a paz na Terra. E pelo que me lembro, essa foi a franquia que mais gostei. É claro que tive mais contato com a adaptação norte-americana com o gênero Super Sentai, mas até hoje, tenho grande nostalgia quando lembro ou consigo rever Jiraiya, Jaspion e etc…Abaixo, temos grandes heróis desse gênero.Gyaban (宇宙刑事ギャバン) - Uchū Keiji Gyaban44 episódios - 5 de março de 1982 a 25 de fevereiro de 1983Sharivan (宇宙刑事シャリバン) - Uchū Keiji Shariban51 episódios - 4 de março de 1983 a 24 de fevereiro de 1984Shaider (宇宙刑事シャイダー) - Uchū Keiji Shaidā49 episódios - 2 de março de 1984 a 8 de março de 1985Jaspion (巨獣特捜ジャスピオン) - Kyojū Tokusō Jasupion46 episódios - 15 de março de 1985 a 24 de março de 1986Metalder (超人機メタルダー) - Chōjinki Metarudā39 episódios - 16 de março de 1987 a 17 de janeiro de 1988Jiraiya (世界忍者戦ジライヤ) - Sekai Ninja Sen Jiraiya50 episódios - 24 de janeiro de 1988 a 22 de janeiro de 1989Jiban (機動刑事ジバン) - Kidō Keiji Jiban52 episódios - 29 de janeiro de 1989 a 28 de janeiro de 1990Winspector (特警ウインスペクター) - Tokkei Uinsupekutā49 episódios - 4 de fevereiro de 1990 a 13 de janeiro de 1991Solbrain (特救指令ソルブレイン) - Tokkyū Shirei Soruburein53 episódios - 20 de janeiro de 1991 a 26 de janeiro de 1992Exceedraft (特捜エクシードラフト) - Tokusō Ekushīdorafuto49 episódios - 2 de fevereiro de 1992 a 24 de janeiro de 1993B-Fighter Kabuto (ビーファイターカブト) - Bī Faitā Kabutoepisódios - 3 de março de 1996 a 16 de fevereiro de 1997No BrasilO Tokusatsu chegou no Brasil em 1964, com o National Kid e nessa mesma década o nosso país também conseguiu acompanhar a saga do Ultraman, Principe Dinossauro e Vingadores do espaço. Na década de 80, conseguimos ter Spectreman, Jaspion, Changeman, Jiraiya e outros.E não poderia deixar de citar que em 1995, tivemos acesso aos Power Rangers, na TV aberta com a TV Colosso.Considerações finaisÉ claro que o artigo não está como uma listagem completa com todas as séries e franquias, pois esse não é o intuito. Temos as franquias Ultraman e a Kamen Rider, que tem inúmeras séries e mesmo sendo muito boas, não tinha a necessidade de listar aqui.A ideia é mostrar um pouco desse universo com algumas curiosidades e para quem não conhecia, tem muita coisa para absorver.Como é notável nesse artigo, o gênero Tokusatsu inundou a TV e infelizmente muitos subgêneros e séries ficaram cansativas. A boa notícia que até hoje algumas franquias tem força. Kamen Rider Amazons está com força total no Amazon Prime Video. Nesse serviço de streaming, relembrei a primeira temporada de Jiraiya, em breve irei para a segunda.A Toei Company lançou filmes novos nesse ano e está para ser lançado em agosto de 2020, a versão brasileira de Jaspion. Confira mais sobre isso no artigo do Mundo Nipo.Então, esse universo ainda continua ativo e terá muita coisa pela frente. Até a próxima!ReferênciasGojira (1954)月光仮面作品紹介Gekko Kamen (1958) - Primeiro herói exclusivo para a TVIntro to Tokusatsu Superheroes – Part 1Tokusatsu: Saiba tudo sobre o universo dos heróis japoneses!Tokusatsu – História, sucesso e curiosidadesAs Séries Tokusatsu No Japão","pubDate":"Thu, 15 Aug 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/foradabolha/artigos/audiovisual/tokusatsu-um-presente-do-japao/","category":"audiovisual"},{"title":"Manner hands - Um sinal de respeito na Coréia","link":"https://nerdcalistenico.github.io/foradabolha/artigos/cultura/manner-hands-um-sinal-de-respeito-na-coreia/","description":"Manner hands (tradução literal: mãos educadas) refere-se ao posicionamento adequado e cortês das mãos de uma pessoa por respeito a outra pessoa.Fãs internacionais e artistas coreanosHá decepção dos fãs internacionais em relação ao manner hands ser usado não só entre os artistas, mas também na relação artista-fã. Tendo em vista que os fãs sempre fazem de tudo para o seu ídolo, e quando finalmente podem conhecê-los não são tocados por eles.Como a Coreia é um país que preza muito o respeito, os coreanos não vêem esse gesto como um gesto de indiferença e sim de respeito.Então, fica bem complicado a compreensão dos fãs que não são coreanos e não estão acostumados com esse comportamento de respeito.Keanu ReevesDesde o começo do ano passado, o ator chamou a atenção dos fãs, quando os mesmos começaram a notar algo diferente nas fotos com fãs e artistas. Se você for buscar na internet fotos com o ator Keanu Reeves, verá que na maioria delas, ele não encosta em quem está ao seu lado.Muitas teorias já foram levantadas e até esse momento não foi encontrada nenhuma entrevista ou algo do tipo, em que o ator revela o motivo desse comportamento. Devido a sua história de vida, alguns acham que o motivo seria para não pegar a carga negativa das pessoas. Outros dizem que seria para evitar processos de assédio.Como ainda não tem um motivo oficial, prefiro continuar com a terceira teoria, que seria manner hands. Uma coisa que reforça essa teoria, seria o seu pai ter descendência chinesa, trazendo para ele, um pouco da cultura asiática.Posso lançar uma quarta teoria, que apenas seja um sinal de respeito em relação a uma pesssoa (Jennifer Syme, único relacionamento assumido).Hover handsNo ocidente, temos a hover hands (tradução livre: mãos que pairam no ar). Esse comportamento acabou virando motivo para memes, mas não foi pela cultura coreana e sim, devido a fotos de fãs com artistas que não queriam muita intimidade.Em 21 de outubro de 2010, um post intitulado E agora, momentos desajeitados com Summer Glau foi submetido ao site de humor (Fark), com várias fotos da atriz americana posando com os fãs da série de televisão de ficção científica Firefly. No mesmo dia em que as fotos com Glau foram enviadas a Fark, um usuário do Reddit, enviou outra imagem da mesma compilação em um post intitulado Observe a ‘hover hand’. Forever Alone;.Um mês depois, uma versão editada da imagem foi enviada em um post intitulado Hoverhands - o abraço para sempre sozinho.Em novembro e dezembro de 2010, a imagem foi postada em sites como Buzzfeed, FunnyJunk, Cheezburger e o Tumblr com o título Fuck Yeah, Hover Hands. Em 5 de dezembro, um dos primeiros tópicos de discussão surgiram nos fóruns do Bodybuilding, o que levou a mais de 26 páginas de imagens de exemplo de hovers hands.Os americanos também criaram esse termo para definir o que é considerado um detector instantâneo de virgindade (Virgin Floating Hand). E daí, vem a confusão toda de saber o que é brincadeira ou respeito. :/Como podemos ver na imagem acima, também tiveram fãs que encostaram na atriz e a mesma estava tranquila. Só para mostrar que o meme foi gerado de uma parte dos fatos.Considerações finaisComo em outros países o assédio em relação as mulheres, é algo forte diariamente. Por outro lado, tem leis mais rígidas e tenta fortalecer na cultura a questão do respeito. Não existe um lugar ideal no mundo em relação a questão de igualdade de gênero. Mesmo assim, temos que reconhecer que na Ásia, se tem uma presença mais de respeito na cultura. E isso não quer dizer que seria o paraíso para as mulheres, pelo contrário, se tem as questões com a questão de submissão e etc.. Só estou me referindo ao respeito em sociedade, que aqui no Brasil, tem pessoas que acham que tem o direito de tocar nas pessoas, sem permissão.Manner hands não se aplica apenas para um gênero, mas acaba havendo mais ênfase nas notícias na relação homem e mulher. Também é possível ver na internet, que o respeito também se aplica em homem x homem e mulher x mulher.","pubDate":"Fri, 19 Jul 2019 18:20:00 GMT","guid":"https://nerdcalistenico.github.io/foradabolha/artigos/cultura/manner-hands-um-sinal-de-respeito-na-coreia/","category":"cultura"}]}
